[
  {
    "title": "Pen Tester- Cyber Security Engineer L1",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/xSghRh4De5g6-Pen-Tester--Cyber-Security-Engineer-L1-Fixed-Solutions-Cairo-Egypt",
    "experience": "1 to 3 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Cybersecurity, Mobile Development, JIRA, Java, Penetration Testing, ASP.Net, Software Development, Software Engineering, Vulnerability Scanning, Web Applications, API, Mobile Application Testing",
    "description": "Conduct formal testing on computer systems \n \nAssess the security of computer software and hardware\n \nConduct security audits and legal cyberattack simulations by designing and utilizing hacking tools to access designated pieces of data during a predetermined time frame\n \nGenerate tools for breaking into security systems \n \nDetect and correct system weaknesses \n \nProvide recommendations based on an assessment of hardware and software systems \n \nImplement solutions to enhance data security\n \nProvide IT support\n \nPlanning, implementing, managing, monitoring, and upgrading security measures for the protection of the organization's data, systems, and networks.\n \nTroubleshooting security and network problems.\n \nResponding to all system and/or network security breaches.\n \nEnsuring that the organization's data and infrastructure are protected by enabling the appropriate security controls.\n \nParticipating in the change management process.\n \nTesting and identifying network and system vulnerabilities.\n \nDaily administrative tasks, reporting, and communication with the relevant departments in the organization.",
    "requirements": "Requirements\n• Good knowledge of tools used for web application penetration testing.\n \n• Good knowledge of tools used for network penetration testing.\n \n• Experience conducting advanced penetration testing exercises (Web applications, Mobile Applications, APIs and Network)\n \n• Developing, extending, or modifying exploits, shellcode or exploit tools.\n \n• Vulnerability assessment / Security assessment tools\n \n• Familiarity with security public standards and testing methodologies: OWASP top 10 for Mobile, Web and API. OWASP Application Security Verification Standard (ASVS), MITRE ATT&CK, etc.\n \n• Proficiency with one or more programming languages: JAVA, ASP.net , PHP, C/C++, Python, GO, etc.\n \n• Experience in developing cybersecurity testing tools, and exploits development\n \n• Industry certifications preferred (e.g., GPEN, GWAPT, OSCP, OSWE, eWPTX, etc.) ( not required)"
  },
  {
    "title": "Marketing Manager",
    "posted_date": "Posted8 hoursago",
    "job_url": "https://wuzzuf.net/jobs/p/XJvLAg8dptLD-Marketing-Manager-dejavu-Cairo-Egypt",
    "experience": "5 to 10 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Digital Marketing, digital marketing, Digital, Marketing, Social Media, Budgeting",
    "description": "Translates Brand assets and initiatives into winning Retail programs.       \nTurns insights into actionable, compelling programs.\nCoordinates with Occasions and POS teams for in-account visibility/POS item development.\nCoordinates the development of sales tools.\nPlan and execute all digital marketing, including SEO/SEM, marketing database, email, social media and display advertising campaigns.\nDesign, build and maintain our social media presence.\nMeasure and report performance of all digital marketing campaigns, and assess against goals (ROI and KPIs)\nIdentify trends and insights and optimize spend and performance based on the insights.\nDevelop a comprehensive e-commerce strategy to achieve business and brand annual targets.\nEnsure flawless execution of the e-commerce calendar activities, measuring and reporting on ROI.\nDevelop loyalty programs and schemes with relevant stakeholders to increase website transactions and ordering frequency.\nBuild partnerships to enhance brand awareness, penetration, and sales, while developing corporate deals to drive volume.\nCollaborate with internal teams to create landing pages and optimize user experience.\nUtilize strong analytical ability to evaluate end-to-end customer experience across multiple channels and customer touch points.\nCollaborate with agencies and other vendor partners.\nEvaluate emerging technologies. Provide thought leadership and perspective for adoption where appropriate.",
    "requirements": "Excellent computer skills.\nExcellent Managerial and analytically skills Wide experience in budgeting.\nHave good relations with Marketing Agencies. \nWide experience in Digital Marketing is a must. \nMBA would be an appreciated plus"
  },
  {
    "title": "Managing Director - Generators Industry",
    "posted_date": "Posted2 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/Le5jED5X9uRg-Managing-Director---Generators-Industry-Stufflink-Cairo-Egypt",
    "experience": "7 to 15 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "generator, diesel generator, International Business Development, Management, Engineering",
    "description": "Our client is a leading provider of engineering and contracting solutions. This role will be responsible for leading the Generator Business Unit, ensuring excellence across key operational areas as outlined below:\n \n--1. Engineering Department Management (Technical Office & Tendering):\n- Provide technical leadership and mentorship to engineering teams to enhance processes, efficiency, and capabilities.  \n- Oversee the preparation and review of technical and commercial proposals to ensure competitiveness and compliance with client requirements.\n \n2. Start-up, Commissioning, and Warranty Management:\n- Supervise the start-up and commissioning activities of new diesel generator installations, ensuring seamless integration and reliable operation at client sites.  \n- Manage the commissioning team to ensure compliance with client specifications and optimal performance of equipment.  \n- Lead the guarantee and warranty process, ensuring timely resolution of post-installation technical issues and maintaining high customer satisfaction.\n \n3. Sales and Market Expansion:\n- Develop and implement sales strategies to drive business growth across the Libyan, Egyptian, and Saudi markets.  \n- Cultivate strong relationships with key clients, distributors, and strategic partners to maximize market penetration.  \n- Conduct market research and competitive analysis to identify growth opportunities and align product offerings with customer needs.  \n- Support the sales team in managing key accounts and closing high-value deals.\n4. After-Sales Service and Customer Support:\n- Oversee all aspects of after-sales service, ensuring responsive and effective support to address customer issues.  \n- Ensure timely maintenance, troubleshooting, and technical support to uphold service excellence and customer satisfaction.\n \n5. Logistics, Supply Chain, and Vendor Management:\n-  logistics, shipping, transportation, insurance, warehousing, and inventory to ensure efficient operations and cost control.  \n- Strengthen relationships with factories and suppliers to enhance collaboration and supply chain reliability.",
    "requirements": "MANAGING DIRECTOR FOR DIESEL GENRATOR \nEngineering Department Management(  technical office & tendering ) : Provide technical guidance and mentorship to engineering staff to improve processes and capabilities.\nStartup and Commissioning & Guarantee Management  :\nSupervise the start-up commissioning process for new diesel generators, ensuring smooth integration and operation at customer sites.\nManage the commissioning team to ensure that equipment meets client specifications and operational efficiency.\nOversee the guarantee and warranty management processes, ensuring timely response and resolution of any technical issues post-installation.\nSales and Market Expansion:\nDevelop and execute sales strategies to drive revenue growth in the Libyan, Egyptian, and Saudi Arabian markets.\n Build strong relationships with key clients, distributors, and partners in each market.\nLead market analysis to identify new opportunities and maintain a competitive edge.\nEnsure alignment between product offerings and customer needs in each market.\nManage key accounts and support the sales team in closing major deals.\nAfter-Sales Services and Support\nOversee all after-sales services, ensuring timely and effective resolution of customer issues.\nEnsure high levels of customer satisfaction through prompt maintenance, troubleshooting, and technical support.\nLogistics, Shipping, and Transportation, Insurance ,Warehousing and Inventory Management\nEnhancing Relations with the Factory\n \nQualifications:\nEducation: Bachelor’s degree in Engineering (Mechanical/Electrical) or Business Administration (Master’s degree preferred).\nExperience: At least 10-15 years of experience in the diesel generator industry, with a minimum of 5 years in a senior management or leadership role.\nSkills:\nStrong leadership and decision-making abilities.\nExtensive experience in engineering, commissioning, after-sales services, logistics, shipping, insurance, warehousing, and factory relations.\nProven track record in sales and market expansion, particularly in Libya, Egypt, and Saudi Arabia.\nKnowledge of logistics, supply chain management, and operations.\nIn-depth knowledge of diesel generators and power generation technologies.\nAbility to manage cross-functional teams effectively and foster collaboration.\nExcellent communication, negotiation, and interpersonal skills.\nFluency in Arabic and English (both written and spoken)."
  },
  {
    "title": "On-Site Corporate Sales Executive",
    "posted_date": "Posted5 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/dUchoYOWYXbA-On-Site-Corporate-Sales-Executive-Med-Right-For-Medical-Services-Cairo-Egypt",
    "experience": "1 to 2 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Sales, sales skills, Healthcare, Sales Target, Selling, Corporate Sales",
    "description": "Providing customers with quotations: \nPrepare and deliver accurate and competitive quotations based on customer requirements, ensuring all details are clearly communicated.\nPresenting the company profile:\n Professionally present the company’s profile, highlighting key benefits, exclusions, and competitive advantages. Ensure that potential clients clearly understand the value proposition.\nRepresenting the organization at industry events:\n Act as the face of the company at trade exhibitions, industry events, and product demonstrations. Engage with potential clients, partners, and stakeholders to build relationships and expand the company’s network.\nNegotiating with company HR:\n Work closely with company HR to negotiate variations in pricing, delivery schedules, and product specifications, ensuring that both customer needs and company goals are met.\nIdentifying new markets and business opportunities:\n Continuously research and identify new markets, business opportunities, and potential clients. Develop strategies to penetrate these markets effectively.\nUpdating and managing customer databases:\n Regularly update and maintain customer databases, ensuring that all contact information, communication history, and sales progress are accurately recorded.\nAssessing and communicating financial risks:\n Evaluate the degree of financial risk associated with each customer or deal and communicate findings to the supervisor for appropriate action.\nAchieving and exceeding sales targets:\n Consistently work towards achieving and exceeding set sales targets and objectives. Develop and implement strategies to improve sales performance.\nSkilled negotiation and persuasion:\n Use strong negotiation and persuasion skills to influence client decisions, overcome objections, and guide clients toward favorable outcomes.\nProblem-solving and reasoning:\n Utilize logic and critical thinking to identify the strengths and weaknesses of various solutions, conclusions, or approaches to challenges, ensuring the best outcomes for both the client and the company.\nBuilding and maintaining client relationships:\n Develop and nurture long-term relationships with clients, providing ongoing support and ensuring high levels of customer satisfaction.\nCollaborating with internal teams:\n Work closely with marketing, product development, and customer service teams to align strategies, share insights, and ensure a cohesive approach to meeting customer needs.\nReporting and analysis:\n Prepare regular reports on sales performance, market trends, and customer feedback. Provide insights and recommendations for improving sales strategies.",
    "requirements": "Bachelor’s Degree from an accredited college or university, preferably in healthcare and healthcare management.\n1 to 2 years experience in the sales field preferred for selling services."
  },
  {
    "title": "Regional Account Manager",
    "posted_date": "Posted7 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/XxZNKCUj4E5Q-Regional-Account-Manager-Influence-Communication-Cairo-Egypt",
    "experience": "More than 5 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential, QA & Annual Bonuses\nMedical Insurance\nSocial Insurance\nFinancial Offers\nWork From home",
    "skills": "business, Communication, Communication skills, Marketing, Negotiation, Project Management, Client Relations, Management, sales skills, Sales Target, Sales, Customer Service, Business Development, Business Administration, Account Management, Microsoft Office, English, Contract Negotiation",
    "description": "Client Relationship Managemen\nt:\nManage and serve as the primary point of contact for key clients in Saudi Arabia, ensuring satisfaction and retention. \nDevelop a deep understanding of clients' business objectives, challenges, and industry landscape to provide strategic solutions. \nLead client meetings and contract negotiations\nPlanning & Campaign Oversight\nExecute strategic sales plans to penetrate target markets and industries. \nEstablish strong relationships with key decision-makers and influencers in the market.\nStrategic Planning & Market Intelligence\nMonitor market trends, competitor activities, and regulatory changes to identify risks and opportunities. \nProvide insights and recommendations to enhance business strategy and service offerings. \nWork closely with the marketing team and studio to create region-specific campaigns\nOperational & Financial Performanc\nMaintain accurate records of client interactions, contracts, and financial forecasts. \nEnsure timely invoicing, collections, and compliance with contractual agreements",
    "requirements": "Bachelor's degree in Business Administration, Marketing, or a related field.\nMinimum \n5+ years\n of experience in account management and/or business development, preferably in the\n GCC market.\nStrong relationship-building and negotiation skills to manage high-value clients.\nExcellent communication and presentation skills in \nArabic & English\n.\nProficiency in Microsoft Office Suite.\nAbility to handle client challenges and apply problem-solving techniques effectively.\nHigh attention to detail, organizational skills, and ability to manage multiple projects simultaneously.\nKSA Experience"
  },
  {
    "title": "Sales Coordinator ( Tire industry )",
    "posted_date": "Posted7 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/WHr91L8rUoeL-Sales-Coordinator-Tire-industry-Global-Tires-Trading-and-Distribution-Cairo-Egypt",
    "experience": "2 to 4 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Administration, Branch, Branch Management, business, Business Administration, Human Resources, Management, Microsoft Office, Office management, Production, Sales, Secretary",
    "description": "Direct all operational aspects including distribution operations, customer service, human resources, administration and sales\nAssess local market conditions and identify current and prospective sales opportunities\nDevelop forecasts, financial objectives and business plans\nMeet goals and metrics\nManage budget and allocate funds appropriately\nBring out the best of branch’s personnel by providing training, coaching, development and motivation\nLocate areas of improvement and propose corrective actions that meet challenges and leverage growth opportunities\nShare knowledge with other branches and headquarters on effective practices, competitive intelligence, business opportunities and needs\nAddress customer and employee satisfaction issues promptly\nAdhere to high ethical standards, and comply with all regulations/applicable laws\nNetwork to improve the presence and reputation of the branch and company\nStay abreast of competing markets and provide reports on market movement and penetration",
    "requirements": "Proven branch management experience, as a Bank Manager or similar role\nSufficient knowledge of modern management techniques and best practises\nAbility to meet sales targets and production goals\nFamiliarity with industry’s rules and regulations\nExcellent organizational skills\nResults driven and customer focused\nLeadership and human resources management skills\nBS in Business Administration or related field"
  },
  {
    "title": "Software Quality Control Lead",
    "posted_date": "Posted8 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/dVMDFo1kC6w7-Software-Quality-Control-Lead-Tafeel-Cairo-Egypt",
    "experience": "5 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Automation, Automation Testing, Agile, Computer Science, Information Technology (IT), ISTQB, Quality Control, Selenium, Software, Software Testing, SQL, Testing",
    "description": "Responsible for carrying out all testing activities related to enterprise products and projects.\nEnsuring deliverables are released to specification as well as the highest quality standards in compliance with the organizational processes and standards.\nCreate test scenarios, test conditions & expected results, and test cases.\nExecute test scripts and test software programs to compare specifications, documentation.",
    "requirements": "Bachelor’s degree in a relevant field (computer science is preferred)\n6+ years of relevant experience\nExcellent knowledge of SQL, mobile, API, web testing, and automation testing (using Selenium and Cucumber).\nExperience with issue tracking systems (e.g., Azure DevOps), performance, integration, and security testing.\nExperience with the Agile process.\nGood knowledge of the software testing process of integration with CI/CD.\nISTQB (advanced level, test manager) certification is a plus.\nISTQB (expert level) is a must.\nSolid understanding of code versioning tools, such as Git.\nProven ability to deal with ambiguity.\nSelf-driven and proactive spirit.\nHigh communication and critical thinking skills.\nGood command of English."
  },
  {
    "title": "Deputy Commercial Director",
    "posted_date": "Posted9 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/zdnEz0vnbTrt-Deputy-Commercial-Director-Cairo-Egypt",
    "experience": "15 to 20 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Commercial, Animal Feed, animal health, Pharmaceutical, Sales, Marketing",
    "description": "1- Strategic Support & Market Analysis:\nConduct comprehensive market research and competitive analysis to identify trends, opportunities, and risks.\nProvide data-driven insights to support commercial strategy and decision-making.\nassist in developing annual commercial plans, budgets, and forecasts aligned with business objectives.\n2-Sales Management Support\n:\nWork closely with the sales team to monitor performance, identify improvement areas, and implement actionable strategies.\nSupport the development and execution of pricing, promotion, and distribution strategies to enhance market penetration.\nbuild and maintain strong relationships with key customers and industry stakeholders.\n3- Marketing & Product Management Support:\n  Collaborate with the marketing team to execute effective marketing campaigns.\nProvide input on product innovation and development, ensuring alignment with market needs.\n  Support the lifecycle management of products, including new product launches and market positioning.\n4-Strategic project leadership:\n  \n Lead high-impact strategic projects assigned by the Commercial Director, including market expansion, product launch, and business development initiatives\nManage timelines, budget, and resources to ensure successful project execution.\nFacilitate cross-functional collaboration to align strategic goals with business operations.\n5-\nTeam Development & Leadership:\n   mentor and develop the sales and marketing teams, fostering a culture of performance and continuous learning.\nProvide coaching and training to enhance commercial capabilities within the organization.\nEncourage collaborative teamwork and innovation.\n \n6-Operational excellence & Efficiency:\nIdentify and implement process improvements to streamline commercial operations.\nOptimize resource allocation, sales workflows, and reporting systems.\nEnsure seamless execution of commercial plans by aligning teams and processes.",
    "requirements": "Experience:\nMinimum of 7+ years in commercial leadership, sales or marketing within animal health, feed, or pharmaceutical industry are highly preferred .\nknowledge\nLeadership & team Development:\n experience in mentoring and leading commercial teams\nProject Management:\n Strong ability to lead and execute strategic projects.\nAnalytical & Financial acumen:\n ability to interpret sales data, develop forecasts, and optimize pricing strategies.\nCommunication & Relationship building:\n Excellent negotiation and stakeholder management skills."
  },
  {
    "title": "Sales Director",
    "posted_date": "Posted9 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/VOQaQ065jmad-Sales-Director-Midea-Group-Giza-Egypt",
    "experience": "15 to 20 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "B2B, MBA, Sales Management, Sales Target, Director, business, Business Administration, Sales, Sales Planning",
    "description": "Lead market penetration for new territories, segments, and products. Identify strategic opportunities and partnerships to boost brand visibility and performance.\nTranslate market trends and insights into actionable initiatives. Develop and achieve annual sales targets and budgets.\nManage the P&L and monitor profitability across segments. Drive pricing, discount structures, and promotional policies.\nEnsure compliance with policies, regulations, and ethical standards. Establish robust sales governance frameworks.\nBuild and lead a high-performing sales organization. Develop talent pipelines and succession planning. Create a performance-driven culture with coaching and KPI tracking.\nImplement training programs to upskill the salesforce. Lead sales forecasting, demand planning, and market sizing. Utilize sales analytics and market data for decision-making.\nAnalyze sales performance and recommend adjustments. Collaborate with marketing for brand strategy alignment. Work with product management and operations for launches and planning. Coordinate with customer service for end-to-end satisfaction.",
    "requirements": "Bachelor’s degree in business administration, Marketing, or a related field.\nMBA or certification in Sales is preferred.\n15-20 years of experience in sales, with at least 5 years in a traditional trade sales management role.\nProven track record in the home appliance industry is preferable\nStrong background managing multiple sales channels (Traditional, Modern Trade, B2B, Online)\nStrong understanding of the home appliance market and dealer dynamics in Egypt."
  },
  {
    "title": "Sales Engineering Manager Air Outlets",
    "posted_date": "Posted9 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/f83lvTG1l9CB-Sales-Engineering-Manager-Air-Outlets-MG-Cairo-Egypt",
    "experience": "9 to 13 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "AIR, Air Conditioning, Communication skills, Mechanical Engineering, Microsoft Office, Sales Target, sales skills, HVAC, Sales, Engineering, Skills, Communication",
    "description": "Strategically identify and pursue potential clients within the air-outlets and duct components sector, focusing on market expansion and customer acquisition.\nDevelop and implement comprehensive sales strategies to consistently meet and exceed revenue targets, aligning efforts with overall business objectives.\nLead the provision of technical consultations and product guidance to clients, ensuring optimal solutions and customer satisfaction.\nFoster and sustain long-term relationships with key stakeholders, enhancing client retention and driving repeat business.\nOversee market research initiatives and data analysis to uncover trends, refine sales approaches, and support informed decision-making.\nCompile and present detailed sales reports, forecasts, and performance analyses to senior management, facilitating strategic planning.\nDirect vendor list penetration strategies, targeting consultant offices across Egypt and the GCC, to expand brand visibility and business opportunities.",
    "requirements": "Experience:\n 9 - 13+ years of proven success in a managerial or senior sales engineering role within the air-outlets, duct components, or broader HVAC industry.\nEducation:\n Bachelor’s degree in Mechanical Engineering or a related technical discipline.\nIndustry Expertise:\n In-depth technical knowledge of air-outlets and duct components, with hands-on experience delivering engineering-based sales solutions.\nSales Acumen:\n Demonstrated ability to consistently meet or exceed sales targets in a results-driven environment.\nCommunication Skills:\n Exceptional interpersonal, negotiation, and communication skills, capable of building trust and rapport with clients and stakeholders at all levels.\nProfessionalism:\n Fluent in English, both written and spoken; well-presented and confident in high-level meetings and public engagements.\nTechnical Proficiency:\n Skilled in using CRM platforms and Microsoft Office Suite to manage client relationships and support strategic sales activities.\nLeadership Attributes:\n High-performing individual with a strong work ethic, capable of managing multiple priorities under pressure and tight deadlines.\nAdaptability & Commitment:\n Flexible and adaptable; willing to travel and attend industry events and client meetings across Egypt and the GCC. Willingness to work extended hours as required by business demands."
  },
  {
    "title": "Projects Sales Engineer",
    "posted_date": "Posted10 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/RS3wnFjluSef-Projects-Sales-Engineer-Scib-Paints-Cairo-Egypt",
    "experience": "2 to 4 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Chemical Engineering, Civil, Communication skills, sales skills, Project Management, Presentation, Chemical, fresh gradutes, Building Materials, waterproofing, Paints, Coatings",
    "description": "Job Purpose\nThe position is that of frontline sales personnel who would primarily be responsible for growth and penetration of SCIB products in project sales segments in defined geography through lead conversions and product trainings to various stake holders like applicators, contractors and thereby achieving overall business objectives.",
    "requirements": "Bachelor degree specialized in civil, chemical engineering or equivalent.\nHas a valid driving license and a car is a Must.\nExcellent English is a must.\nExcellent Selling Skills\nExcellent written and verbal communication skills\nExcellent presentation and creativity skills\nWillingness to travel"
  },
  {
    "title": "QualityAsurance Lead / Test Lead",
    "posted_date": "Posted12 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/xHHvd6peDWcb-QualityAsurance-Lead-Test-Lead-Alexandria-Egypt",
    "experience": "5 to 7 years",
    "education": "Not Specified",
    "salary": "Confidential, Social Insurance & Medical Insurance",
    "skills": "ISTQB, Agile, Software Development, Selenium, Cypress, CI/CD Integration",
    "description": "We are looking for a QA Lead / Test Lead to oversee the quality assurance process, ensuring the reliability, security, and performance of software applications. The ideal candidate should have strong expertise in test automation, CI/CD integration, and Agile testing practices. This role requires hands-on experience with manual and automated testing, as well as leadership skills to guide and mentor the QA team.\nKey Responsibilities:\n1. Test Strategy & Planning\n Define and implement the QA strategy, test plans, and testing processes in an Agile Scrum environment.\n Ensure test coverage for functional, regression, performance, security, and API testing.\n Collaborate with Product Owners, Developers, and DevOps engineers to align testing efforts with business goals.\n2. Test Execution & Automation:\n Lead the development and execution of automated test scripts for web and API testing.\n Implement and maintain test automation frameworks (Selenium, Cypress, Playwright, JUnit, TestNG, RestAssured, etc.).\n Ensure integration of automated tests with CI/CD pipelines (Jenkins, GitHub Actions, GitLab CI/CD).\n Oversee manual testing where automation is not feasible.\n3. Agile Testing & Continuous Quality Improvement:\n Drive shift-left testing, ensuring early involvement in the development cycle.\n Conduct Exploratory Testing, Smoke Testing, and UAT (User Acceptance Testing).\n Define and track QA metrics (defect density, test coverage, test execution rate, etc.).\n Advocate for TDD (Test-Driven Development) and BDD (Behavior-Driven Development) practices.\n4. Performance & Security Testing:\n Oversee performance and load testing using tools like JMeter, Gatling, or k6.\n Ensure security testing best practices, identifying vulnerabilities through penetration testing and API security assessments.\n5. Team Leadership & Collaboration:\n Lead and mentor the QA team, ensuring knowledge sharing and upskilling.\n Collaborate with development, DevOps, and product teams to improve software quality.\n Conduct code reviews for test scripts and ensure testing best practices.",
    "requirements": "Technical Skills:\n 5+ years of experience in software testing, with at least 2 years in a QA lead role.\n Expertise in test automation tools (Selenium, Cypress, Playwright, JUnit, TestNG, etc.).\n Strong experience with API testing (Postman, RestAssured, Karate, SoapUI).\n Knowledge of CI/CD pipelines and DevOps integration (Jenkins, GitLab CI/CD, Docker, Kubernetes).\n Experience with performance testing tools (JMeter, Gatling, k6).\n Familiarity with security testing tools (OWASP ZAP, Burp Suite, SonarQube).\n Strong understanding of Agile Scrum and QA processes.\nLeadership & Agile Skills:\n Experience leading QA teams and mentoring testers.\n Strong knowledge of Agile testing principles and practices.\n Excellent problem-solving skills and analytical mindset.\n Strong communication skills to work with cross-functional teams.\nPreferred Certifications:\n ISTQB (Foundation or Advanced Level) Certification.\n Certified Agile Tester (CAT) or Certified Scrum Master (CSM"
  },
  {
    "title": "Branch Supervisor",
    "posted_date": "Posted21 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/xw3epVVadt6t-Branch-Supervisor-Riyadh-Saudi-Arabia",
    "experience": "7 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Hard Work, Team Coaching, Team management, Communication skills, sales skills, Branch Management, Customer Service, Management",
    "description": "Direct all operational aspects including distribution operations, customer service, human resources, administration and sales\nAssess local market conditions and identify current and prospective sales opportunities\nDevelop forecasts, financial objectives and business plans\nMeet goals and metrics\nManage budget and allocate funds appropriately\nBring out the best of branch’s personnel by providing training, coaching, development and motivation\nLocate areas of improvement and propose corrective actions that meet challenges and leverage growth opportunities\nShare knowledge with other branches and headquarters on effective practices, competitive intelligence, business opportunities and needs\nAddress customer and employee satisfaction issues promptly\nAdhere to high ethical standards, and comply with all regulations/applicable laws\nNetwork to improve the presence and reputation of the branch and company\nStay abreast of competing markets and provide reports on market movement and penetration",
    "requirements": "Proven branch management experience, as a Bank Manager or similar role\nSufficient knowledge of modern management techniques and best practises\nAbility to meet sales targets and production goals\nFamiliarity with industry’s rules and regulations\nExcellent organizational skills\nResults driven and customer focused\nLeadership and human resources management skills\nBS in Business Administration or related field"
  },
  {
    "title": "Senior Sales Account Manager",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/ReR099aJXUye-Senior-Sales-Account-Manager-Target-Integrated-Systems-Cairo-Egypt",
    "experience": "2 to 6 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "CRM, account manager, Sales, Sales Target, sales skills, Software, business, Communication, Communication skills, Computer Science, Customer Service, English, Management, Marketing",
    "description": "Complete understanding of the company's product line, target markets, and competition.\nManage a portfolio of accounts in a manner that achieves long-term business objectives.\nDevelop and maintain positive relationships with customers. \nAct as the point of contact and handle customers’ needs.\nEnsure the successful delivery of products / services with high levels of customer satisfaction.\nGenerate new business using existing and potential customer networks.\nResolve conflicts and provide solutions to customers in a timely manner.\nManage customers’ opportunity lifecycle until closing phase and collection of all company dues in coordination with all involved departments.\nEffectively manage technical discussions with customers to assess their needs and propose solutions and products.\nActively engaged with the existing customers to generate new opportunities while looking forward to attracting new logos.\nAdhere to all the company established policies and procedures.\nInstantly log all activities on CRM while reporting the daily actions with the Sales Dept. Head.\nRegularly reporting on the opportunities for growth to the Sales Dept. Head.",
    "requirements": "University degree, computer science or IT related degree is a plus.\nPost Graduate Studies in Project Management, Marketing, Sales or other relevant fields is a big plus.\nAt least one sales or presales certification of IT products.\nProven experience as Sales Account Manager in the IT field is a must.\nProven experience dealing with Manufacturing Automotive or FMCG sector will be a big plus.\nProven ability to lead his own sales process and close business deals\nKnowledge of CRM software and Productivity application (Word, Excel, Power Point and Outlook).\nUnderstanding of sales performance metrics.\nEnglish | Excellent writing and speaking.\nExcellent negotiation and communication skills.\nHigh time management and strategic planning skills.\nBusiness acumen with a problem-solving attitude and flexibility.\nStrong presentation and interpersonal skills\nExcellent data organization and analysis skills\nAbility to expand existing client base with complete understanding of penetrating new accounts."
  },
  {
    "title": "Vendor Management",
    "posted_date": "Posted26 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/xi9yPJ3TpkgL-Vendor-Management-Bnaia-Cairo-Egypt",
    "experience": "More than 2 years",
    "education": "Not Specified",
    "salary": "Confidential, attractive salary commission and incentive package",
    "skills": "analytical, Data Analysis, Logistics, Management, Marketing, Purchasing, Sales, Supply Chain, Vendor Management, Business Development, Vendors, Vendor Development, Category Management, Engineering, Account Management, Accounts Payable, Key Account Management, Project Management, Communication, Procurement, Purchasing Management, Business Planning, Business Analytics, Sales Planning",
    "description": "Strategic Sourcing:\n Identify and source potential vendors through various channels, including online platforms, professional networks, and industry events. Determine appropriate acquisition criteria based on business needs.\nContract Negotiation:\n Negotiate favorable contracts with suppliers, ensuring competitive pricing and optimal terms.\nVendor Performance Management:\n Assess and evaluate vendor performance based on pre-defined metrics, addressing any issues and driving continuous improvement.\nInventory Management:\n Maintain sufficient inventory levels to meet business demands, collaborating with relevant departments to forecast needs and optimize stock.\nLogistics & Distribution:\n Coordinate the routing of supplies to appropriate departments, ensuring timely delivery and efficient distribution.\nCompliance & Quality Assurance:\n Ensure vendor compliance with company standards and quality requirements.\nFinancial Management:\n Manage vendor billing and disbursements, ensuring accurate and timely payments.\nCollaboration & Communication:\n Coordinate with internal teams (e.g., procurement, operations, marketing) to understand their needs and ensure alignment with vendor capabilities.\nCategory Management:\n Contribute to category penetration strategy and pricing strategy development.\nCross-Functional Support:\n Provide support to other teams in fulfilling their procurement needs.",
    "requirements": "Proven experience as category manager or similar role\nSolid knowledge of category management, marketing and sales principles\nUnderstanding of data analysis and forecasting methods\nProficient in MS Office\nAn analytical mind with a strategic ability\nExcellent communication and people skills"
  },
  {
    "title": "Cyber Security Engineer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/uHzPnWye868R-Cyber-Security-Engineer-Hestia-Dental-Cairo-Egypt",
    "experience": "Not Specified",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Computer Science, Information Technology (IT), Network Security, Engineering, CISSP, CEH, Security, SIEM, Network",
    "description": "Implement and maintain security protocols including MFA, data encryption, endpoint detection, vulnerability management, and backup solutions.\nConduct security assessments, identify vulnerabilities, and recommend appropriate remediation steps.\nCollaborate with software development and IT teams to ensure secure application architecture and infrastructure.\nDevelop and enforce security policies, procedures, and best practices.\nStay updated with the latest security trends, threats, and technology solutions.\nConduct regular audits and tests to ensure system integrity and security compliance.\nDocument security systems and protocols for internal and external audits.",
    "requirements": "Requirements:\nProven experience as a Cybersecurity Engineer or similar role.\nDeep understanding of cybersecurity concepts, including network security, endpoint security, encryption, and risk management.\nProficiency with security tools and technologies such as MFA, NGAV, EDR, SIEM, and vulnerability management systems.\nExperience with cloud security and compliance standards.\nStrong knowledge of regulatory requirements related to data protection and cyber liability insurance.\nExcellent problem-solving skills and attention to detail.\nStrong communication skills to explain complex security concepts to stakeholders.\nFamiliarity with cybersecurity frameworks like NIST, ISO 27001, or similar.\nPreferred Qualifications:\nRelevant certifications such as CISSP, CISM, CEH, or similar.\nExperience with HIPAA compliance for healthcare applications.\nBackground in performing security audits and penetration tests"
  },
  {
    "title": "Assistant Branch Manager",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/7PXVGW2V3NEb-Assistant-Branch-Manager-Kazlak-grillhouse-and-smokery-Cairo-Egypt",
    "experience": "5 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "12000 to 18000 EGP Per Month",
    "skills": "Branch Management, Food, Management, Customer Relations, Staff development, Administration, Branch, Human Resources, Microsoft Office, Office management, Production, Sales, Secretary",
    "description": "Direct all operational aspects including distribution operations, customer service, human resources, administration and sales\nAssess local market conditions and identify current and prospective sales opportunities\nDevelop forecasts, financial objectives and business plans\nMeet goals and metrics\nManage budget and allocate funds appropriately\nBring out the best of branch’s personnel by providing training, coaching, development and motivation\nLocate areas of improvement and propose corrective actions that meet challenges and leverage growth opportunities\nShare knowledge with other branches and headquarters on effective practices, competitive intelligence, business opportunities and needs\nAddress customer and employee satisfaction issues promptly\nAdhere to high ethical standards, and comply with all regulations/applicable laws\nNetwork to improve the presence and reputation of the branch and company\nStay abreast of competing markets and provide reports on market movement and penetration",
    "requirements": "Branch Manager\nProven branch management experience, in food & beverage\nSufficient knowledge of modern management techniques and best practices\nAbility to meet sales targets and production goals\nFamiliarity with industry’s rules and regulations\nExcellent organizational skills\nResults driven and customer focused\nLeadership and human resources management skills"
  },
  {
    "title": "Branch Manager",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/lUmNJ4c6mkIk-Branch-Manager-Cairo-Egypt",
    "experience": "4 to 6 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Administration, Branch Management, Business Administration, Customer Service, Manager, Sales, Production, Management, Branch, sales skills",
    "description": "Direct all operational aspects including distribution operations, customer service, human resources, administration and sales\nAssess local market conditions and identify current and prospective sales opportunities\nDevelop forecasts, financial objectives and business plans\nMeet goals and metrics\nManage budget and allocate funds appropriately\nBring out the best of branch’s personnel by providing training, coaching, development and motivation\nLocate areas of improvement and propose corrective actions that meet challenges and leverage growth opportunities\nShare knowledge with other branches and headquarters on effective practices, competitive intelligence, business opportunities and needs\nAddress customer and employee satisfaction issues promptly\nAdhere to high ethical standards, and comply with all regulations/applicable laws\nNetwork to improve the presence and reputation of the branch and company\nStay abreast of competing markets and provide reports on market movement and penetration",
    "requirements": "Proven branch management experience, as a Bank Manager or similar role\nSufficient knowledge of modern management techniques and best practises\nAbility to meet sales targets and production goals\nFamiliarity with industry’s rules and regulations\nExcellent organizational skills\nResults driven and customer focused\nLeadership and human resources management skills\nBS in Business Administration or related field"
  },
  {
    "title": "Information Security Section Head",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/uYF7bYnCjmfr-Information-Security-Section-Head-Nahdet-Misr-Publishing-Group-Giza-Egypt",
    "experience": "10 to 20 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "computer, Information Technology (IT), ISO",
    "description": "Job Description\n \nDesign and implement Security policies according to the ISO 27001 guidelines\n \nConduct regular security assessments, vulnerability scans, and penetration tests to identify and address potential weaknesses and threats according to the annual schedule plan.\n \nMonitor network traffic and system logs for potential security incidents and respond promptly to mitigate risks and minimize potential impact.\n \nAdvanced knowledge with the Kaspersky environment and EDR Solutions\n \nDLP Understanding\n \nFirewall logs monitor and analysis\n \nCollaborate with cross-functional teams to integrate security measures into the development lifecycle of applications, systems, and infrastructure.\n \nParticipate in incident detection and response efforts, including investigation, containment, and recovery.\n \nStay updated with the latest security threats, vulnerabilities, and industry trends to proactively identify emerging risks and implement necessary controls.\n \nParticipate in security awareness training programs for employees to educate them on security best practices and promote a security-conscious culture.\n \nImplement IT Security Controls & Requirements\n \nPrepare monthly/quarterly reports and dashboards showing the security analytical data\n \nSetting and testing the policies implemented on all Company Laptops/Desktops required to protect Company data from been stolen or been lost/corrupted.\n \nReview and test the network security policies/configurations to protect the Company networks from unauthorized access, cyber/virus attacks\n \nReview all vulnerability reports and take the corrective action needed\n \nWorking according the ISO 27001 framework controls",
    "requirements": "Academic and professional qualifications: \nBachelor in computer science, computer engineering, or equivalent.\n \n \nExperience:\n  Min 10  years of experience in the same field\n \nTechnical Specifications:\n \nISO 27001 Certified\n \nCISA Certified is preferred"
  },
  {
    "title": "Technology Sales Specialist",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/fICY4eXMtWAH-Technology-Sales-Specialist-Sam-Tech-Cairo-Egypt",
    "experience": "1 to 2 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Sales Field, Marketing Online, Computer Science, communications, business, Information Technology (IT), Sales",
    "description": "Develops a business plan and sales strategy for the market that ensures the attainment of company sales goals and profitability.\nPrepares action plans by individuals as well as by team for effective search of sales leads and prospects.\nInitiates and coordinates the development of action plans to penetrate new markets.\nProvide high-level direct client contact.\nAchieve growth and hit sales targets by successfully managing the sales team.\nDevelop new markets as needed.\nDesign and implement a strategic business plan that expands the company's customer base and ensures its strong presence.\nObjectives setting, Training, and performance monitoring of sales representatives.\nBuild and promote strong, long-lasting customer relationships by partnering with them and understanding their needs.\nIdentify emerging markets and market shifts while being fully aware of new products and competition status.\nProvides timely, accurate, competitive pricing on all completed prospect applications submitted for pricing and approval, while striving to maintain a maximum profit margin.\nAssist sales team with meetings and Sales closing.\nDo the Market research.\nAdvise and discuss special campaigns/promotions required for the market.\nGather customer information and make sure the customer database is up-to-date for all business communications.\nKeep an update on the market and our product.\nFollow up on customer enquiries.\nReceive customer inquiries and complaints.\nUpdate weekly reports for existing clients' prospected contacts and In Funnel accounts.\nA proven commitment to follow through with what you begin is essential.\nAdditional Responsibility: \nAs Assigned by the Department Head.",
    "requirements": "Proven experience in \ntechnology sales, IT solutions, or software sales\n (e.g., SaaS, cloud solutions, cybersecurity, hardware, etc.).\nStrong \nunderstanding of technology products and services\n.\nExcellent \ncommunication, negotiation, and presentation skills\n.\nAbility to \nbuild strong relationships\n and provide client-focused solutions.\nSelf-motivated, target-driven, and capable of working independently.\nExperience using \nCRM software\n (e.g., Salesforce, HubSpot) is a plus.\nBachelor’s degree\n in Business, IT, or a related field (preferred but not mandatory)."
  },
  {
    "title": "Customer & Market Knowledge Analyst",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/UxtCRJ6YwMZX-Customer-Market-Knowledge-Analyst-Alshaya-Cairo-Egypt",
    "experience": "3 to 5 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Analysis, Customer Support, Customer Service, Market Research, Research",
    "description": "The Customer & Market Knowledge Analyst will gather, analyze, and interpret customer and market data, primarily external, to support managers & brands to make strategic decisions. The role will involve a mix of qualitative and quantitative research methodologies to deliver actionable insights that drive business growth, product development, and marketing strategies. The successful candidate will work cross-functionally, collaborating with key stakeholders to bring data-backed insights and translate them into actions. \njob Purpose:\n \nCollaborate with key stakeholders to deliver fact-based, objective views of the brands. \nIdentify strategic possibilities for business growth through market development (higher penetration, frequency, Intensity of purchase) and tactical opportunities for the marketing teams to capitalize on. \nUse your innate ability and passion to understand and empathize with consumers and customers to deliver valuable insights to the business. \nWorking with your manager to identify consumer and market trends across MENA and using these to shape brand strategies.  \n1. Market Research & Customer Insights\n \nDesign and Conduct Research\n: Execute market research studies (both qualitative and quantitative research methodologies) to build actionable recommendations & solve business issues. \nCompetitive Analysis\n: Continuously monitor competitors’ strategies, product offerings, and market positioning to assess potential opportunities and threats. \nTrend Analysis\n: Identify and interpret macroeconomic & category trends to understand how they impact customer behavior and business performance.  \nMarket understanding\n: proactively using secondary (desktop research) data sources to understand customer preferences, buying behaviors, and satisfaction levels. Responsible for providing categories yearly forecasted growth and other macroeconomic KPIs to support brand growth. \n \n \n2. Cross-Functional Collaboration\n \nStakeholder Communication\n: Present research findings to internal teams, including marketing, Operations, and Business Directors, ensuring they have clear, actionable insights. \nPartnerships with External Agencies\n: Build relationships with third-party market research agencies, ensuring projects are delivered on time and within budget. \nCross Departmental Collaboration\n:  \nCollaborate with various departments to ensure customer insights are integrated into the brand’s overall strategy, from correct portfolio play to customer experience. \nAssist in the development and implementation of action plans for your key brands based on insights. \nProduct & Service Innovation\n: Partner with the Marketing and Operations teams within brands (demand planning) to help grow the business, identify unmet customer needs and validate product concepts before market introduction. \n \n \n3. Performance Tracking & Reporting\n \nKPI Measurement\n: Monitor key performance indicators (11 Alshaya Measures) related to brand’s awareness, consideration, as well as other brand health tracker KPIs, market share, DNA statements, etc. \nCampaign Evaluation\n: Track the effectiveness of marketing campaigns, adjusting strategies based on performance insights, leveraging external as well as internal data in the process. \nRegular Reporting\n: Produce and present regular market and customer insights reports, ensuring key stakeholders remain informed about changing market conditions and customer sentiment, primarily the quarterly BHT presentations.",
    "requirements": "Technical Skills:\n \nGood understanding of quantitative research solutions: e.g., BHT, U&A studies, listing studies, segmentation...etc. \nExperience in Qualitative Research: Experience in designing focus groups, in-depth interviews, and thematic analysis. \nA/B Testing and Experimentation: Familiarity with designing and interpreting experiments to test different campaigns or product hypotheses. \nStrong analytical skills and the ability to interpret complex datasets. \nHighly proficient with Excel & PowerPoint tools. \nSoft Skills:\n \nAnalytical Thinking: Critical thinking, problem-solving \nCommunication: Data storytelling and presentation \nCollaboration: Cross-functional teamwork, influencing skills \nAttention to Detail: Accuracy, thoroughness \nAdaptability: Flexibility, handling ambiguity \nStrategic Thinking: Business acumen, big picture mindset \nCuriosity: Inquisitiveness, passion for learning \nTime Management: Prioritization, multitasking \nProblem-Solving: Solution-oriented, decision-making \nEmotional Intelligence: Empathy, conflict resolution \nCreativity: Innovative thinking\n \nAcademic Background & Experience:\n \nBachelor’s degree in business administration, Economics, Finance, Marketing or Engineering. \n3-5 years of experience implementing market research studies, developing insights into actions. Preferred experience within FMCGs or on the agency side (Ipsos, Kantar, Nielsen or other)."
  },
  {
    "title": "Export Manager",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/ne2JqqIVs7Ny-Export-Manager-National-Glass-Giza-Egypt",
    "experience": "5 to 7 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Export, Business Development, Logistics, Supply Chain, Sales",
    "description": "Understanding the target market, he/she will be working in, and identifying the right go-to-market strategy to penetrate this market.\nMaintaining the relationship with the existing accounts in the region and identify potential opportunities and key accounts to expand customer database.\nDeveloping a complete understanding of key account needs and interact with the internal team to translate these needs into actions. \nNegotiating contracts with the client and establishing a timeline of production and delivery.\nCollaborating with the business development team to maximize profit and reduce cost\nPlanning and presenting reports on business progress and performance regularly and on quarterly basis\nFull understanding of the client's current status, needs, objectives, and future requirements.\nCreate an in-depth competitive analysis and issue regular reports of face-off comparison\nAttending all relevant trade-shows and exhibitions in the region\nManaging and overseeing the orders processing in the agreed upon timeframes with the customers.\nAchieving quarterly sales targets as it is developed and set in collaboration with the planning team.",
    "requirements": "Target Market knowledge and awareness is a must\nTo have a proven working experience in the field of packaging material and achieving track records as a business development manager  \nTo be knowledgeable of international trade regulations and different payment methods and terms\nTo have a strong negotiation and communication skills \nProficiency in English language and additional language related to the target region is an asset.\nTo have a strong time management and planning skills \nAbility to work under pressure and tight situations. \nAccountable for results with a sense of urgency to achieve goals.\n Very Good command of MS office\n To have BSc/BA in business administration, sales or relevant field"
  },
  {
    "title": "Senior Sales Manager",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/rsy37Jbnpsu7-Senior-Sales-Manager-Quanvex-Giza-Egypt",
    "experience": "4 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Sales Planning, Digital Transformation, Engineering, Marketing, Negotiation, Business Analytics",
    "description": "Utilizes product and market knowledge to identify prospective customers for selling.\nHave knowledge and analytical thinking to support in building the strategy for penetrating in new market space.\nSource of market information like market price, competition landscape, vendor base etc.\nHave ability to propose different solutions outside of set parameters to address market demand.\nUses internal and external sources for product and market intelligence.\nStay abreast of industry trends and technological advancements to drive innovation\nCultivate and maintain trust and value based long term relationships with existing clients, ensuring satisfaction and repeat business.\nIdentify and define a portfolio of potential customers and engage with them to expand the customer base.\nCollaborate with technical teams to understand client needs and tailor solutions accordingly.\nDevelop and implement effective sales strategies.\nAbility to negotiate contracts and agreements, ensuring favorable terms for the company.\nDeveloping Sales expertise across Middle East, Eastern Europe and North Africa countries.\nWork on policy and ensures delivery across large and/or diverse sales territories.\nInterprets internal and external business challenges and recommends best practices to improve products, processes, or services. Utilizes understanding of industry trends to inform decision making process.\nLeads others to find creative solutions to address complex projects, product lines, markets, sales processes, or customers. Has the ability to evaluate quality of information received and questions conflicting data for analysis. Uses multiple internal and external resources outside of own function to help arrive at a decision.\nMay lead functional teams or projects with moderate resource requirements, risk, and/or complexity. Communicates complex messages and negotiates mainly internally with others to adopt a different point of view. Influences peers to take actions and may negotiate with external partners, vendors, or customers.\nCollaborate execution of marketing strategies to promote products and services across B2B and B2C channels.\nUtilize digital marketing tools (SEO, SEM, social media, email marketing) to reach target audiences.\nOrganize and participate in industry events and conferences to enhance brand visibility.\nTrack and analyze campaign performance, optimizing strategies based on ROI.",
    "requirements": "Bachelor’s degree in Business, Marketing, Engineering or other related field\nMinimum 7+ experience in similar role.\nleadership experience in Sales and Business Growth in computer sciences, IT and Tourism Sector\nStrong track record in submitting/drafting financial and technical offers, whether directly or for tenders.\nEnglish proficiency required\nDeep understanding of the Energy/Utility landscape.\nProven track record of sales success and building out new markets/customer.\nFlexibility to travel up to 50-60% to follow up with customers.\nExtensive track record of sales success in projects & commercial and building out new markets/customer."
  },
  {
    "title": "Sales Head",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/byomvqwC8jji-Sales-Head-Cairo-Egypt",
    "experience": "8 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential, Commissions Upon Meeting The Set Target ,Annual Raise And  Bonus.",
    "skills": "Communication, Leadership, Management, Sales, sales skills, sales head, Offset Printing, Printing, English, Leadership skills, Sales Target",
    "description": "Developing sales strategies and plans with upper management.\nCreating the initials of a strong sales activity through the establishment of long-term business relations with potential customers.\nSetting sales plans and targeting prospective customers that match the organization capabilities and facilities.\nClosing new business deals by coordinating customers’ requirements; developing contracts; integrating contract requirements with business partners.\nPenetrating new markets according to the strategic marketing plan.\nDirecting, coaching & guiding sales staff, providing them with proper sales vision to achieve sales targets.\nSetting training requirements, and marketing tools required according to the market changes quarterly.",
    "requirements": "10 years exp. In printing and packaging including 3 years as Sales Head.\nVery good English level.\nExcellent communication and leadership skills.\nSelf-motivated, target and detail-oriented person.\nPassionate , always fighting and dreaming of better results."
  },
  {
    "title": "Sales Engineer Oil and Gas",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/NrVidvIQc0nE-Sales-Engineer-Oil-and-Gas-Atlantic-international-collaboration-Giza-Egypt",
    "experience": "3 to 5 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "oil and gas, Petroleum, Sales, Sales Engineering, Science, Engineering, gas, Mechanical Engineering, Oil, oil & gas, English, Microsoft Office, Oil Analysis, Sales Target, Outdoor Sales",
    "description": "Job Description: Sales Engineer (3-4 years of experience)\nLocation:\n Egypt\nIndustry:\n Oil & Gas\nDepartment:\n Sales\nReports to:\n Account Manager\nPosition Summary:\nWe are seeking a motivated and technically skilled Sales Engineer with a strong background in mechanical, materials, or petroleum engineering to join our team. The ideal candidate will have 3-4 years of experience in the oil and gas sector in Egypt and be able to assist in developing key accounts and expanding our market presence. This individual will work closely with the Account Manager to penetrate the oil and gas market, arrange client meetings, and conduct seminars for key accounts. The Sales Engineer will also manage the full sales cycle, from lead generation to closing, and maintain strong relationships with clients.\nKey Responsibilities:\nMarket Penetration & Account Development:\nAssist the Account Manager in identifying new opportunities and clients within the oil and gas sector in Egypt.\nSupport the development and implementation of strategies to penetrate the market, targeting key accounts.\nHelp drive business growth through market research, understanding client needs, and providing tailored solutions.\nClient Engagement & Relationship Building:\nInitiate and schedule meetings with key clients to present products, services, and solutions.\nBuild and maintain strong, long-lasting relationships with existing and prospective clients.\nCoordinate and organize seminars, workshops, and product demonstrations for clients, showcasing the company’s offerings.\nSales Cycle Management:\nManage the full sales cycle, from identifying leads to finalizing contracts and closing sales.\nCollaborate with internal teams to ensure timely delivery of solutions to meet client expectations.\nProvide timely updates to the Account Manager regarding sales progress, client feedback, and market trends.\nTechnical Support & Product Expertise:\nServe as a technical advisor for clients, ensuring a deep understanding of the company’s products and services.\nLeverage your engineering background to provide technical solutions that align with client needs.\nStay updated on industry developments, product innovations, and competitor offerings in the oil and gas sector.\nReporting & Documentation:\nMaintain accurate records of sales activities, client interactions, and sales forecasts.\nPrepare and present reports on sales performance and market analysis.",
    "requirements": "Qualifications:\nEducation:\n Bachelor’s degree in Mechanical Engineering, Materials Science, Petroleum Engineering, or a related field.\nExperience:\n3-4 years of sales engineering experience, preferably in the oil and gas sector in Egypt.\nProven track record of sales success and experience in managing key accounts.\nFamiliarity with the full sales cycle, from prospecting to closing deals.\nExperience in arranging meetings, product demonstrations, and seminars for clients is highly desirable.\nSkills & Competencies:\nStrong understanding of oil and gas industry operations, processes, and key technologies.\nExcellent communication and interpersonal skills, with the ability to engage effectively with clients.\nAbility to work independently and as part of a team.\nStrong organizational and time-management skills.\nProficiency in Microsoft Office Suite (Word, Excel, PowerPoint) and CRM systems.\nOther Requirements:\nAbility to travel within Egypt as needed.\nKnowledge of Arabic and English (spoken and written) is essential.\nWhy Join Us?\nThis is an exciting opportunity for a driven and technically proficient Sales Engineer to advance their career in the dynamic oil and gas sector. You will be working in a collaborative environment with experienced professionals and have the chance to make a significant impact in a growing market.\nIf you are passionate about sales, have a strong technical background, and are eager to contribute to the success of a leading company in the oil and gas industry, we encourage you to apply!"
  },
  {
    "title": "Electrical Panels and Automation Business Unit Director",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/tyQdMXRnC5Pp-Electrical-Panels-and-Automation-Business-Unit-Director-3Brothers-Cairo-Egypt",
    "experience": "5 to 7 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "MBA, Electrical Engineering, Leadership Management, Decision Making, Strategic Planning, Automation Engineering, Automation, Panels, Electrical Panels, Installements, KNX, BMS, Design, Technical Office Engineering, Tendering, Pricing, Budgeting",
    "description": "*Strategic Planning and Budgeting\n-Develop a comprehensive strategic plan for the Boards and Automation unit, including sales targets and plans to penetrate the markets and expand sales in cooperation with the Director of the Commercial Sector and in line with the vision and objectives of the company.\n-Setting the short and long-term objectives of the unit and following up on their implementation.\n-Prepare the unit's annual budget in coordination with the various departments and ensure compliance with it.\n-Monitor the financial performance of the unit and submit periodic reports to senior management on the status of the budget and expenses.\n-Effective coordination between different departments and sectors to ensure the completion of work within the unit in an orderly and effective manner\n-Develop product pricing plans as a joint responsibility between him and the financial department and in coordination with the commercial sector manager to benefit from the expertise of the marketing department\n-Develop an inventory management plan and get rid of stagnant and provide sales expectations to the director of the supply chain sector to work on developing a procurement plan as a joint responsibility with the manager of the commercial sector\n*Technical Office & Pricing\n-Preparing technical presentations for electrical panel and automation products, including performance data and technical characteristics.\n-Respond to customer inquiries and sales specialist about the technical aspects of electrical panels and automation.\n-Coordination with various departments to provide the necessary technical information.                                 -Provide technical support to the sales team to enhance their ability to market the products of paintings and automations.\n-Preparing visit plans for consultants to display the products of paintings and automation and their updates.\n-Review periodic reports on technical description, design and other activities and develop plans to improve their performance\n*Design\n-Participate in the preparation of electrical panel product design plans.\n-Review designs and ensure their compatibility with market and customer requirements.\n-Prepare implementation plans and timetables and follow them up periodically.\n-Collaborate with production teams to ensure design execution accurately and efficiently.\n-Follow up the approval of the first samples before delivering them for production.\n-Electrical and mechanical design\n-Study the projects to be implemented, determine the nature of the project, make a product tree and determine the costs of the products.\n-Coordinate the loading of departments with products and follow up the operational processes in terms of technical characteristics and process progress according to the timings.\n-Designing products for each project according to the client's requests, making modifications to products and preparing technical files.                                                                                                                                         --Supervise the work of production machinery programs for products such as cutting programs, CNC programs, and others.\n-Supervise the work of engineering drawings such as sweeping, welding, assembly, and copper drawings for all products.\n-Follow up the operational processes in other production departments and ensure that they match the customer's request and technical files.\n-Preparation of raw materials exchange cards from electrical and mechanical stores (BOM), in addition to preparing designs and technical files.\n-Development and innovation in existing product designs and preparation of designs for new products.\n-Coordination with procurement departments to purchase components or raw materials for all products, and choose alternative materials if needed.\n-Preparation and supervision of the preparation of electrical and mechanical designs for all products and customer requests.\n-Preparing and supervising the work of engineering technical files for all products and projects.\n-Preparing and supervising the work of shop drawings for all projects.\n-Preparation of files for calculations of electrical loads, sequence and synchronization (selectivity and S.C Level).                                                                                                                                                                      -Preparation and supervision of programming (Programming) and graphics of various control circuits and KNX-BMS-PLC systems and their electrical designs.\n-Review and approve the technical specifications of raw materials and their conformity with customer requirements.\n-Calculate product costs and operating times in different production stages.\n-Participate in the preparation of electrical panel product design plans.\n-Review designs and ensure their compatibility with market and customer requirements.\n-Prepare implementation plans and timetables and follow them up periodically.\n-Collaborate with production teams to ensure design execution accurately and efficiently.                               -Follow up the approval of the first samples before delivering them for production.\n-Design and programming of industrial automation systems according to customer and project requirements.\n-Preparation and implementation of electrical designs for various control systems, including KNX, BMS, PLC, and Scada Systems.                                                                                                                                                   -Develop smart automation solutions to improve operational and production efficiency\n-Testing and integration of control systems to ensure optimal operation in accordance with technical standards and specifications.\n-Preparing programming and control files for smart systems and supervising their installation and integration with other systems.\n-Follow up on technological developments in the field of automation and propose the necessary improvements to the systems used.\n-Collaborate with engineering and production teams to ensure that automation systems integrate seamlessly with electrical panels.\n \n *Installments:\n-Supervising the implementation of all installation operations at the sites\n-Review the technical files and executive drawings for all works and projects and coordinate with the competent departments in the event of amendments or observations\n-Coordination and follow-up with consultants and competent authorities at the sites for technical accreditation\n-Determine the requests for raw materials, equipment and tools necessary for implementation according to the stages of each project and according to the implementation schedules\n-Setting schedules for completing the work and implementing the necessary installations on the specified dates\n-Determine the number of workers and technicians required for implementation and to coordinate with the various departments to provide them at the specified times\n-Distributing work to technicians at the sites and coordinating between them to achieve the highest rates of implementation\n-Supervision and follow-up of supplies and the arrival of raw materials and equipment to the sites, receipt, storage and securing them properly in accordance with the company's instructions\n-Managing all administrative work in the sites (housing - transportation - nutrition - allowances - vacations - working hours)                                                                                                                                                            -Ensure the quality of work and implement it in accordance with the specifications and requirements and review the work before tests and delivery to customers\n- Supervising the implementation of customer requests, avoiding observations and solving problems on sites\n-Coordination with all competent departments to complete the required work on time\n-Preparing follow-up reports for the executive position of each project and timetables for all stages",
    "requirements": "Bachelor's degree in engineering (Electrical is preferred).\nMBA is a must.\nExperience not less than 5 years.\nExperience in panels technical office & tendering.\nLeadership.\nProject planning.\nManagement skills.\nDecision maker.\nStrategic thinking."
  },
  {
    "title": "Technical Project Manager",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/OSPXa82VIAjH-Technical-Project-Manager-Khales-Giza-Egypt",
    "experience": "4 to 6 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Communication skills, Computer Science, Engineering, PMP, Project, Project Management, Planning, English",
    "description": "Job Purpose:\nManage cross functional technical projects across the company\nManage and maintain a healthy corporate relationship within Khales & the Holding on strategic planning, budget and projects reporting levels.\nDeliver company technical projects and services agenda either personally or through subordinate Teams.\nJob Responsibilities & Accountabilities:\n• Carry out and implement the five-project management phases; Initiation, Planning, Execution, Controlling, and Closing.\n• Adopt project management methodology/techniques to manage the nine knowledge areas of project management.\n• Maintaining and monitoring project plans, project schedules, budgets, and expenditures.\n• Facilitate the definition of project scope, goals, and deliverables.\n• Oversee the integration of various systems and applications, ensuring seamless interoperability and alignment with business objectives.\n• Lead and manage projects using DEVOPS methodologies to improve collaboration between development and operations teams, ensuring timely delivery of high-quality software.\n• Manage necessary certifications, including PCI compliance and penetration testing, ensuring adherence to industry standards and regulations.\n• Utilize Jira for project tracking, issue management, and sprint planning. Create and maintain project documentation to ensure transparency and stakeholder engagement.\n• Collaborate with stakeholders at all levels, ensuring their needs are understood and met throughout the project lifecycle.\n• Develop detailed project plans using Microsoft Project, including timelines, milestones, and resource allocation.\n• Lead cross-functional teams, foster a collaborative environment and ensure team members are aligned with project goals.\n• Identify potential project risks and develop mitigation strategies to minimize impact on project timelines and deliverables.\n• Define project tasks and resources requirements.\n• Ensure proper reporting on all levels / aspects related to department scope\n• Organizing, attending, and participating in stakeholder meetings.\n• Facilitate meetings where appropriate and distribute minutes to all project team members.\n• Documenting and following up on important actions and decisions from meetings.\n• Preparing necessary presentation materials for meetings or weekly Project status\n• Ensuring project deadlines are met.\n• Determining project changes (CRs)\n• Ensuring projects adhere to frameworks and all documentation is maintained appropriately for each project.\n• Ensure stakeholder views are managed towards the best solution.\n• Escalate whenever needed to move the project forward,Escalate whenever needed to move the project forward.",
    "requirements": "Qualifications:\nEducation:\nBachelor’s degree in computer science, Information Technology, Engineering, or a related field.\nPMP Knowledge is preferred \nScrum.\nExperience:\n6-8 years of experience in a related field.\nProven experience as a Technical Project Manager, preferably within the fintech, telecom, banking, or software development sectors.\nDigital Products & Lifecycle management experience is required\nKnowledge & Abilities:\nProficiency in project management tools (e.g., Jira, Microsoft Project).\nExcellent communication and interpersonal skills\nStrong organizational and multitasking abilities.\nKnowledge of digital technology, emerging media and the Internet\nExcellent project management skills Experience with fintech tools, procedures, and regulation\nKnowledge of credit cards, Wallets or another financial services a plus\nExperience in one or more of the following areas: online/mobile banking, new product/service onboarding, payments, online security and authentication\nStrong problem-solving, planning/organizational and presentation skills\nAbility to develop relationships with internal and external stakeholders and work with all levels\nResults-oriented with strong verbal and written communication skills."
  },
  {
    "title": "Cyber Security Engineer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/KTrruaDpPSuD-Cyber-Security-Engineer-Sandah-for-micro-finance-Giza-Egypt",
    "experience": "1 to 3 years",
    "education": "Bachelor's Degree",
    "salary": "20000 to 25000 EGP Per Month",
    "skills": "Computer Science, Cyber Security, Engineering, firewalls, Network, Network Security, Security, Security Systems, Software, Information Technology (IT), Networking",
    "description": "Implement cybersecurity solutions that address specific business needs. Leverage his/her expertise to integrate security measures seamlessly into existing systems.\nImplement and manage network security measures, including firewalls, intrusion detection/prevention systems, and virtual private networks (VPNs), to safeguard our environments.\nConfigure access control lists (ACLs), port forwarding, and firewall rules for secure internal and external access.\nConfigure firewalls with advanced features like application control, web filtering, and IPS.\nCreate security reports on incidents, risks, and mitigation strategies.\nRegularly update firewall policies to meet evolving security needs.\nMonitor and respond to security threats, including malware, intrusions, and DoS/DDoS attacks.\nManage WAF to protect against web-based threats and configure security rules.\nImplement Zero Trust policies to control access based on identity and device posture.\nOversee endpoint security, including antivirus, malware protection, and patching.\nAutomate software distribution, vulnerability scanning, and patch management.\nEnsure devices are up-to-date with security patches and protection.\nLead incident response efforts, investigate security incidents, and implement corrective actions to address vulnerabilities and mitigate risks.\nConduct comprehensive security assessments, vulnerability scans, and penetration tests. Provide detailed reports and recommendations for enhancing security postures.\nDevelop and enforce security policies and procedures to ensure compliance with regulatory requirements and industry standards.\nConduct cybersecurity training sessions for internal teams to enhance overall security awareness.",
    "requirements": "Proven work experience as a System Security Engineer or Cyber Security Engineer\nExperience in building and maintaining security systems\nDetailed technical knowledge of database and operating system security\nHands-on experience in security systems, including firewalls, intrusion detection systems, anti-virus software, authentication systems, log management, content filtering, etc\nExperience with network security and networking technologies and with system, security, and network monitoring tools\nThorough understanding of the latest security principles, techniques, and protocols\nFamiliarity with web-related technologies (Web applications, Web Services, Service service-oriented architecture) and of network/web-related protocols\nProblem-solving skills and ability to work under pressure\nBS degree in Computer Science or related field"
  },
  {
    "title": "Commercial Executive",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/5Jhz6ClkPm0d-Commercial-Executive-DACK-Trading-LLC-Cairo-Egypt",
    "experience": "2 to 6 years",
    "education": "Bachelor's Degree",
    "salary": "800 to 1500 USD Per Month, Commission on Sales and Commission on Sourcing of Commodities",
    "skills": "sales skills, Sales, International Sales, Trading, commodity trading, agri commodity sales, foreign sales, Export Sales, Supply Chain, Foreign Trade, Import / Export, import, Communication, Communication skills",
    "description": "DACK Trading \nis an internationally recognized trade brokerage firm. We are seeking an experienced Commercial Executive to spread our commodity sales business in Egypt. We facilitate the trading of a diverse range of commodities, handling over 45,000 tons per month of spices, pulses, nuts, grains, sugar, and other products. Our vast network stretches across nearly 60 countries, creating a unique blend of global perspectives and local expertise.\nDevelop and execute international supply chain and sales strategies to boost revenue and market penetration.\nIdentify and explore new business opportunities, including emerging markets and partnerships.\nCultivate and maintain strong relationships with buyers and stakeholders.\nAddress buyer inquiries promptly and efficiently.\nEnsure timely delivery of products as per buyer specifications.\nGenerate new leads through cold calling, networking, and social media.\nMeet and exceed sales targets within established timelines.",
    "requirements": "Key Requirements:\nAt least 2-6 years of international sales experience.\nGood to have in-depth knowledge of grains, nuts, spices, seeds, pulses, sugar, and related commodities (required)\nProven sales and negotiation skills.\nExcellent English communication skills, both written and oral.\nAbility to build and sustain strong buyer relationships."
  },
  {
    "title": "General Maintenance",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/Qv6kj69fHdiy-General-Maintenance-National-Glass-Sharqia-Egypt",
    "experience": "7 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Maintenance, Engineering, Utilities, Mechanical Engineering",
    "description": "Analyze complex utility maintenance issues, evaluate alternative solutions, and recommend a strategic and tactical course of action in conjunction with facility engineering, maintenance/repair and subject matter experts , Maintenance of Design & Construction Standards , Responsible for the day-to-day Utilities Operations (Utilities Maintenance, Automation & Control) to ensure smooth manufacturing operation , Manage emergency, corrective, penetration permit/access program, and preventative/predictive maintenance of utility systems, leak detection/remediation, and supporting systems/equipment , Coordinate and direct the project planning phase in the development of projects, making detailed plans to accomplish goals and direction for the integration of technical activities",
    "requirements": "Proven experience as a General Manager or similar executive role in Heavy industry fields ( Glass , Ceramic , cement , Iron)\nStrong analytical ability\nExcellent communication skills\nOutstanding organizational and leadership skills\nProblem-solving aptitude\nBSc/BA in Business or relevant field; MSc/MA is a plus"
  },
  {
    "title": "Cyber Security Specialist",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/cXOZeatsEszs-Cyber-Security-Specialist-DOT-Information-Technology-Cairo-Egypt",
    "experience": "More than 3 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Computer Science, Network Security",
    "description": "Job Summary:\nWe are seeking a highly skilled \nCyber Security Specialist\n to protect our organization's servers, software, and IT infrastructure from cyber threats. The ideal candidate will be responsible for implementing security measures, monitoring for vulnerabilities, responding to security incidents, and ensuring compliance with industry best practices and regulations.\nKey Responsibilities:\nDesign, implement, and maintain security protocols to safeguard company servers, applications, and cloud infrastructure.\nConduct regular security audits, risk assessments, and penetration testing.\nMonitor systems for vulnerabilities, threats, and security breaches, responding promptly to incidents.\nDevelop and enforce security policies, procedures, and best practices across the organization.\nManage firewalls, intrusion detection systems (IDS), and endpoint protection tools.\nEnsure secure authentication and authorization mechanisms are in place.\nOversee data protection strategies, including encryption, backup policies, and disaster recovery plans.\nStay up-to-date with emerging cybersecurity threats and technologies, recommending improvements as needed.\nProvide training and awareness programs to employees on cybersecurity best practices.\nCollaborate with developers and IT teams to integrate security into software development and IT operations (DevSecOps).",
    "requirements": "Required Qualifications & Skills:\nBachelor's degree in \nCybersecurity, Information Technology, Computer Science, or a related field\n (or equivalent experience).\nMinimum \n3-5 years of experience\n in cybersecurity roles, with hands-on experience securing servers and software applications.\nStrong knowledge of \nnetwork security, cloud security (AWS, Azure, or GCP), and endpoint protection\n.\nExperience with \nfirewalls, intrusion detection/prevention systems (IDS/IPS), SIEM solutions, and vulnerability scanning tools\n.\nFamiliarity with secure coding practices and DevSecOps principles.\nUnderstanding of \nISO 27001, NIST, GDPR, SOC 2\n, and other relevant security frameworks.\nAbility to investigate security incidents, analyze logs, and respond to breaches effectively.\nProficiency in scripting and automation tools (e.g., Python, PowerShell, Bash) is a plus.\nCybersecurity certifications such as \nCISSP, CEH, OSCP, or CISM\n are preferred.\nStrong problem-solving skills, analytical mindset, and ability to work independently.\nPreferred Experience:\nExperience securing \nSaaS or web applications\n.\nHands-on experience with \ncloud security best practices\n and compliance standards.\nFamiliarity with \nzero-trust architecture and identity & access management (IAM) solutions\n."
  },
  {
    "title": "Product Specialist",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/D6yGtVuisBPB-Product-Specialist-Ghalioungui-Cairo-Egypt",
    "experience": "1 to 3 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Biomedical, Biomedical Engineering, Medical, English, Medical Devices, sales skills, Sales",
    "description": "Role Summary:\nAs a Product Specialist at Ghalioungui Trading, you will play a pivotal role in promoting our range of medical devices. Your primary responsibility will be to ensure customer satisfaction and achieve sales targets by leveraging your expert knowledge of our products and effective communication skills.\n Key Responsibilities:\n-Promote and demonstrate the features and benefits of our medical devices to healthcare professionals and institutions.\n-Develop and maintain strong relationships with key stakeholders to drive sales growth and market penetration.\n-Collaborate with the sales team to develop and execute effective sales strategies.\n-Provide product training and support to customers to enhance their understanding and usage of our products.",
    "requirements": "Job Requirements:\n1-Bachelor's Degree in Science, Pharmacy, vet, and biomedical engineering.\n2- From 1-3 years of experience in a related field within the medical devices industry.\n3-Strong understanding of medical device technologies and market trends.\n4-Excellent command of English, both written and verbal.\n5-Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint)."
  },
  {
    "title": "Structural Design Engineer",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/5QcOJvyY4ucf-Structural-Design-Engineer-Asass-Engineering-Alexandria-Egypt",
    "experience": "3 to 8 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "ASD, Revit, Shop Drawings, AutoCAD, Navisworks, Communication, Communication skills, Computer Science, Drawings, Design, Engineering, Information Technology (IT), quality, Skills, structural",
    "description": "Cross-checking IFC drawings (STR-STR), (STR-ARCH), (STR-MEP) to identify clashes& contradictions.\nPrepare (design/shop drawings) related RFIs accordingly to either propose solutions to contradictions or retrieve resolutions from lead designer.\nValidate structural IFCs from a constructability point of view, do necessary detailing studies for combined & complicated cases to determine optimum approach that minimize construction time.\nDraft and finalize Structural shop drawings (concrete dimensions then reinforcement along with BBS) according to received IFCs & RFIs responses.\nEnsure that shop drawings are reflecting design intent, adhering to project specs, & detailed to the level that minimize construction time whilst keeping economical quantities.\nCoordinate produced concrete dimensions shop drawings with other disciplines (Civil, Arch, MEP…etc.) to identify all intersections, clashes, & penetrations.\nDetermine and flag all embedded items (anchors, steel connections, hooks...etc.) within concrete skeleton before execution on-site & make sure they are sufficiently detailed within structural shop drawings.\nDevelop & build a comprehensive REVIT model for the concrete/steel skeleton (if needed) to facilitate structural shop drawings production and coordination process.",
    "requirements": "3 to 8 years of experience in structural shop drawings preparation\nAlexandria residence.\nPrevious experience in design field is a plus.\nPrevious Revit experience is a Must.\nWork effectively with others as team player.\nAdvanced and flexible people skills.\nExcellent communication skills.\nMultitasking whilst delivering high-quality results.\nInterdepartmental coordination skills."
  }
]