[
  {
    "title": "Senior Devops Engineer",
    "posted_date": "Posted3 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/sdbKjuEqhbC7-Senior-Devops-Engineer-Royal-Cyber-Riyadh-Saudi-Arabia",
    "experience": "8 to 18 years",
    "education": "Not Specified",
    "salary": "18000 to 23000 SAR Per Month",
    "skills": "CI/CD, Kubernetes, Jenkins, Docker, DevOps, Ansible, Kubernete, CICD, Github, Shell Scripting",
    "description": "Senior DevOps  Engineer\nJob Responsibilities\n1. CI/CD Pipelines: Design and implement CI/CD pipelines using Jenkins, GitHub Actions, etc.\n2. Containerization: Manage and maintain containerization using Docker and Kubernetes.\n3. Cloud Management: Manage and optimize cloud infrastructure on AWS, Azure, etc.\n4. Automation: Develop and maintain automation scripts using Ansible and Shell Scripting.\n5. Troubleshooting: Troubleshoot and resolve issues related to infrastructure, deployment, and application performance.\n6. Collaboration: Collaborate with development teams to ensure smooth deployment and operation of applications.\n7. Monitoring: Implement and manage monitoring tools to ensure system performance and reliability.\n8. Security: Ensure security best practices are followed in DevOps processes.\n9. Documentation: Maintain documentation for DevOps processes and infrastructure.\n10. Continuous Improvement: Continuously improve DevOps processes and infrastructure to ensure efficiency and scalability.",
    "requirements": "Job Requirements\n1. Technical Skills: Proficiency in DevOps tools like Docker, Kubernetes, Jenkins, Ansible, and cloud platforms.\n2. Experience: 8+ years of experience in DevOps engineering.\n3. Scripting: Knowledge of scripting languages like Shell Scripting.\n4. Collaboration: Strong communication and collaboration skills.\n5. Problem-Solving: Ability to troubleshoot and resolve complex issues.\n6. Cloud Expertise: Experience with cloud platforms like AWS, Azure, etc.\n7. Containerization: Knowledge of containerization using Docker and Kubernetes.\n8. CI/CD: Experience with CI/CD pipelines using Jenkins, GitHub Actions, etc.\n9. Monitoring: Familiarity with monitoring tools like Nagios, Prometheus, etc.\n10. Agile Methodologies: Experience with agile development methodologies."
  },
  {
    "title": "Devops Instructor",
    "posted_date": "Posted2 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/tTEGW3VR27Nr-Devops-Instructor-Route-ِAcademy-Alexandria-Egypt",
    "experience": "1 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "DevOps Tools & Practices, Communication & Presentation Skills",
    "description": "Develop, update, and deliver engaging training content related to DevOps tools and practices.\nGuide students through the implementation of DevOps practices in real-world environments.\nMonitor student progress, offer feedback, and provide support.\nContinuously improve course content to keep up with the latest industry trends and technologies.",
    "requirements": "Strong knowledge of DevOps tools.\nPrevious teaching or mentoring experience is a must.\nStrong communication and presentation skills.\nAbility to explain complex technical concepts in a clear and engaging manner.\nPassion for teaching and helping others succeed in tech.\nGood in English."
  },
  {
    "title": "DevOps Engineer",
    "posted_date": "Posted2 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/UNg85iiyRqwN-DevOps-Engineer-Exceed-Cairo-Egypt",
    "experience": "1 to 3 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "CI/CD, Cloud, Computer Science, DevOps, Docker, Information Technology (IT), Jenkins, Kubernetes, Linux, Software Development, Software, CI",
    "description": "We are seeking a motivated and detail-oriented Junior DevOps Engineer to join our growing technology team. In this role, you will support the automation, scalability, and reliability of our development and deployment processes, helping to build a strong foundation for rapid and secure software delivery.\nResponsibilities:\nCollaborate with developers: Work closely with the development team to design and maintain efficient, reliable CI/CD pipelines that support rapid and high-quality software releases.\nAutomate deployments: Assist in building and refining automated deployment workflows to improve efficiency and reduce manual intervention.\nMonitor and support systems: Continuously monitor application and infrastructure performance, helping to identify and resolve issues quickly to maintain system uptime and reliability.\nManage cloud infrastructure: Support the configuration and management of cloud resources using Infrastructure-as-Code (IaC) tools and best practices.\nEnhance security and compliance: Contribute to the implementation of security best practices and compliance standards across environments.\nBuild automation tools: Develop and maintain scripts and tooling to automate operational tasks using technologies like Docker, Kubernetes ,and Bash.",
    "requirements": "Requirements:\nFoundational understanding of DevOps practices and the software development lifecycle.\nFamiliarity with CI/CD tools (e.g., GitHub Actions, and Jenkins).\nBasic knowledge of cloud platforms.\nExperience or interest in containerization and orchestration tools (e.g., Docker, Kubernetes).\nComfortable using Linux-based systems and command-line tools.\nStrong problem-solving skills, a proactive mindset, and a willingness to learn and grow."
  },
  {
    "title": "Devops Engineer",
    "posted_date": "Posted15 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/T6jJTOp6SbEA-Devops-Engineer-Egpay-Cairo-Egypt",
    "experience": "1 to 3 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "DevOps, CI/CD, Engineering, Software Engineering, Docker, Information Technology (IT), Computer Science, Cloud, Linux, Software",
    "description": "Implement integrations requested by customers.\nDeploy updates and fixes efficiently and securely.\nProvide \nLevel 2 technical support\n for troubleshooting and issue resolution.\nBuild tools to \nreduce errors and enhance customer experience\n.\nDevelop software to integrate with \ninternal back-end systems\n.\nPerform \nroot cause analysis\n for production errors and outages.\nInvestigate and resolve technical issues promptly.\nDevelop \nautomation scripts\n for infrastructure and system visualization.\nDesign and implement \nsystem troubleshooting and maintenance procedures\n.\nManage \nLinux servers\n and optimize system performance.\nDeploy and maintain \nvirtual machines (VMs) and cloud-based environments\n.\nEnsure \nserver security, updates, and backups\n are properly maintained.\nMonitor and enhance \nserver infrastructure performance\n.",
    "requirements": "BSc in Computer Science, Engineering or relevant field\nWork experience as a DevOps Engineer or similar software engineering role\nGood knowledge of Ruby or Python\nWorking knowledge of databases and SQL\nExperience in \nLinux administration\n and shell scripting.\nProficiency in \nserver management, maintenance, and monitoring\n.\nKnowledge of \nvirtualization technologies (VMware, KVM, or similar)\n.\nStrong understanding of \nCI/CD pipelines, cloud platforms, and automation tools\n.\nExperience with \ncontainerization (Docker, Kubernetes, etc.)\n.\nFamiliarity with \nmonitoring tools (Prometheus, Grafana, Nagios, etc.)\n."
  },
  {
    "title": "DevOps Engineer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/TA27K1lVEY0t-DevOps-Engineer-Bydotpy-Cairo-Egypt",
    "experience": "2 to 3 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "AWS, CI/CD, DevOps, Docker, Jenkins, Kubernetes, Azure",
    "description": "We are looking for a talented DevOps Engineer to join our team at Bydotpy and help optimize and automate our cloud infrastructure. You will work closely with developers, engineers, and product managers to ensure our cloud infrastructure is scalable, reliable, and secure. The ideal candidate will have a strong understanding of AWS services, CI/CD pipelines, and modern DevOps practices.\nRole Overview:\nYou’ll manage AWS services, CI/CD pipelines, security, and performance to ensure scalability, reliability, and efficiency. This is a hybrid role with flexibility based on company requirements.\nKey Responsibilities:\n* Cloud Management: Maintain and optimize AWS services such as EC2, RDS, ElasticCache, Auto Scaling, Load Balancers, Amplify.\n* CI/CD & Automation: Implement pipelines using Jenkins, GitHub Actions, AWS CodePipeline.\n* Security & Compliance: Manage IAM roles, VPCs, encryption, security audits.\n* Performance Optimization: Optimize MySQL (indexing, replication), Redis caching, load balancing.\n* Monitoring & Logging: Set up CloudWatch, ELK Stack, Prometheus, Grafana.\n* Infrastructure as Code: Deploy and manage infrastructure using Terraform / CloudFormation.\n* Containerization: Work with Docker, Kubernetes (optional), Helm.\nRequirements:\n* 2+ years of experience in DevOps & AWS (EC2, RDS, Auto Scaling, IAM, VPC).\n* Bachelor's degree in computer science or a related field.\n* Experience with CI/CD tools, Terraform, Docker, MySQL optimization, and security best practices.\n* Knowledge of monitoring tools, caching (Redis), API security, and automation scripting (Bash/Python).\n* Familiarity with Socket.io, Firebase Notifications, JWT authentication is a plus.\n* AWS certification or experience in FinTech/Blockchain is a bonus.\nWhy Join Us?\n* Work on a scalable, secure FinTech platform.\n* Career growth in a fast-paced tech environment.\n* Hybrid work model with flexibility.",
    "requirements": "Requirements:\n \n• Bachelor’s degree in Computer Science, Engineering, or a related field.\n• Proven experience as a DevOps Engineer or in a similar role.\n• Strong knowledge of cloud platforms (AWS, Azure, or Google Cloud).\n• Proficiency in CI/CD tools (Jenkins, GitLab CI, etc.).\n• Experience with containerization (Docker, Kubernetes).\n• Solid understanding of infrastructure as code (Terraform, Ansible).\n• Familiarity with monitoring and logging tools (Prometheus, Grafana, ELK stack).\n• Strong scripting skills (Python, Bash, etc.).\n• Excellent problem-solving skills and attention to detail.\n• Good communication skills and ability to work in a team."
  },
  {
    "title": "Senior Devops Engineer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/wnYNxfGPzi5I-Senior-Devops-Engineer-Bevatel-Giza-Egypt",
    "experience": "4 to 6 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Kubernetes, Terraform, Google Cloud, GCP, Cloud, Computer Science, DevOps, Information Technology (IT), CI/CD, Bash, Automation, Programming, Software Development",
    "description": "We are seeking an experienced DevOps Engineer with deep knowledge and hands-on experience across core DevOps tools and practices. The ideal candidate should be highly proficient in \nGoogle Cloud\n, \nTerraform\n, \nKubernetes\n, HashiCorp Vault, Helm, and CI/CD workflows. You will be responsible for managing cloud infrastructure, automating deployments, optimizing CI/CD pipelines, and enhancing overall infrastructure security and scalability.\n \nResponsibilities:\nDesign, implement, and maintain Google Cloud infrastructure using Terraform to automate deployments and manage configurations.\nDeploy, manage, and troubleshoot Kubernetes clusters, ensuring high availability, scalability, and performance.\nConfigure and maintain HashiCorp Vault for secure secret management across distributed environments.\nUse Helm for packaging and managing Kubernetes applications, streamlining deployment processes.\nDevelop and optimize CI/CD pipelines to support the continuous integration and delivery of applications.\nWrite and maintain scripts in Golang, Python, and Bash for automation tasks, tooling, and infrastructure management.\nMonitor and manage databases, ensuring optimized performance, backups, and availability in production.\nWork closely with development and security teams to implement best practices and ensure secure, efficient, and scalable infrastructure.\nTroubleshoot and resolve infrastructure and deployment issues to ensure smooth and reliable operations.",
    "requirements": "4+ years of experience in DevOps, with a strong background in cloud infrastructure management and automation.\n80%+ proficiency in the following tools and technologies:\nGoogle Cloud Platform (GCP)\nTerraform for Infrastructure as Code (IaC)\nKubernetes for container orchestration\nHashiCorp Vault for secrets management\nHelm for Kubernetes package management\nCI/CD tools and pipelines (e.g., Jenkins, GitLab CI, or similar)\nProgramming and scripting languages: Golang, Python, Bash\nDatabase management and monitoring\nSolid understanding of networking, security practices, and infrastructure-as-code principles.\nStrong troubleshooting and problem-solving skills with a proactive approach to maintaining system health and efficiency.\nExcellent communication skills and the ability to work collaboratively in cross-functional teams.\nPreferred Qualifications\nCertification in Google Cloud or related cloud platforms.\nExperience with additional DevOps tools and best practices, including monitoring and logging (e.g., Prometheus, Grafana).\nWhat We Offer:\nCompetitive salary and comprehensive benefits.\nOpportunities for professional growth in a forward-thinking company.\nA vibrant, collaborative environment that values innovation and creativity."
  },
  {
    "title": "Devops Engineer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/nplvKuToqk5Y-Devops-Engineer-MOBILY-INFOTECH-LTD-INDIA-Cairo-Egypt",
    "experience": "3 to 6 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "DevOps, Devops Engineer",
    "description": "Experience in Bitbucket, Bamboo/Jenkins, Sonarqube and Nexus\nExperience in Jenkins, Docker, Kubernates and OCP\nExperience in scripting languages like Shell and Python\nBuild Tools (Maven, Ant)\nExperience on WebSphere, Oracle Databases, UNIX and Shell Scripting.\nKnowledge in Telecom domain"
  },
  {
    "title": "Senior Devops Engineer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/ztuXO5YntVZ9-Senior-Devops-Engineer-Seoudi-Supermarket-Giza-Egypt",
    "experience": "5 to 7 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Engineering, Information Technology (IT), Linux, Python, Software, Software Development, Git, Docker, Design, Computer Science, Azure, AWS",
    "description": "The Sr. dev ops engineer role is to ensure the stability, integrity, and efficient operation of the in-house information systems that support core organizational functions. This is achieved by monitoring, maintaining, supporting, and optimizing all software and associated operating systems. The Sr. dev ops engineer will apply proven communication, analytical, and problem-solving skills to help identify, communicate, and resolve issues to maximize the benefit of IT systems investments. This individual will also mentor and provide guidance to the Systems Engineer staff.\nResponsibilities\nDevelop and maintain the company's DevOps strategy, ensuring alignment with business goals and objectives.\nCollaborate with development teams to automate and optimize our release and deployment process.\nDesign, implement, and manage CI/CD pipelines for a range of projects.\nAutomate and streamline deployment processes, minimizing manual intervention and improving system efficiency.\nDesign and implement monitoring, logging, and alerting systems to proactively identify and resolve issues before they impact the business.\nCollaborate with software developers, quality assurance engineers and IT professionals to guarantee smooth deployment, automation and management of software infrastructure.\nCreate and maintain monitoring systems to guarantee high availability and performance for software applications.\nManage and enhance cloud infrastructure such as AWS, Azure, and GCP\nAutomating software deployment, configuration, and upkeep processes\nManage and optimize infrastructure, including provisioning and configuring virtual machines, containers, and storage solutions.\nImplement security best practices, including access controls, encryption, and vulnerability scanning, to protect company data and systems.\nTroubleshoot and resolve infrastructure and application issues, ensuring minimal downtime and disruption to business operations. Troubleshoot software infrastructure issues and collaborate with the team to resolve them.\nStay up-to-date with industry trends and emerging technologies, assessing their potential impact and recommending adoption where appropriate.\nMentor and guide junior DevOps engineers, fostering a culture of knowledge sharing and continuous learning.",
    "requirements": "The Sr. dev ops engineer will have a bachelor’s degree and 5 to 7 years of Sr. dev ops engineer experience. \nExpert in Linux and Linux distribution administration.\nDeep understanding of containerization technologies, such as Docker, Kubernetes sand/or OpenShift.\nFamiliarity with version control systems, such as Git, and CI/CD tools like Gitlab CI and Teamcity\nStrong experience with scripting languages such as Python, Bash\nExperience with infrastructure as code (e.g., Terraform, Helm).\nSolid understanding of networking concepts, including TCP/IP, DNS, load balancers, and firewalls.\nHands-on experience with Microsoft Azure, AWS and Microsoft 365\nProven experience in overseeing the design, development, and implementation of software systems, applications, and related products. \nProven experience with systems planning, security principles, and general software management best practices. \nExcellent understanding of the organization’s goals and objectives\nTroubleshooting and analytical skills\nStrong communication and collaboration skills"
  },
  {
    "title": "Software Development Manager - Remote (Full Time / Part Time)",
    "posted_date": "Posted1 dayago",
    "job_url": "https://wuzzuf.net/jobs/p/rSK0THSeCrFd-Software-Development-Manager---Remote-Full-Time-Part-Time-Guestna-Riyadh-Saudi-Arabia",
    "experience": "7 to 12 years",
    "education": "Not Specified",
    "salary": "Confidential, Salary in USD",
    "skills": "Computer Science, Software Development, DevOps, Development, APIs, Agile, Information Technology (IT), Software Engineering, Software, React, Docker, Engineering",
    "description": "We are looking for an experienced and highly motivated Development Manager to lead our growing development team at Guestna. As the Development Manager, you will oversee the planning, execution, and delivery of cutting-edge software solutions while managing a talented team of developers, testers, and engineers. Your role is critical in ensuring the successful implementation of projects, aligning with business goals, and maintaining high-quality standards across all development activities.\n \nRoles & Responsibilities\nLeadership and Team Management\nLead, mentor, and inspire a cross-functional team of Front-End Developers , Full-Stack Developers , Mobile Developers , DevOps and QA Engineers .\nFoster a collaborative and innovative work atmosphere that promotes continuous learning, growth, and high performance.\nConduct regular one-on-one meetings and performance reviews to support team members achieving their tasks.\nProject Planning and Execution\nDefine project roadmaps, timelines, and milestones to ensure timely delivery of software solutions.\nCollaborate with stakeholders, including product owners and designers, to translate business requirements into technical specifications.\nOversee the entire software development lifecycle (SDLC), from ideation to deployment, ensuring adherence to best practices and quality standards.\nTechnical Oversight\nProvide technical guidance and architectural direction for projects involving Next.js , React Native , MERN Stack , and NestJS .\nEnsure code quality, scalability, and maintainability across all applications through code reviews and testing protocols.\nStay up-to-date with emerging technologies and industry trends to drive innovation within the team.\nDevOps and Cloud Infrastructure\nDesign and implement DevOps practices to streamline development workflows, including CI/CD pipelines and automated testing.\nOversee the management of cloud infrastructure on platforms like GCP, ensuring scalability, security, and cost optimization.\nCollaborate with the team to monitor system performance, troubleshoot issues, and optimize cloud resources for maximum efficiency.\nQuality Assurance and Testing\nWork closely with QA Engineers to establish robust testing frameworks and ensure comprehensive test coverage for all projects.\nImplement CI/CD pipelines to streamline development processes and improve deployment efficiency.\nMonitor and resolve production issues promptly to minimize downtime and enhance user experience.\nCommunication and Collaboration\nAct as the primary point of contact between the development team and other departments, ensuring clear communication and alignment on project goals.\nPrepare and present progress reports to senior management, highlighting key achievements, risks, and areas for improvement.\nFacilitate knowledge-sharing sessions and workshops to enhance team skills and foster a culture of collaboration.",
    "requirements": "Bachelor’s degree in Computer Science , Software Engineering , or a related field (Master’s degree preferred).\nMinimum of 7+ years of experience in software development, with at least 3+ years in a leadership or managerial role.\nProven track record of managing teams working with Next.js , React Native , MERN Stack , and NestJS .\nStrong understanding of modern web and mobile application architectures, APIs, B2B, SaaS, and cloud-based solutions.\nHands-on experience with DevOps tools (e.g., Jenkins, GitLab CI/CD, Docker) and cloud platforms (e.g., Azure, GCP).\nExpertise in implementing CI/CD pipelines , automating deployments, and managing cloud infrastructure.\nFamiliarity with Agile methodologies, DevOps practices, and CI/CD pipelines.\nExcellent problem-solving skills and the ability to make data-driven decisions under tight deadlines."
  },
  {
    "title": "Frontend Team Lead",
    "posted_date": "Posted8 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/Dzz4g7XbVgBC-Frontend-Team-Lead-Alexandria-Egypt",
    "experience": "5 to 7 years",
    "education": "Not Specified",
    "salary": "Confidential, Social Insurance & Medical Insurance",
    "skills": "Agile Scrum, Angular, Communication skills, JavaScript, UI/UX design, DevOps, Dockerm Kubernetes, Problem Solving",
    "description": "Job Description:\nWe are looking for a Frontend Team Lead to drive the design and development of modern, high-performance web applications using Angular. This role requires a strong technical background, leadership skills, and Agile mindset to ensure the delivery of scalable, user-friendly, and maintainable frontend solutions. The ideal candidate will collaborate with backend developers, UI/UX designers, DevOps engineers, and QA teams to build seamless and visually appealing user experiences.\nKey Responsibilities:\n1. Technical Leadership & Development:\n Lead the development of scalable, responsive, and high-performance web applications using Angular.\n Define frontend architecture, coding standards, and best practices.\n Ensure the frontend integrates seamlessly with backend APIs and follows security best practices.\n2.Agile & Team Management:\n Act as a technical mentor for frontend developers, conducting code reviews and knowledge-sharing sessions.\n Work closely with the Scrum Master and Product Owner to plan and deliver sprint goals.\n Ensure the team follows Agile best practices, including CI/CD, test automation, and iterative development.\n Encourage a collaborative and high-performance development culture.\n3. UI/UX Collaboration & Performance\n Work with UI/UX designers to ensure an intuitive and engaging user experience.\n Optimize frontend performance, ensuring fast page loads, efficient rendering, and smooth user interactions.\n Implement progressive web app (PWA) features, lazy loading, and caching strategies for improved performance.\n4. DevOps & Testing Automation:\n Collaborate with DevOps engineers to implement CI/CD pipelines for automated builds and deployments.\n Ensure the frontend is properly containerized (Docker, Kubernetes) and deployed in cloud environments.\n Advocate for unit testing, end-to-end (E2E) testing, and integration testing using Jest, Jasmine, Karma, Cypress, or Playwright.\n5. Stakeholder Communication & Cross\nTeam Collaboration:\n Work closely with backend developers, DevOps engineers, QA teams, and Product Owners to align technical requirements.\n Provide regular updates on frontend progress, challenges, and improvements.\n Participate in technical discussions, architecture reviews, and sprint retrospectives.",
    "requirements": "Technical Skills:\n 5+ years of experience in frontend development, with at least 2 years in a leadership role.\n Expertise in Angular (latest versions), TypeScript, and JavaScript ES6+.\n Strong knowledge of HTML5, CSS3, SCSS, and responsive design.\n Experience with state management libraries (NgRx, Redux).\n Proficiency in RESTful API integration, WebSockets, and GraphQL.\n Knowledge of frontend performance optimization, lazy loading, and caching techniques.\n Experience with testing frameworks (Jest, Jasmine, Karma, Cypress, Playwright).\n Familiarity with DevOps practices, CI/CD pipelines, and containerized frontend deployments.\n Understanding of security best practices (XSS, CORS, authentication mechanisms like OAuth, JWT, SSO).\nLeadership & Agile Skills:\n Proven experience leading and mentoring frontend teams.\n Strong understanding of Agile Scrum methodologies and experience working in Agile environments.\n Excellent problem-solving skills and ability to troubleshoot frontend issues.\n Strong communication skills to work effectively with cross-functional teams and stakeholders.\nPreferred Certifications:\n Certified Scrum Master (CSM) or Professional Scrum Developer (PSD).\n Google Mobile Web Specialist Certification (preferred for performance optimization)."
  },
  {
    "title": "Senior Developer/Manager (Full-Stack + ML Ops)",
    "posted_date": "Posted10 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/SY4v8o8V7qxZ-Senior-DeveloperManager-Full-Stack-ML-Ops-My-Business-Care-Team-Cairo-Egypt",
    "experience": "5 to 15 years",
    "education": "Not Specified",
    "salary": "40000 to 70000 EGP Per Month",
    "skills": "AWS, Information Technology (IT), Software, Software Development, DevOps, Cloud, Lambda, EC2, DynamoDB, S3, CloudWatch, Terraform, Docker, Kubernetes, Python, Node.js, PHP, Django, Express.js, React.js, Vue.js, Typescript, TensorFlow, PyTorch, NLP, RESTful APIs, PostgreSQL, MySQL, NoSQL, MongoDB, Git, Github, Jenkins",
    "description": "Location: Remote\nEmployment Type: Full-Time\nExperience Level: Senior\nSalary Range: Competitive (Based on experience)\nAbout the Role\nWe are seeking an experienced Senior Developer/Manager with expertise in Full-Stack Development, ML Ops, and AWS/Amazon Connect Support. The ideal candidate will lead development projects, optimize cloud-based call center solutions, and implement Machine Learning (ML) Operations to enhance AI-driven customer interactions. This role involves a mix of hands-on development, architecture planning, team leadership, and AWS cloud infrastructure management.\nKey Responsibilities\nFull-Stack Development & Architecture:\nDesign, build, and maintain scalable backend and frontend applications.\nWork with frameworks such as React.js, Vue.js, Node.js, Python, PHP, and Django.\nDevelop and manage RESTful APIs, GraphQL, and microservices architectures.\nML Ops & AI/ML Integration:\nImplement MLOps pipelines for model training, deployment, and monitoring.\nWork with NLP and AI-driven voice agents for enhanced call automation.\nAnalyze call transcripts, customer interactions, and system logs for machine learning insights.\nAmazon Connect & AWS Cloud Infrastructure Management:\nConfigure, deploy, and maintain Amazon Connect for VoIP and AI-powered call handling.\nOptimize AWS services such as Lambda, DynamoDB, S3, EC2, Beanstalk, and API Gateway.\nEnsure seamless integration of AI-driven voice agents with Amazon Connect.\nDevOps & CI/CD Automation:\nAutomate infrastructure as code (IaC) using Terraform, AWS CloudFormation.\nImplement CI/CD pipelines with GitHub Actions, Jenkins, or AWS CodeDeploy.\nMonitor application performance and optimize resource utilization.\nSecurity, Compliance & Performance Optimization:\nImplement cloud security best practices for AWS-based environments.\nOptimize database performance and API efficiency.\nEnsure compliance with data privacy regulations in AI-driven call handling.\nPreferred Technologies & Tools\nCloud & DevOps: AWS (Amazon Connect, Lambda, EC2, DynamoDB, S3, CloudWatch), Terraform, Docker, Kubernetes.\nBackend Development: Python, Node.js, PHP, Django, Express.js.\nFrontend Development: React.js, Vue.js, TypeScript.\nML & AI: TensorFlow, PyTorch, AWS SageMaker, NLP APIs.\nDatabase Management: PostgreSQL, MySQL, NoSQL (MongoDB, DynamoDB).\nVersion Control & CI/CD: Git, GitHub Actions, Jenkins, AWS CodePipeline.\n \nAbout You\nBachelor’s/Master’s degree in Computer Science, Software Engineering, or a related field.\n5+ years of experience in full-stack development and cloud-based AI/ML implementations.\n3+ years of experience working with AWS and Amazon Connect for cloud-based call center solutions.\nStrong expertise in ML Ops, AI-powered automation, and DevOps best practices.\nAbility to lead development teams, manage multiple projects, and optimize workflows.\nPassion for AI-driven customer experience improvements.",
    "requirements": "About You\nBachelor’s/Master’s degree in Computer Science, Software Engineering, or a related field.\n5+ years of experience in full-stack development and cloud-based AI/ML implementations.\n3+ years of experience working with AWS and Amazon Connect for cloud-based call center solutions.\nStrong expertise in ML Ops, AI-powered automation, and DevOps best practices.\nAbility to lead development teams, manage multiple projects, and optimize workflows.\nPassion for AI-driven customer experience improvements."
  },
  {
    "title": "AI Solutions Architect",
    "posted_date": "Posted7 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/NvNlX163ebd3-AI-Solutions-Architect-Get-AI-Driven-Cairo-Egypt",
    "experience": "5 to 15 years",
    "education": "Bachelor's Degree",
    "salary": "1200 to 2500 USD Per Month",
    "skills": "AI, Architecture, Computer Engineering, APIs, Computer Science, DevOps, Engineering, English, JavaScript, Software, Software Engineering, Communication, Salesforce CRM, Zapier, python development, Windows Movie Maker, N8N, LLMs, Prompting, Vector Database, Good Listener, Collaborative, Problem Solving, Problem Analysis, Automation Engineering, Automation Systems, CRM Software, Accounting, Machine Learning, Slack, Digital Marketing, Computer Skills, Computer Systems, Business Analysis, Research",
    "description": "We're looking for a \nstrategic, systems-minded AI Integrator & Architect\n with a strong software background and hands-on experience implementing AI solutions. This isn’t just prompt hacking—we want someone who understands backend and frontend architecture, knows how business works, and is excited to build automations and intelligent workflows that make a real difference.\nThis role blends strategic design, technical implementation, and deep collaboration with business teams. If you're a full-stack engineer leaning into AI—or already there—and you want to lead high-impact builds for real-world companies, this is for you.\nKey Responsibilities\nStrategic Architecture & Design\nDesign full AI system architectures that combine no-code/low-code tools, APIs, and custom logic\nTranslate business needs into scalable, automation-driven technical systems\nArchitect and deploy RAG (retrieval-augmented generation) systems for internal knowledge and support\nDefine strategies to evolve one-off client builds into reusable, productized solutions\nHands-On Technical Implementation\nBuild full-stack workflows using Make.com, N8N, Relevance AI, Voiceflow, or similar\nIntegrate tools with databases (Supabase, PostgreSQL, Pinecone, etc.)\nLeverage APIs from OpenAI, Claude, LangChain, and others to implement LLM-based solutions\nImplement automations that integrate with business systems: QuickBooks, Intercom, GoHighLevel, Office apps, etc.\nWrite scripts or connectors where necessary to bridge tools and platforms\nEnsure enterprise-grade security, scalability, and performance\n \nProject Leadership\nLead projects from idea to deployment with minimal supervision\nWork directly with business stakeholders (often founders and ops leads)\nOwn deliverables, communicate timelines, and document decisions\nTroubleshoot edge cases and propose scalable solutions\n \nPay & Engagement Details\nRemote full-time\n (work directly with the client as part of their team)\nHiring from\n: Egypt, Latin America, and similar regions\nPay\n: $1,200–$2,500 USD/month depending on experience and location\nBenefits\n: Paid holidays, paid time off, and long-term stability\nGrowth potential, ownership over meaningful projects, and team support from Get AI Driven\n \nWhat We Offer\nA role with real autonomy and impact on how businesses operate\nLong-term placement with purpose-driven companies\nThe chance to lead full-scale projects—not just execute tasks\nOngoing support from the Get AI Driven team\nAn opportunity to grow with us as we expand our productized services",
    "requirements": "What We’re Looking For\nTechnical Experience\nStrong foundation in software engineering (frontend/backend, or full-stack curious)\nProven track record building tools that solve real problems for real users\nComfort working in business environments and translating technical needs into action\nExperience (or deep interest) in AI systems, automation, and intelligent workflows\nFamiliarity with no-code platforms (Make, N8N, Zapier), LLM APIs, and custom scripting\nExperience with relational and vector databases\n \nBonus Skills\nPython, JavaScript, or similar programming languages\nReact or other front-end frameworks\nCloud architecture and DevOps familiarity\nModel fine-tuning or custom training workflows\n \nMindset & Communication\nStrategic thinker who sees the whole system—not just isolated builds\nCurious, iterative, and self-directed—you don’t wait to be told what to do\nGreat communicator with both technical and non-technical people. Must have strong English speaking skills, including understanding nuance, metaphor, analogies, etc. \nThrives in remote, async environments\nStrong alignment with values like fairness, perseverance, ownership, and growth"
  },
  {
    "title": "AI & Software Trainer",
    "posted_date": "Posted12 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/SwXxBD69AgT5-AI-Software-Trainer-compsoft-Giza-Egypt",
    "experience": "1 to 7 years",
    "education": "Bachelor's Degree",
    "salary": "15000 to 20000 EGP Per Month",
    "skills": "Computer Science, Information Technology (IT), Software, Software trainer, AI, Software Engineering, Big Data, Machine Learning, Data Engineering, Mobile Development, React.js, DevOps, Software Testing, Teaching, technical, Training",
    "description": "We're Hiring: AI & Software Trainers (Full-Time, On-Site)\nAre you an experienced professional passionate about teaching? Join our team as a Trainer in one of the following fields:\nAvailable Tracks:\nAI & Data Science\nGenerative AI\nBig Data Engineering\nMachine Learning\nData Engineering\nSoftware Development:\nMobile App Development\nReact (Frontend)\nDevOps\nSoftware Testing\nJob Details:\nWork Mode: On-site (Offline) – 4 days/week (Sunday to Wednesday)\nSalary: EGP 15,000 – 20,000 (based on experience)\nTraining Provided: TOT program + teaching materials\nStart Date: May or June (post-Eid training period)\nEmployment Type\nFull-time",
    "requirements": "Qualifications:\n \nBachelor's degree in a relevant field\nPrior experience in training or mentoring is a plus\nStrong technical expertise in the selected field\nPassion for teaching and knowledge-sharing"
  },
  {
    "title": "DevOps Engineer",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/wojyXPj61KCj-DevOps-Engineer-qTech-Dakahlia-Egypt",
    "experience": "3 to 5 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "DevOps, Agile, Software Development, SQL Server, .Net Framework, Angular, ASP.Net, Azure DevOps Server, Microsoft TFS, Git",
    "description": "Design, implement, and maintain CI/CD pipelines in Azure TFS/Azure DevOps Server to ensure fast and reliable software delivery\nCreate and optimize build and deployment processes for .NET applications\nManage and optimize on-premises TFS infrastructure, including build agents, release management, and work item tracking\nImplement and maintain monitoring solutions for TFS infrastructure, build processes, and related applications\nDevelop and maintain PowerShell scripts for automation of build and deployment processes\nConfigure and manage Azure DevOps Server features including code repositories, build definitions, and release pipelines\nImplement security best practices and manage access controls within TFS\nProvide technical guidance to development teams on branching strategies, build processes, and deployment procedures\nMaintain backup and disaster recovery procedures for TFS infrastructure\nTroubleshoot issues related to builds, releases, and source control\nDocument processes, configurations, and system architecture\nParticipate in daily stand-ups and provide support to development teams\nResponsible for Final Releases of Applications and it’s process",
    "requirements": "Bachelor's degree in computer science, Information Technology, or related field\n3+ years of software development experience with.NET Framework and/or .NET Core\n2+ years of experience in DevOps engineering or similar role\nStrong experience with Azure DevOps Server/TFS administration and configuration\nProven experience with PowerShell scripting and automation\nDeep understanding of software development lifecycle and CI/CD practices\nExperience with version control systems, particularly Git and TFVC\nKnowledge of build and release management principles\nDevelopment Skills\nStrong proficiency in C#, .NET Framework/Core and angular\nExperience with ASP.NET web applications\nUnderstanding of software design patterns and SOLID principles\nExperience with unit testing and test automation\nFamiliarity with front-end technologies (JavaScript, HTML, CSS)\nGood \nDevOps Skills\nAzure DevOps Server/TFS administration\nPowerShell scripting\nWindows Server administration\nIIS configuration and management\nSQL Server maintenance (for TFS databases)\nBuild and release automation\nSource control management (Git and TFVC)\nInfrastructure as Code principles\nNetwork security and authentication protocols\nPreferred Qualifications\nMicrosoft certifications (Azure DevOps Engineer Expert, MCSE, or similar)\nKnowledge in Node.js\nExperience with Azure cloud services integration\nKnowledge of containerization technologies (Docker)\nFamiliarity with agile development methodologies\nExperience with application monitoring tools\nKnowledge about SonarQube and it’s configuration\nSoft Skills\nStrong problem-solving and analytical abilities\nExcellent communication skills (written and verbal)\nAbility to work effectively in a team environment\nStrong documentation skills\nCapacity to manage multiple priorities in a fast-paced environment\nCustomer-focused mindset"
  },
  {
    "title": "Server Administrator/DevOps Engineer",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/js0SiAv27N7Q-Server-AdministratorDevOps-Engineer-Safa-Soft-Cairo-Egypt",
    "experience": "More than 3 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Computer Engineering, Computer Science, Docker, Engineering, Information Technology (IT), Linux, Kubernetes",
    "description": "Job Summery:\nWe are seeking a qualified System Administrator/DevOps engineer who knows Docker inside and out. They will be responsible for defining and implementing our containerization technology strategies. They will also design our architecture and define our roadmap. The candidate will work on building, scaling, and monitoring various highly complex applications of ours, and making our container orchestration cluster highly available.\nHe must have knowledge about container orchestration tools like Kubernetes and logging/monitoring tools for these orchestration tools. They will also be responsible for building and improving our application CI/CD pipelines and keeping themselves and their team up-to-date with the latest industry trends and technologies. Also has excellent communication, people and problem solving skills. Reporting to the Software Development Department, perform both technical and administrative tasks to ensure functionality and efficiency of computer and network systems.\nResponsibilities\n         Implement and improve monitoring and alerting.\nBuild and maintain highly available systems on Kubernetes.\nImplement and manage CI/CD pipelines.\nImplement an auto-scaling system for our Kubernetes nodes.\nAbility to work with agile development teams.\nDemonstrated proficiency with automated configuration management tools (Puppet, Ansible, Chef)\nEnsure security through access controls, backups and firewalls.\nUpgrade systems with new releases and models.\nResponsible for application administration activities in support of development, user acceptance test and production systems supporting web-deployed applications\nMonitoring internal and production hosts using Nagios, Cacti, and other application performance monitoring systems.\nWorking with Developers and other Engineers in troubleshooting internal production issues.\nPerforming network and operational tasks in the internal and production systems.\nScripting operational tasks for faster and less error-prone execution.\nWorking with the Operations and Product Development teams in continually improving the company’s automated software deployment process.\nMaintaining and evolving the security infrastructure on both internal and production environments.\nWorking with the Operations and Product Development teams in continually improving the company’s automated software deployment process.\nMaintaining and evolving the security infrastructure on both internal and production environments.",
    "requirements": "Operations or systems administration experience, particularly on Linux.\nAt least 3 years of experience with Kubernetes, Docker, and/or cloud deployment technologies.\nExperience with container networking on Docker.\nExperience with application deployment by using CI/CD.\nExperience with monitoring tools like Prometheus, Grafana, Datadog, etc.\nExperience with alerting tools like OpsGenie, PagerDuty, etc."
  },
  {
    "title": "Senior Cloud Solution Architect",
    "posted_date": "Posted24 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/4uAgQcQKfaTC-Senior-Cloud-Solution-Architect-EXALT-Technologies-Cairo-Egypt",
    "experience": "More than 5 years",
    "education": "Not Specified",
    "salary": "Confidential, Salary is connected to USD Rate",
    "skills": "Cloud, Computer Science, DevOps, Engineering, Information Technology (IT), Infrastructure, Linux, Networking, Python, Software, Software Engineering, Vmware",
    "description": "At EXALT, we thrive on \ninnovation, collaboration, and cutting-edge technology\n. We empower our teams with continuous learning, a fun and inclusive work culture, and the opportunity to work with some of the world's most exciting technologies. If you're ready to elevate your career and push the boundaries of cloud infrastructure, we want to hear from you! \n \nWe are seeking a \nhighly skilled and motivated\n \nSenior Cloud Infrastructure Engineer\n with expertise in\n OpenStack\n to design, deploy, and optimize cloud infrastructure solutions. This role is perfect for a \ncloud enthusiast\n who thrives on \nautomation, scalability, and security\n.",
    "requirements": "Required qualifications:\n \n5+ years of relevant experience in cloud deployment, Infrastructure, DevOps, or related fields.\nExperience with Linux systems administration.\nExpertise in OpenStack deployment and operations.\nKnowledge of networking concepts.\nProficiency in scripting (e.g., Bash, Ansible, Python).\nFamiliarity with PXE booting and provisioning bare-metal systems.\nHands-on experience deploying and managing Kubernetes and/or OpenStack environments.\nStrong experience with Terraform (writing modules, state management).\nProblem-solving mindset and ability to work in agile teams.\n \n \nKey Responsibilities:\n \nDesign and implement cloud infrastructure using VMWare and OpenStack.\nDeploy and configure Kubernetes and OpenStack clusters, ensuring high availability, scalability, and reliability.\nDevelop and maintain automation scripts and tools for platform deployment, including bare-metal provisioning and software installation\nCollaborate with customers to understand their infrastructure requirements and ensure successful onboarding to Kubernetes and OpenStack platforms.\n \nEnsure compliance with security best practices and policies.\nMaintain documentation for infrastructure architecture and processes.\n \nPreferred certificates\n: \nKubernetes Certified Administrator (CKA).\nCertified OpenStack Administrator (COA).\nRHCSA/RHCE\n \nWhy Join EXALT?\n \n✅ \nUnparalleled Career Growth\n – Work with \nglobal clients\n on \nstate-of-the-art cloud technologies\n. \n✅ \nA Culture of Excellence\n – Be part of a \nhighly skilled, agile, and collaborative\n team. \n✅ \nWork-Life Balance\n – Flexible work hours and a \nhybrid work mode\n. \n✅ \nContinuous Learning\n – Access to \nLinkedIn Learning, Udemy courses\n, and professional development programs."
  },
  {
    "title": "Technical Project Manager (TPM)",
    "posted_date": "Posted22 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/43yKhJtc1X2Z-Technical-Project-Manager-TPM-Cairo-Egypt",
    "experience": "3 to 7 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "JIRA, click up, Trello, Asana, Version Control:, Git, GitHub, GitLab, or Bitbucket, Methodologies: Agile, Scrum, Kanban, or Waterfall., Basic DevOps knowledge (CI/CD, Docker, Kubernetes) is a plus, Soft Skills: Strong communication, leadership, and problem-solving abilities., leadership, and problem-solving abilities.",
    "description": "Responsibilities\nPlan and optimize team utilization to ensure balanced workloads.\nTrack team productivity and ensure efficient resource allocation.\nEvaluate developer performance based on task completion and utilization.\nCreate and manage tasks in Jira (or other project management tools).\nWork with developers to define clear, actionable tasks.\nEnsure backlog grooming and sprint planning are up to date.\nCollaborate with developers and team leads to estimate task durations.\nEnsure estimations are realistic and aligned with project timelines.\nTrack progress and adjust estimations as needed.\nMonitor developer workload and provide utilization reports.\nIdentify bottlenecks and suggest efficiency improvements.\nWork with management to optimize team performance.\nMaintain and update project documentation, including technical specs, workflows, and best practices.\nEnsure all stakeholders have clear documentation on project progress.\nAct as the primary point of contact between development teams, product owners, and stakeholders.\nProvide regular project updates and risk assessments.\nFacilitate communication between technical and non-technical teams",
    "requirements": "Qualifications & Skills\nEducation:\n-  \n  Bachelor’s degree in computer science, Software Engineering, or a related field.\n-    Certifications: PMP, CSM (Certified Scrum Master), or equivalent.\nExperience\n- \n  \n3-7 years in technical project management, software development, or a related field.\n-   Industry Experience: IT, SaaS, or software development projects"
  },
  {
    "title": "Senior Linux System Admin (+3 years experience)",
    "posted_date": "Posted26 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/3bPtAsc7B4zP-Senior-Linux-System-Admin-3-years-experience-3D-Diagnostix-Cairo-Egypt",
    "experience": "More than 3 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential, Social and medical insurance",
    "skills": "Linux, System Administration, Information Technology (IT), Network Administration, AWS, Bash, MySQL, Vmware, Automation, Linux Operating System, Linux OS, Red Hat Linux, Embedded Linux, Linux System Administration, DevOps, Azure DevOps Server, Apache, Red Hat, Amazon AWS, AWS Elastic Beanstalk, Firewall, Sophos Firewall, Firewall Management, EC2, RDS, Amazon S3, Mysql Database, MYSQL, Python, Ubuntu, VMware vSphere, vmware virtualization, python, Bash Scripting, MySQL Administration",
    "description": "Roles & Responsibilities:\nEnsure the security and efficiency of IT infrastructure\nCommit for 99.9 uptime of internal and external servers\nMonitor and tune the performance of Amazon EC2 (ubuntu), RDS (MySQL) servers\nMonitor AWS services using Amazon Cloud Watch\nMaintain, troubleshoot, and tune Ubuntu servers\nEstablish metrics and carefully monitor the utilization of AWS resources\nFollow the -backup policy, perform backups, and verify backups of internal and external data, aiming for zero data loss.\nMaintain 99.9 uptime of internet connections and maintain a disaster recovery plan\nRespond to and resolve help desk requests\nDisplay key KPls (Key Performance Indicators) on a dashboard\nConfigure alerts and notifications for key metrics\nUse the ticketing system for all requests, respond in time as per SLAS\nInstall and configure software, networking equipment, and hardware\nAdministrate infrastructure, including firewalls, databases, malware protection software --Review application and server logs\nManage network servers including VMware and Amazon resources\nMaintain high available internal VMware servers\nSet up accounts and permissions\nMonitor performance and maintain systems according to requirements\nMonitor the system daily and respond immediately to security or usability concerns Troubleshoot issues and outages\nEnsure security through access controls, backups, and firewalls\nUpgrade systems with new releases and models\nDevelop expertise to train staff on system admin basic tasks (Linux commands, networking troubleshooting commands)\nBuild an internal wiki with technical documentation, manuals, and IT policies\nDevelop and maintain SLAS (Service level agreements)\nMeet or exceed agreed-upon SLAs, in terms of response and fixed time\nKeep a log of changes, and adhere to CM (Configuration Management) best practices. -24/7 on-call readiness for emergencies and escalated ticket response.",
    "requirements": "Certificates\n• RHCE - Red Hat Certified System Engineer (Must have)\n• AWS DevOps/SysOps/Solution Architect (Must have)\n• CCNA - Cisco Certified Network Associate (Plus)\nExperience\n3-8 years of experience in the above domain and technologies\nSKILLS\n• Advanced Linux (Ubuntu) system administration\n• Terraform scripting\n• Ansible scripting\n• Advanced Bash shell scripting\n• Proven Amazon AWS administration (EC2, IAM, RDS, S3)\n• MySQL administration\n• VMWare administration and high availability\n• Network Administration\n• Respond promptly to help desk requests after hours (be on call)"
  },
  {
    "title": "Software Developer \"Outsourced Cash team\"",
    "posted_date": "Posted27 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/bmSZhCFOQGcw-Software-Developer-Outsourced-Cash-team-Efada-Technology-Giza-Egypt",
    "experience": "2 to 6 years",
    "education": "Not Specified",
    "salary": "15000 to 28000 EGP Per Month",
    "skills": "Agile, Information Technology (IT), Java, Software Development, Computer Science, Agile Methodology, AWS, Cloud, SQL, Software Engineering, DevOps, Java Software Development, Spring Boot, Linux",
    "description": "Outsourcing Job Model: contracted with EFADA Technology, working site at the customer's side\nKey Role:\nCreating prototypes, designing and building modules and solutions in an iterative agile cycle\nEstimating user and technical stories, designing and developing code, writing and executing unit and integration tests, and supporting testing of deliverables\nPerforming peer reviews, collaborating with architects and other developers.\nProviding software-related operations support\nDeveloping API and integration capabilities and prepare low-level designs for team members, in collaboration with Solution/Software Architect.\nDeploying and maintaining software using public clouds, such as AWS or Azure.\nGuides project teams on technology strategy related to coding practices, continuous integration, and automated deployment.\nBe hands-on and engage in coding to help the team to develop its solution and solve all surfacing problems at hand Identifies and removes technical impediments.\nProvides the team a roadmap for implementing software engineering practices for higher code quality\nDeveloping software applications using relational and NoSQL databases.\nMaintains high standards of software quality within the team by establishing good practices.\nShares responsibility with the Product Owner for building reusable and scalable components.\nWrite clean readable code, debug complex problems that span systems, prioritize, and get things done with a high level of efficiency.\nBuilding FinTech platform and make use of microservices architecture.",
    "requirements": "Must have technical/professional qualifications: \nEngineering graduate \nExcellent communication skills, both written and verbal, \nExcellent time management with a strong sense of urgency.\nAbility to learn new technologies quickly and efficiently.\n \nCore competencies, knowledge, and experience:\n3+ years of experience in Java, Spring framework, OOP, PL/SQL DB, API Gateway, Design-Patterns, Microservices architecture & distributed systems, with deep insight into newest technologies.\nDeep experience in containerization.\nExperience in payments and Fintech.\nHands-on experience in CI/CD pipelines and  DevOps tools.\nVendor management for architecting and reviewing the designs and implemented architectures and solutions.\nVery good knowledge of Client/Server architectures is a plus.\nExpert-level experience in building Java Spring applications on modern architecture (think microservice-based cloud native apps)\nKnowledge on Web service communication(through different channels, HTTPS calls to transport XML, JSON format data)\nExperience designing well-defined Restful APIs.\nDelivering exceptional client service and solutions\nDetailing of the technical specifications required to deliver the functional requirements of the solution\nAbility to provide estimation of effort for technical developments\nAbility to manage stream deliverables\nResponsible for issue resolution post go-live and transition to support\nPrevious experience or willingness to work on a fast pace Agile environment.\nGood knowledge of Unix/Linux operating system environments.\nSecurity, authentication, authorization techniques."
  },
  {
    "title": "Full Stack Developer",
    "posted_date": "Posted29 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/DE6JGQgQcIlz-Full-Stack-Developer-Genie-Monufya-Egypt",
    "experience": "0 to 5 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential, shares from company",
    "skills": "React, Django Framework, Python, tailwindcss, Full Stack Developer, JavaScript, Odoo, Computer Science, Design, Development, DevOps, Docker, Git, Information Technology (IT), CSS",
    "description": "Join Us in Building the Future of AI & Automation!\nWe are looking for a \nMid-Level Full-Stack Developer\n to help us build the \nfirst Multi-Agent CRM with Advanced AI Capabilities\n. If you're passionate about AI, automation, and cutting-edge technology, this is your chance to work on groundbreaking projects where humans and AI collaborate for maximum productivity.\n \nLocation:\n Sadat City, Menofia, Egypt \n(Accommodations available if needed)\n What You’ll Be Working On:\nAt \nAI Genie\n, we're not just building another CRM—we're redefining how businesses operate using AI. You'll be working on exciting, high-impact projects, including:\n \nAI Studio\n – A drag-and-drop platform for building AI-powered workflows\n \nThe First ERP That Builds Itself\n – A revolutionary ERP system that learns and adapts\n⚡ \nAI-Driven Productivity Tools\n – Helping businesses automate tasks and scale faster\n What You’ll Be Doing:\nDevelop scalable web applications with AI-driven features\nBuild and improve AI-powered tools for automation\nWork on next-generation ERP and CRM systems\nEnsure high code quality and best practices\nCollaborate in an innovative, fast-paced environment\n Why Join Us?\n \nWork on cutting-edge AI projects that redefine industries\n \nCompetitive salary based on experience\n \nContinuous learning and career growth opportunities\n \nBe part of a team where humans and AI work together to maximize productivity\n \nGet company shares after a certain period – grow with us as we scale!\nBe part of the future. Let’s build something amazing together!",
    "requirements": "What You’ll Need to Succeed:\n Backend (Python & Django):\n✅ Strong Python skills\n✅ Expertise in Django authentication & authorization\n✅ Complex query optimization & performance tuning\n✅ Scalable system design & best practices\n✅ Test-Driven Development (TDD)\n Frontend (React & TypeScript):\n✅ Tailwind CSS, Vite, and TypeScript\n✅ React hooks & advanced form validation\n✅ Redux & complex form state management\n General Skills:\n✅ Clean, maintainable code practices\n✅ Autonomous problem-solving skills\n✅ Strong Git version control experience\n✅ Understanding of CRM workflows & data models\n✅ Familiarity with sales funnels & pipeline concepts\n Bonus Points (Huge Plus!):\n➕ Experience in Odoo development\n➕ DevOps knowledge (CI/CD, Docker, etc.)"
  },
  {
    "title": "Software Developer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/G5vGAMHHUnjU-Software-Developer-HITS-Solutions-Cairo-Egypt",
    "experience": "1 to 3 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential, Medical Insurance ,Gym.",
    "skills": "Information Technology (IT), Computer Science, Engineering, Computer Engineering, Integration, Software Development, Software Engineering, JSON, JQuery, AJAX, javaScript, .NET, HTML5, CSS3, SQL, OOP, DevOps, Communications Engineering, Electronics, Mechatronics, MVC, Microservices, Bootstrap",
    "description": "General duties and responsibilities:\nDesign, build, and maintain efficient, reusable, and reliable code.\nDevelop, maintain and optimize scalable APIs.\nDeliver the assigned tasks within due time frame and minimum percentage of bugs.\nInvestigate and research new technologies.\nReview and refactor code.\nDeveloping Integration Programs.\nWorking closely with other developers, UX designers, business and systems analysts.\nAnalyze code for performance enhancement and present detailed plans to improve them.",
    "requirements": "Job Requirements:\nBachelor’s Degree in computer engineering / Computer Science / Mechatronics / Electronics & Communication Engineering / or any related discipline.\n1-3 Years of Experience.\nTechnologies:\nStrong background in object-oriented development techniques.\nStrong .NET Knowledge.\nSolid knowledge of ASP.Net Core.\nSolid knowledge of MVC and Razor.\nGood experience in RESTful APIs.\nSolid Knowledge of HTML5/CSS3 and modern web scripting and development (JavaScript, jQuery, Ajax, JSON, etc.).\nDatabase design and development (Microsoft SQL Server).\nGood knowledge of Bootstrap and Angular.\nGood Knowledge of DevOps development.\nKnowledge of Microservices and Docker is a plus.\nKnowledge of Xamarin is a plus."
  },
  {
    "title": "Senior Backend Developer",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/9mebIS4GcsXj-Senior-Backend-Developer-DOT-Information-Technology-Cairo-Egypt",
    "experience": "More than 3 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "C#, MVC, ASP.NET Core, MS SQL Server, Microsoft Azure, Azure DevOps Server",
    "description": "We are seeking a highly skilled Senior Backend Developer with expertise in C#, SQL Server, and Entity Framework to join our dynamic development team. The ideal candidate will have a deep understanding of backend technologies and frameworks, strong problem-solving skills, and the ability to lead complex development projects. This role also requires experience working with Angular for front-end integration and .NET MVC for web application development.\nKey Responsibilities:\nBackend Development:\nDesign, develop, and maintain robust and scalable backend systems using C#.\nDevelop APIs, web services, and other integrations to support front-end applications and external systems.\nDatabase Management:\nDesign and optimize SQL Server databases, ensuring high performance and reliability.\nWrite complex SQL queries, stored procedures, and functions for data manipulation and reporting.\nEntity Framework Expertise:\nUse Entity Framework to create and manage database models and queries.\nOptimize Entity Framework performance for large-scale applications.\nApplication Development:\nBuild and maintain web applications using .NET Framework and MVC architecture.\nCollaborate with the front-end team to integrate Angular components with backend services.\nSystem Design:\nParticipate in the architectural design of software systems, ensuring scalability and performance.\nProvide input on best practices for coding standards, system design, and technology selection.\nCode Quality:\nWrite clean, maintainable, and efficient code.\nPerform code reviews and provide constructive feedback to team members.\nAgile Development:\nParticipate in Agile/Scrum ceremonies, including sprint planning and retrospectives.\nCollaborate with cross-functional teams to deliver high-quality software solutions.\nTroubleshooting and Maintenance:\nDebug and resolve complex issues in existing systems.\nProvide support for production systems and ensure minimal downtime.\nMentorship:\nMentor junior developers, guiding them on best practices and modern development techniques.\nLead and oversee the technical aspects of projects to ensure successful delivery.",
    "requirements": "Core Backend Skills:\nStrong proficiency in C# and .NET Framework.\nSolid understanding of the MVC architecture.\nExpertise in Entity Framework for database modeling and interaction.\nDatabase Skills:\nProficiency in SQL Server, including database design, query optimization, and troubleshooting.\nStrong knowledge of database normalization and indexing strategies.\nFront-End Integration:\nFamiliarity with Angular for front-end development and integration.\nUnderstanding of how to build APIs that work seamlessly with front-end frameworks.\nAdditional Technical Skills:\nExperience with RESTful API design and implementation.\nFamiliarity with asynchronous programming, multithreading, and performance optimization.\nKnowledge of authentication and authorization mechanisms (e.g., JWT, OAuth).\nExperience with version control systems like Git.\nSoft Skills:\nExcellent problem-solving and analytical skills.\nStrong verbal and written communication skills to collaborate with technical and non-technical teams.\nTime management skills to handle multiple tasks and meet deadlines."
  },
  {
    "title": "Full Stack Team Lead",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/eEYV7c5oQqMa-Full-Stack-Team-Lead-Raise-Right-Company-Cairo-Egypt",
    "experience": "5 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Angular, Computer Science, backend, DevOps, Frontend, Information Technology (IT), Software Development, Mobile Development, JavaScript, Development, Docker, Gitlab",
    "description": "Key Responsibilities:\nLead , develop and optimize services using TypeScript, NestJS (NodeJS framework), PostgreSQL, Objection & Knex ORM, and GraphQL.\nLead development of modern web applications using Angular 17, Bootstrap, Apollo GraphQL, and PrimeNG.\nSupport the mobile team to oversee mobile development with Flutter, Firebase, Fastlane, Android Studio, and Xcode.\nHas the knowledge of DevOps using Docker, Nginx, GitLab CI/CD, Mattermost, Sentry, and Grafana.\nEnsure high software quality with Selenium WebDriver & SHAFT Engine (Java).\nLeadership: Mentor engineers, enforce best practices, and drive innovation.",
    "requirements": "Proven experience as a Tech Lead or Senior Engineer in backend, frontend, and mobile development.\nStrong expertise in NestJS, PostgreSQL, GraphQL, and Angular.\nHands-on experience with Flutter, Firebase, and DevOps tools (Docker, Nginx, GitLab CI/CD, etc.).\nExcellent problem-solving, system design, and leadership skills.\nWork with cutting-edge technologies on exciting projects.\nLead a talented team in a fast-paced environment.\nCompetitive salary and career growth opportunities."
  },
  {
    "title": "Technical Project Manager",
    "posted_date": "Posted9 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/V5tWq50zm2HP-Technical-Project-Manager-Alexandria-Egypt",
    "experience": "7 to 10 years",
    "education": "MBA",
    "salary": "Confidential, Social Insurance & Medical Insurance",
    "skills": "Communication skills, PMP, Agile, JavaScript, Engineering, Project Management",
    "description": "1. Agile & Scrum Leadership:\n Act as Scrum Master or work closely with the Scrum Master to ensure Agile best practices.\n Facilitate daily stand-ups, sprint planning, retrospectives, and sprint reviews.\n Drive continuous improvement and Agile adoption across teams.\n2. Technical Project Management:\n Define and manage project scope, objectives, timelines, and deliverables.\n Oversee software development using Spring Boot (backend), Angular (frontend), DevOps, and test automation.\n Ensure alignment between technical and business goals.\n Track project progress, risks, and dependencies, ensuring timely delivery.\n3. Collaboration with the Product Owner:\n Work closely with the Product Owner to refine and prioritize the product backlog.\n Translate business requirements into clear technical tasks and user stories.\n Ensure that sprint goals are well-defined and aligned with business objectives.\n Assist in product roadmap planning and stakeholder communication.\n4. DevOps & Release Management:\n Ensure seamless integration of CI/CD pipelines for automated deployments.\n Collaborate with DevOps engineers to improve software release processes.\n Maintain a focus on security, scalability, and performance.\n5. Test Automation & Quality Assurance:\n Promote Test-Driven Development (TDD) and Behavior-Driven Development (BDD) practices.\n Ensure proper integration of automated testing frameworks in the CI/CD pipeline.\n Work with QA teams to maintain high software quality standards.\n6. Stakeholder Communication & Reporting:\n Communicate project status, risks, and progress to executive leadership and stakeholders.\n Provide burndown charts, velocity reports, and Agile KPIs for tracking performance.",
    "requirements": "Technical Skills:\n Strong experience in Spring Boot (Java), Angular (TypeScript/JavaScript), RESTful APIs.\n Knowledge of microservices architecture and API integrations.\n Experience with DevOps, CI/CD pipelines, and cloud deployment (Docker, Kubernetes, Jenkins).\n Familiarity with test automation frameworks (JUnit, TestNG, Selenium, Cypress).\n Proficiency in Agile tools such as Jira, Confluence, and Git.\nProject Management Skills:\n 5+ years of experience in technical project management within Agile/Scrum environments.\n Proven experience in managing cross-functional teams, including developers, testers, and DevOps engineers.\n Strong expertise in Scrum, Kanban, and Agile best practices.\n Ability to manage multiple projects, prioritize tasks, and meet deadlines.\nSoft Skills:\n Excellent problem-solving and decision-making skills.\n Strong communication skills to collaborate with technical and business stakeholders.\n Ability to lead teams with a proactive, results-driven approach.\nPreferred Certifications:\n Certified Scrum Master (CSM) or Professional Scrum Master (PSM).\n Project Management Professional (PMP) or PMI Agile Certified Practitioner (PMI-ACP)."
  },
  {
    "title": "Backend Team Lead",
    "posted_date": "Posted8 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/1rRmdOXnXSSM-Backend-Team-Lead-Alexandria-Egypt",
    "experience": "5 to 7 years",
    "education": "Not Specified",
    "salary": "Confidential, Social Insurance & Medical Insurance",
    "skills": "backend, Communication skills, Scrum, Java, Spring Boot, Microservices Architecture",
    "description": "Job Description:\nWe are seeking a Backend Team Lead to guide and mentor a team of backend developers in designing, developing, and optimizing scalable backend services. The ideal candidate should have strong technical expertise in Spring Boot, microservices, RESTful APIs, and cloud-based deployments, as well as experience working in Agile Scrum environments with DevOps and test automation practices. This role requires leadership skills to drive high-performance development and ensure software quality.\n1. Technical Leadership & Development:\n Lead the design, development, and optimization of backend services using Spring Boot and microservices.\n Oversee the architecture, performance, and scalability of backend systems.\n Enforce clean code, best practices, and design patterns.\n Guide the team in implementing RESTful APIs, event-driven architectures, and database interactions.\n2. Agile & Team Management:\n Act as a technical mentor to backend developers, providing guidance and code reviews.\n Work closely with the Scrum Master and Product Owner to plan and execute sprints.\n Ensure the team follows Agile best practices, including TDD (Test-Driven Development) and CI/CD.\n Facilitate technical discussions and promote a collaborative development culture.\n3. DevOps & Cloud Integration:\n Collaborate with DevOps engineers to enhance CI/CD pipelines, containerization (Docker, Kubernetes), and cloud deployments.\n Ensure secure, reliable, and automated deployments.\n Advocate for observability, logging, and monitoring best practices.\n4. Performance Optimization & Code Quality:\n Ensure high availability, fault tolerance, and efficient database interactions.\n Conduct code reviews, performance analysis, and troubleshooting of backend systems.\n Implement and maintain unit testing, integration testing, and test automation frameworks.\n5. Stakeholder Collaboration & Communication:\n Work closely with frontend developers, DevOps engineers, QA teams, and Product Owners to align technical requirements.\n Provide regular updates on backend progress, challenges, and technical risks.\n Participate in architectural discussions and technical decision-making.",
    "requirements": " 5+ years of experience in backend development, with at least 2 years in a leadership role.\n Expertise in Spring Boot, Java, and microservices architecture.\n Strong experience with RESTful APIs, WebSockets, and event-driven architectures.\n Knowledge of database technologies .\n Experience with DevOps, CI/CD, and containerization (Docker, Kubernetes, Jenkins, GitOps).\n Strong understanding of security best practices, API authentication (OAuth, JWT), and cloud platforms.\n Familiarity with test automation frameworks (JUnit, TestNG, Mockito, Pact).\nLeadership & Agile Skills:\n Experience leading and mentoring backend development teams.\n Strong knowledge of Agile Scrum methodology and experience working in an Agile environment.\n Excellent problem-solving skills and the ability to troubleshoot complex backend issues.\n Strong communication skills to work effectively with cross-functional teams and stakeholders.\nPreferred Certifications:\n AWS, Azure, or Google Cloud certifications (preferred for cloud deployments).\n Certified Scrum Master (CSM) or Professional Scrum Developer (PSD)."
  },
  {
    "title": "B2B Sales Executive – Infrastructure SaaS",
    "posted_date": "Posted1 dayago",
    "job_url": "https://wuzzuf.net/jobs/p/LqW3P6bu5GPn-B2B-Sales-Executive-–-Infrastructure-SaaS-DewanSoft-Giza-Egypt",
    "experience": "3 to 5 years",
    "education": "Not Specified",
    "salary": "Confidential, Commissions and Bonuses",
    "skills": "B2B Sales, business, B2B, Sales, sales skills, Sales Target, Technical Sales, Negotiation, CRM, Communication, Skills, IT, ERP Software, CRM Software, Software Development, Salesforce CRM, HubSpot",
    "description": "We are seeking a dynamic and results-driven B2B Sales Executive to join our team. This role focuses on selling infrastructure-based SaaS solutions to mid-market and enterprise-level organizations. The ideal candidate has a proven track record of consultative selling in the tech space, preferably with infrastructure, cloud, or DevOps-related products.\nOwn and lead revenue growth for infrastructure SaaS offerings, ensuring consistent achievement of quarterly and annual targets.\nIdentify and pursue new business opportunities in target verticals and emerging markets.\nBuild and maintain strong, long-lasting relationships with key decision-makers (CTOs, DevOps leaders, IT Managers).\nConduct strategic outreach, presentations, and demos tailored to client needs and business objectives.\nManage the full sales cycle: prospecting, qualifying, presenting, negotiating, and closing deals.\nCollaborate cross-functionally with product, marketing, and customer success to align revenue strategies and customer engagement.\nMonitor market trends, customer feedback, and competitive activity to identify potential for new revenue streams or product-market fit expansion.\nMaintain accurate forecasts and pipeline data in the CRM system and contribute to revenue planning.",
    "requirements": "Bachelor’s degree in Business, Technology, or a related field.\n3–5 years of B2B sales experience, preferably in infrastructure, cloud services, or DevOps-related SaaS products.\nStrong understanding of enterprise IT infrastructure and digital transformation needs.\nDemonstrated ability to communicate, present, and influence credibly at all levels of the organization.\nProven track record of meeting or exceeding quota in a technical sales environment.\nComfortable using CRM tools (e.g., Salesforce, HubSpot).\nExcellent negotiation, communication, and interpersonal skills."
  },
  {
    "title": "QualityAsurance Lead / Test Lead",
    "posted_date": "Posted8 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/xHHvd6peDWcb-QualityAsurance-Lead-Test-Lead-Alexandria-Egypt",
    "experience": "5 to 7 years",
    "education": "Not Specified",
    "salary": "Confidential, Social Insurance & Medical Insurance",
    "skills": "ISTQB, Agile, Software Development, Selenium, Cypress, CI/CD Integration",
    "description": "We are looking for a QA Lead / Test Lead to oversee the quality assurance process, ensuring the reliability, security, and performance of software applications. The ideal candidate should have strong expertise in test automation, CI/CD integration, and Agile testing practices. This role requires hands-on experience with manual and automated testing, as well as leadership skills to guide and mentor the QA team.\nKey Responsibilities:\n1. Test Strategy & Planning\n Define and implement the QA strategy, test plans, and testing processes in an Agile Scrum environment.\n Ensure test coverage for functional, regression, performance, security, and API testing.\n Collaborate with Product Owners, Developers, and DevOps engineers to align testing efforts with business goals.\n2. Test Execution & Automation:\n Lead the development and execution of automated test scripts for web and API testing.\n Implement and maintain test automation frameworks (Selenium, Cypress, Playwright, JUnit, TestNG, RestAssured, etc.).\n Ensure integration of automated tests with CI/CD pipelines (Jenkins, GitHub Actions, GitLab CI/CD).\n Oversee manual testing where automation is not feasible.\n3. Agile Testing & Continuous Quality Improvement:\n Drive shift-left testing, ensuring early involvement in the development cycle.\n Conduct Exploratory Testing, Smoke Testing, and UAT (User Acceptance Testing).\n Define and track QA metrics (defect density, test coverage, test execution rate, etc.).\n Advocate for TDD (Test-Driven Development) and BDD (Behavior-Driven Development) practices.\n4. Performance & Security Testing:\n Oversee performance and load testing using tools like JMeter, Gatling, or k6.\n Ensure security testing best practices, identifying vulnerabilities through penetration testing and API security assessments.\n5. Team Leadership & Collaboration:\n Lead and mentor the QA team, ensuring knowledge sharing and upskilling.\n Collaborate with development, DevOps, and product teams to improve software quality.\n Conduct code reviews for test scripts and ensure testing best practices.",
    "requirements": "Technical Skills:\n 5+ years of experience in software testing, with at least 2 years in a QA lead role.\n Expertise in test automation tools (Selenium, Cypress, Playwright, JUnit, TestNG, etc.).\n Strong experience with API testing (Postman, RestAssured, Karate, SoapUI).\n Knowledge of CI/CD pipelines and DevOps integration (Jenkins, GitLab CI/CD, Docker, Kubernetes).\n Experience with performance testing tools (JMeter, Gatling, k6).\n Familiarity with security testing tools (OWASP ZAP, Burp Suite, SonarQube).\n Strong understanding of Agile Scrum and QA processes.\nLeadership & Agile Skills:\n Experience leading QA teams and mentoring testers.\n Strong knowledge of Agile testing principles and practices.\n Excellent problem-solving skills and analytical mindset.\n Strong communication skills to work with cross-functional teams.\nPreferred Certifications:\n ISTQB (Foundation or Advanced Level) Certification.\n Certified Agile Tester (CAT) or Certified Scrum Master (CSM"
  },
  {
    "title": "Full Stack Developer",
    "posted_date": "Posted6 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/dYT8T3nYqRLO-Full-Stack-Developer-Babeleye-Cairo-Egypt",
    "experience": "2 to 3 years",
    "education": "Bachelor's Degree",
    "salary": "10000 to 14000 EGP Per Month",
    "skills": "Computer Science, Engineering, Software Development, Software Engineering, Information Technology (IT), Software, Laravel, jQuery, JavaScript, Bootstrap, Git, front-end",
    "description": "We are looking for a Full Stack Developer to design, develop, and maintain secure, responsive software solutions for our metadata services. The role involves building APIs, databases, and user interfaces using tools like Laravel, RESTful APIs, Bootstrap, and GitHub. Strong problem-solving skills, UI/UX expertise, and familiarity with DevOps are highly valued. Join us to create efficient, scalable systems in a collaborative environment.",
    "requirements": "Bachelor’s degree in computer science, Software Engineering, or related field.\nStrong knowledge of Object-Oriented Programming (OOP).\nWork with development teams and product managers to ideate software solutions\nExcellent problem-solving and analytical skills.\nDesign client-side and server-side architecture\nBuild the front-end of applications through appealing visual design\nDevelop and manage well-functioning databases and applications\nWrite effective APIs\nTest software to ensure responsiveness and efficiency\nTroubleshoot, debug and upgrade software\nCreate security and data protection settings\nBuild features and applications with a mobile responsive design\nWrite technical documentation\nHandling projects using DevOps is an advantage\nTools\nExperience in Laravel Framework.\nExperience in RESTful APIs.\nExperience in creating Database schemas.\nGood understanding of UI/UX design techniques and ability to build responsive designs.\nExperience in Bootstrap 4 & 5.\nExperience in  Javascript and JQuery.\nExperience in  Using GIT( GITHUB).\nBenefits:\nInternational and inclusive work environment.\nHybrid work model (Office and Home).\nSocial insurance.\nPrivate medical insurance.\n21 business days of paid annual leave.\nWeekends (Friday and Saturday) off.\nOff on all official holidays."
  },
  {
    "title": "Dot Net Senior Full Stack Developer",
    "posted_date": "Posted12 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/FPtCP0kZ6cwY-Dot-Net-Senior-Full-Stack-Developer-Cairo-Egypt",
    "experience": "3 to 5 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Full Stack Development, HTML, Angular, DotNet, Java, Information Technology (IT), JavaScript, REST, Software, Software Development, OOP, Computer Science, Agile",
    "description": "Design, develop, and maintain robust and scalable web applications using .NET and Angular/TypeScript.\nImplement and manage DevOps practices, including continuous integration, continuous delivery, and infrastructure as code.\nCollaborate with cross-functional teams to define, design, and ship new features.\nTroubleshoot and debug complex issues in a timely manner.\nEnsure the performance, quality, and responsiveness of applications.\nWrite clean, maintainable, and efficient code.\nMentor junior developers and conduct code reviews to ensure code quality.\nStay up-to-date with emerging technologies and industry trends.",
    "requirements": "Excellent hands-on experience in \nC# \n(OOP, SOLID principals, design patterns, clean code, threading, streaming, …)\nExcellent hands-on experience in \nAngular\n typescript\nVery good experience in \n.Net\n Framework\nVery good knowledge in \nJava script ,HTML,CSS\nVery good experience in Microservice architecture & REST APIs\nVery good experience in Unit Testing & mocking\nVery good experience in Relational & \nNoSQL\n Databases\nVery good experience in Caching and performance tuning\nGood experience in \nDocker, Kubernetes, DevOps\n \nCI/CD\nNice to have experience in azure Development\nNice to have experience in test automation & Test-Driven\nFamiliarity with \nCRM\n, \nReporting systems\n, \nBusiness Analytics\n, and \nLogging systems\n.\nStrong understanding of \nunit testing\n, \nintegration testing\n, and \ncomponent testing\n.\nProficiency with \nAgile methodologies\n and the \nSoftware Development Life Cycle (SDLC)\n."
  },
  {
    "title": "Software Technical Lead-Nodejs",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/YffXB0lQlGTR-Software-Technical-Lead-Nodejs-LINK-Development-Cairo-Egypt",
    "experience": "7 to 14 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Computer Science, Node.js, Software Development, Software Engineering",
    "description": "- Accomplished Node.js Team Lead with 7 to 9 years of hands-on experience, showcasing in-depth expertise in Node.js development and a strong focus on enterprise-level microservices architecture. A minimum of 2 years of dedicated experience in designing, implementing, and optimizing microservices solutions is required.\n- Proficiency in the NestJS framework is a must, demonstrating a thorough understanding of its principles and best practices. The candidate should have a proven ability to leverage NestJS to build scalable and maintainable microservices.\n- A comprehensive knowledge of the Node.js ecosystem, including proficiency in frameworks such as Express.js, is essential. The ideal candidate should be adept at navigating and utilizing the various tools and libraries within the Node.js environment. This includes expertise in Redis for caching, Kafka for event-driven architecture, and experience with API Gateway solutions.\n- Extensive experience in deploying microservices on Kubernetes is crucial, with specific expertise in managing deployments on Amazon EKS and Azure AKS. The candidate should have a deep understanding of container orchestration and be capable of optimizing Kubernetes infrastructure for efficiency.\n- Strong database skills are required, including hands-on experience with PostgreSQL and MongoDB. The ability to design and implement database solutions that align with microservices architecture is key.\n- Familiarity with DevOps practices in cloud-native environments is highly desirable. The candidate should have experience with DevOps tools, particularly ArgoCD and Tekton, for continuous delivery, automation, and efficient deployment workflows.\n- Proficient in TypeScript, showcasing the ability to write clean, maintainable, and scalable code.\n- Solid experience in React.js, with the ability to build modern and responsive user interfaces.\n- Knowledge of the PHP stack, demonstrating an understanding of PHP-based web development and integration within a larger technology ecosystem.\n- Proven ability to lead and mentor development teams, guiding them in the implementation of best practices and ensuring the successful delivery of microservices projects.\n- Strong analytical and problem-solving skills, capable of addressing challenges in a dynamic and fast-paced environment.\n- Clear and effective communication of technical concepts to both technical and non-technical stakeholders.\n- A collaborative approach to working with cross-functional teams to align microservices architecture with business objectives.\n- Commitment to staying abreast of the latest developments in Node.js, TypeScript, React.js, microservices, and cloud-native technologies.\n- Bachelor's degree in Computer Science, Engineering, or a related field.\n- Certifications in Kubernetes and cloud platforms (e.g., AWS, Azure) are advantageous.",
    "requirements": "- Accomplished Node.js Team Lead with 7 to 9 years of hands-on experience, showcasing in-depth expertise in Node.js development and a strong focus on enterprise-level microservices architecture. A minimum of 2 years of dedicated experience in designing, implementing, and optimizing microservices solutions is required.\n- Proficiency in the NestJS framework is a must, demonstrating a thorough understanding of its principles and best practices. The candidate should have a proven ability to leverage NestJS to build scalable and maintainable microservices.\n- A comprehensive knowledge of the Node.js ecosystem, including proficiency in frameworks such as Express.js, is essential. The ideal candidate should be adept at navigating and utilizing the various tools and libraries within the Node.js environment. This includes expertise in Redis for caching, Kafka for event-driven architecture, and experience with API Gateway solutions.\n- Extensive experience in deploying microservices on Kubernetes is crucial, with specific expertise in managing deployments on Amazon EKS and Azure AKS. The candidate should have a deep understanding of container orchestration and be capable of optimizing Kubernetes infrastructure for efficiency.\n- Strong database skills are required, including hands-on experience with PostgreSQL and MongoDB. The ability to design and implement database solutions that align with microservices architecture is key.\n- Familiarity with DevOps practices in cloud-native environments is highly desirable. The candidate should have experience with DevOps tools, particularly ArgoCD and Tekton, for continuous delivery, automation, and efficient deployment workflows.\n- Proficient in TypeScript, showcasing the ability to write clean, maintainable, and scalable code.\n- Solid experience in React.js, with the ability to build modern and responsive user interfaces.\n- Knowledge of the PHP stack, demonstrating an understanding of PHP-based web development and integration within a larger technology ecosystem.\n- Proven ability to lead and mentor development teams, guiding them in the implementation of best practices and ensuring the successful delivery of microservices projects.\n- Strong analytical and problem-solving skills, capable of addressing challenges in a dynamic and fast-paced environment.\n- Clear and effective communication of technical concepts to both technical and non-technical stakeholders.\n- A collaborative approach to working with cross-functional teams to align microservices architecture with business objectives.\n- Commitment to staying abreast of the latest developments in Node.js, TypeScript, React.js, microservices, and cloud-native technologies.\n- Bachelor's degree in Computer Science, Engineering, or a related field.\n- Certifications in Kubernetes and cloud platforms (e.g., AWS, Azure) are advantageous."
  },
  {
    "title": "Software Quality Control Lead",
    "posted_date": "Posted4 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/dVMDFo1kC6w7-Software-Quality-Control-Lead-Tafeel-Cairo-Egypt",
    "experience": "5 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Automation, Automation Testing, Agile, Computer Science, Information Technology (IT), ISTQB, Quality Control, Selenium, Software, Software Testing, SQL, Testing",
    "description": "Responsible for carrying out all testing activities related to enterprise products and projects.\nEnsuring deliverables are released to specification as well as the highest quality standards in compliance with the organizational processes and standards.\nCreate test scenarios, test conditions & expected results, and test cases.\nExecute test scripts and test software programs to compare specifications, documentation.",
    "requirements": "Bachelor’s degree in a relevant field (computer science is preferred)\n6+ years of relevant experience\nExcellent knowledge of SQL, mobile, API, web testing, and automation testing (using Selenium and Cucumber).\nExperience with issue tracking systems (e.g., Azure DevOps), performance, integration, and security testing.\nExperience with the Agile process.\nGood knowledge of the software testing process of integration with CI/CD.\nISTQB (advanced level, test manager) certification is a plus.\nISTQB (expert level) is a must.\nSolid understanding of code versioning tools, such as Git.\nProven ability to deal with ambiguity.\nSelf-driven and proactive spirit.\nHigh communication and critical thinking skills.\nGood command of English."
  },
  {
    "title": "Senior Full Stack PHP Laravel Developer (Remote - Full Time)",
    "posted_date": "Posted5 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/j8EuteiQISiz-Senior-Full-Stack-PHP-Laravel-Developer-Remote---Full-Time-HIGHBASE-TRADING-W-L-L-Cairo-Egypt",
    "experience": "5 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "700 to 1000 USD Per Month",
    "skills": "PHP, HTML5, CSS3, Laravel, MySQL, Vue.js, Tailwind, Front-End Development",
    "description": "Senior Full Stack PHP Laravel Developer (Remote - Full Time)\nLocation:\n Remote\nCompany:\n HIGHBASE Trading W.L.L\nAbout Us:\nHIGHBASE Trading W.L.L is pioneering B2B e-commerce solutions, revolutionizing the wholesale trade landscape. Join our dynamic team and contribute to building cutting-edge digital platforms that empower businesses globally.\nWe are seeking a skilled \nSenior Full Stack PHP Laravel Developer (Focus more on Front end, Vue.js, tailwind & CSS)\n to join our team. If you are passionate about web development, thrive in remote work environments, and meet the qualifications below, we'd love to hear from you!\n \nPosition Overview\nAs a \nSenior\n \nFull Stack PHP Laravel Developer (Focus more on Front end, Vue,js, tailwind & CSS)\n, you'll play a vital role in developing and maintaining high-quality web applications using the Laravel framework. You will collaborate with cross-functional teams, ensuring seamless integration and robust functionality.\n \nResponsibilities\nAnalyze website and application requirements to provide optimal solutions.\nDevelop and maintain efficient, clean, and scalable back-end portals using Laravel and optimized databases.\nWrite reusable, maintainable PHP code and create efficient modules.\nTroubleshoot and debug web applications, ensuring a seamless user experience.\nDesign and develop RESTful APIs, integrating third-party services as needed.\nEnsure code quality through rigorous testing (PHPUnit or Pest).\nStay updated with the latest trends and advancements in web development.",
    "requirements": "Key Requirements\nExperience:\nMinimum 5 years of professional experience in PHP, API, and Laravel development.\nExpertise in front-end technologies: HTML5, CSS3, JavaScript.\nIn-depth knowledge of MySQL with query optimization and schema design.\nExperience with Vue.js (composition and options API).\nProficiency in Python is a plus.\nTechnical Skills:\nObject-Oriented PHP and Laravel (versions 5-8).\nStrong command of REST API design and integration.\nFamiliarity with software testing frameworks like PHPUnit.\nKnowledge of Docker, DevOps, and CI/CD pipelines (preferred).\nExperience with cloud platforms like AWS is a bonus.\nSoft Skills:\nCritical thinker and proactive problem-solver.\nStrong communication skills for remote collaboration.\nPositive attitude and willingness to learn new technologies.\nWhat We Offer\nRemote work flexibility.\nOpportunities for professional development and growth.\nA collaborative, innovative team environment.\nCompetitive compensation.\nAttach a portfolio or GitHub profile showcasing your work."
  },
  {
    "title": "Senior Software Tester",
    "posted_date": "Posted6 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/cz57ptHBEqRy-Senior-Software-Tester-Ultimate-Solutions-Egypt-Giza-Egypt",
    "experience": "5 to 7 years",
    "education": "Not Specified",
    "salary": "12000 to 25000 EGP Per Month",
    "skills": "Computer Science, Information Technology (IT), Selenium, Software, Software Development, Software Engineering, API, Software Testing, SQL, Testing, Troubleshooting, UI",
    "description": "Ultimate Solutions is looking for a detail-oriented Senior Software Tester to join its QA team. The successful candidate will lead quality assurance efforts and ensure that all software solutions meet the highest standards before deployment.\nYou will be involved in both manual and automated testing, helping the team deliver robust, reliable, and bug-free software.\nResponsibilities:\n* Design, develop, and execute manual and automated test cases.\n* Lead and mentor junior testers.\n* Analyze and document defects, working closely with development teams to ensure timely fixes.\n* Create and maintain detailed test plans, test scenarios, and test scripts.\n* Participate in regression, functional, and performance testing.\n* Collaborate with cross-functional teams during the full software lifecycle.\n* Suggest process improvements and contribute to QA best practices.",
    "requirements": "5+ years of experience in software testing (manual and automated).\n- Strong understanding of SDLC, STLC, and test methodologies.\n- Experience with tools such as Selenium, Postman, JMeter, TestNG, etc.\n- Familiarity with API testing, database validation (SQL/PostgreSQL), and UI testing.\n- Experience with bug tracking systems (e.g., Jira, Azure DevOps).\n- Strong analytical and troubleshooting skills.\n- Excellent documentation and communication abilities."
  },
  {
    "title": "Senior .NET Core Developer",
    "posted_date": "Posted6 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/R2cLTCnceAzo-Senior-NET-Core-Developer-Ultimate-Solutions-Egypt-Alexandria-Egypt",
    "experience": "5 to 7 years",
    "education": "Not Specified",
    "salary": "20000 to 35000 EGP Per Month",
    "skills": "AWS, Azure, Computer Science, Design, Development, Information Technology (IT), Linq, RESTful, Software, Software Development, API, .Net",
    "description": "Ultimate Solutions is seeking a highly skilled Senior .NET Core Developer to join our growing team in Alexandria, Egypt. The ideal candidate will have extensive experience in .NET Core, PostgreSQL, and modern web standards. This is a full-time on-site position based at our Alexandria branch.\nYou will play a key role in designing, developing, and optimizing high-performance RESTful APIs, contributing to system architecture, and leading performance improvements and best coding practices across the team.\nResponsibilities:\n* Design, develop, and maintain scalable and secure RESTful services using C# and .NET Core.\n* Architect and manage multiple environments: Development, QA, Demo, and Production.\n* Collaborate with cross-functional teams to define optimal API contracts and system integration strategies.\n* Conduct code reviews, enforce best practices, and mentor junior developers.\n* Optimize database performance using Entity Framework Core, LINQ, and PostgreSQL.\n* Implement and maintain CI/CD pipelines and support containerized deployments with Docker and Kubernetes.\n* Participate in system architecture design and decision-making processes.\n* Adapt to evolving business requirements while maintaining code quality and performance.\n* (Optional but preferred) Contribute to Full-stack development using modern frontend frameworks.",
    "requirements": "5+ years of professional experience in software development with C# and .NET Core.\n- Strong expertise in EF Core, LINQ, and PostgreSQL.\n- Solid experience in RESTful API design and development.\n- Proficiency with Docker, Kubernetes, and microservices architecture.\n- Experience with CI/CD tools and DevOps best practices.\n- Familiarity with tools like Redis, RabbitMQ, or cloud platforms like Azure/AWS is a plus.\n- Strong problem-solving and analytical skills.\n- Excellent communication, leadership, and team collaboration abilities.\n- Full-time on-site availability in Alexandria branch is required."
  },
  {
    "title": "Backend Developer (Laravel - Developing APIs)",
    "posted_date": "Posted8 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/LEvfjg8birk0-Backend-Developer-Laravel---Developing-APIs-Ship-To-Box-Giza-Egypt",
    "experience": "More than 2 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential, Medical Insurance - Social Insurance - Transportation Allowance - Meal Allowance",
    "skills": "Laravel, Laravel Framework, Laravel PHP, Back-End Development, Node.js, MySQL, NodeJS, MVC, OOP, PHP, RESTful APIs, RESTful API, API, API Development",
    "description": "Employment Type:\n Full-time\nWe are seeking a skilled \nBackend Developer\n with a strong background in \nLaravel\n and experience in building and maintaining \nAPIs\n. If you are passionate about crafting reliable backend systems and want to work in a dynamic team environment, this role is for you!\nResponsibilities\nProficiency in Laravel is a MUST\nVery honest in giving deadlines and must meet them.\nWillingly to work under pressure.\nCommunicate with different team members located in different countries.\nWorking as part of a team with other departments (design, marketing, QA).\nDemonstrate a sense of urgency and good time management skills.\nComfortable both working as a self-starter and able to work in collaboration.\nUnderstanding requirements from team leader and report your progress on daily basis.\nWhy Join Us?\nOpportunity to work on exciting projects in a growth-driven company.\nCompetitive salary and benefits package.\nCollaborative and innovative work culture.",
    "requirements": "Bachelor's degree or above in related major.\n3+ years\n of professional experience working with \nLaravel\n.\n2+ years\n of hands-on experience in designing and developing \nAPIs\n.\nMust know English very well and self-motivated.\nMust know PHP with OOP.\nProven experience in\n NodeJS\n.\nStrong knowledge of database management systems like MySQL or PostgreSQL.\nGIT, Trello, Bitbucket knowledge is Preferred.\nProficient understanding of web technologies such as HTML, CSS, JavaScript, and AJAX.\nAbility to work effectively in a collaborative team environment.\nNice to Have:\nFamiliarity with front-end technologies (React, Vue.js, etc.).\nExperience with cloud services (AWS, etc.).\nUnderstanding of DevOps practices and tools."
  },
  {
    "title": "Senior PHP Developer (Laravel Expert)",
    "posted_date": "Posted8 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/7kFNdJb2kHYp-Senior-PHP-Developer-Laravel-Expert-Exceed-Cairo-Egypt",
    "experience": "More than 7 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Laravel, MySQL, PHP, API, Computer Science, Software Development, REST, Information Technology (IT), Engineering, SQL, Telecom Engineering, APIs, Development, Docker, Git, RESTful, Software Engineering",
    "description": "We’re looking for a highly experienced Senior PHP Developer with strong expertise in Laravel (version 8 and above) to join our team. The ideal candidate is passionate about building scalable backend systems, writing clean and maintainable code, and has a solid background in ERP systems development.\n \nResponsibilities:\n \nDevelop, maintain, and enhance web applications using Laravel and modern PHP practices.\nCollaborate with cross-functional teams to define, design, and ship new features.\nEnsure high performance, scalability, and security across all backend components.\nTroubleshoot, test, and maintain the core product software to ensure strong optimization and functionality.\nParticipate in code reviews and contribute to architectural decisions.\nProvide mentorship and technical guidance to junior developers when needed.",
    "requirements": "Minimum 7 years of professional experience in PHP development.\nProven hands-on experience with Laravel (version 8 or higher).\nStrong understanding of PHP 7+ features and best practices.\nExperience working on ERP systems is highly preferred.\nSolid understanding of RESTful APIs, relational databases (MySQL), and Git.\nFamiliarity with Docker and containerized development environments is a strong advantage.\nExcellent problem-solving skills and attention to detail.\nAbility to work both independently and in a team-oriented environment.\n \nNice to Have:\nExperience with microservices architecture.\nExposure to DevOps practices and CI/CD pipelines."
  },
  {
    "title": "Senior Automation QC Engineer",
    "posted_date": "Posted12 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/iIWX8NogYThI-Senior-Automation-QC-Engineer-BI-Technologies-Cairo-Egypt",
    "experience": "3 to 6 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential, Profit Share,Transportation,Medical Insurance, Social Insurance and Retirement Plan",
    "skills": "QC, Automation, Manualtesting, Information Technology (IT), Engineering, Telecommunication, Quality Control, Computer Engineering, Computer Science, Software Testing, SQL, Testing Techniques, CSTE, ISTQB, Testing, Quality, Software Development, Software Engineering, English, Java, Software, Science, test automation, Selenium",
    "description": "• Design, develop, and maintain automated test cases using scriptless automation tools. \n• Implement and enhance automation frameworks with model-based testing approaches. \n• Ensure automation test cases are scalable, reusable, and maintainable. \n• Work closely with developers, testers, and business analysts to understand requirements. \n• Identify automation opportunities and recommend suitable automation strategies. \n• Participate in sprint planning and Agile ceremonies to align automation efforts with development goals. \n• Execute automated test cases and analyze results to ensure test coverage and reliability. \n• Identify, document, and report defects, ensuring quick resolution. \n• Monitor test execution and optimize performance to reduce test cycle time. \n• Integrate automated test cases into CI/CD pipelines using tools like Jenkins, GitHub Actions, or Azure DevOps. \n• Ensure seamless execution of automated tests in DevOps workflows. \n• Maintain detailed test reports, logs, and documentation of automation test cases. \n• Provide insights and recommendations based on test execution reports. \n• Optimize test automation strategies to improve efficiency and reduce manual efforts.",
    "requirements": "BS: Computer Science OR Computer Engineering\n3-5 years of experience in testing software applications\nKnowledge of SQL Commends on SQL 2005 and SQL 2008\nISTQB Or CSTE Certified is Preferred\nVery Good command of the English language.\nStrong foundation in test automation using tools like Selenium, Appium, TestNG, Cucumber, Playwright or Cypress\nFamiliarity with scriptless or low-code automation tools is a plus."
  },
  {
    "title": "Technical Team Lead",
    "posted_date": "Posted12 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/MfKxNDuXRDnj-Technical-Team-Lead-ECC-Group-Cairo-Egypt",
    "experience": "5 to 7 years",
    "education": "Not Specified",
    "salary": "35000 to 45000 EGP Per Month",
    "skills": "Computer Science, Development, Engineering, Information Technology (IT), Java, JavaScript, Management, Programming, Software, Software Development, Software Engineering, Python",
    "description": "About the Role\nWe are looking for an experienced and driven \nTechnical Team Lead\n to oversee and elevate our software development team. You will lead end-to-end development projects, ensure technical excellence, and align technology strategies with our business objectives. If you're passionate about coding, leadership, and agile delivery, this is your chance to make a significant impact.\nKey Responsibilities\nLeadership & Team Management\nLead, mentor, and motivate a team of developers to achieve technical excellence and career growth.\nFoster a collaborative and innovative team culture.\nSet clear objectives, track team KPIs, and conduct performance reviews.\nProject Management & Delivery\nOversee project planning, execution, and on-time delivery.\nCollaborate with product owners and stakeholders to define requirements and priorities.\nEnsure agile methodologies (Scrum/Kanban) are effectively implemented.\nTechnical Oversight\nReview and maintain high-quality, scalable, and secure codebases.\nGuide architectural decisions and ensure system reliability.\nDrive continuous improvement through the adoption of new tools, frameworks, and best practices.\nCollaboration & Communication\nCoordinate with IT, QA, product, and business teams for seamless project integration.\nTranslate business requirements into technical solutions and align the team accordingly.",
    "requirements": "Qualifications\nMust-Have:\nBachelor's degree in Computer Science, Software Engineering, or a related field.\n5+ years of experience in software development, with at least 2 years in a leadership role.\nProficient in one or more programming languages: Python, Java, JavaScript, C#.\nExperience working in Agile environments and DevOps culture.\nExcellent communication and leadership skills.\nNice-to-Have:\nExperience with ERP systems such as Odoo, Microsoft Dynamics, or SAP.\nRelevant certifications: PMP, Scrum Master, or Agile-related.\nMicrosoft, Odoo, or SAP technical certification."
  },
  {
    "title": "Senior PHP Developer",
    "posted_date": "Posted23 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/wmXNlw1cBZys-Senior-PHP-Developer-POM100-Giza-Egypt",
    "experience": "8 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "PHP, Software Development, CSS, Git, HTML, Angular, Computer Science, Information Technology (IT), JavaScript, MySQL, Software Engineering, SQL",
    "description": "the Role:\nWe are looking for a \nSenior PHP Developer\n to design, develop, and maintain high-performance web applications. The ideal candidate has deep expertise in \nPHP frameworks\n (Laravel, Symfony, etc.), experience working with databases, and a strong understanding of backend architecture and API integrations.\nKey Responsibilities:\nDevelop, maintain, and enhance \nscalable PHP applications\n.\nDesign and implement \nRESTful APIs\n for seamless integrations.\nWork with \nMySQL, PostgreSQL, or MongoDB\n for database management and optimization.\nOptimize code for performance, security, and scalability.\nCollaborate with frontend developers on integrating UI with backend logic.\nTroubleshoot, debug, and resolve application issues.\nImplement and enforce \nbest practices in coding, security, and testing\n.\nStay updated with the latest PHP and web development trends.",
    "requirements": "8+ years\n of experience in PHP development.\nStrong expertise in \nLaravel, Symfony, or CodeIgniter\n.\nExperience with \nSQL databases (MySQL, PostgreSQL)\n and query optimization.\nProficiency in \nJavaScript, HTML, CSS\n, and familiarity with frontend frameworks (Vue.js, React, or Angular) is a plus.\nKnowledge of \nversion control systems (Git, GitHub, GitLab)\n.\nExperience working with \nDocker, Kubernetes, or cloud services (AWS, GCP, Azure)\n is a plus.\nStrong problem-solving and debugging skills.\nExcellent communication and teamwork abilities.\nPreferred Qualifications:\nExperience with \nMicroservices architecture and DevOps practices\n.\nFamiliarity with \nCI/CD pipelines\n for automated testing and deployment.\nPrevious experience in \nhigh-traffic, scalable applications\n.\nContributions to open-source projects or a strong GitHub profile."
  },
  {
    "title": ".Net developer",
    "posted_date": "Posted28 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/ZcHt0Nwf6iTc-Net-developer-Contact-Cairo-Egypt",
    "experience": "More than 3 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Computer Science, Information Technology (IT), .Net, Software Development, NET, developer, Agile, Angular, ASP.Net, Design, Engineering, Entity Framework",
    "description": "Develop and maintain \n.NET applications\n using:\nC#, ASP.NET Web Forms, .NET Core/5/6/7, Blazor, ASP.NET MVC\nDesign and implement \nmicroservices\n with:\nRESTful APIs, gRPC, event-driven communication (RabbitMQ, Kafka)\nApply \nClean Architecture\n principles for:\nLayer decoupling (Domain, Application, Infrastructure, Presentation) and testability\nUse \nMediatR\n to implement:\nCQRS (Command Query Responsibility Segregation) and mediator patterns\nIntegrate applications with \nOracle Database\n:\nPL/SQL, stored procedures, performance tuning\nMigrate \nlegacy Web Forms systems\n to modern architectures:\nMicroservices, .NET Core, Clean Architecture\nCollaborate with \nDevOps teams\n for microservices deployment:\nDocker, Kubernetes\nLead \ncode reviews\n, enforce \nSOLID principles\n, and advocate for \nDomain-Driven Design (DDD)\n.\nMentor \njunior developers\n and document \narchitectural decisions, patterns, and workflows\n.",
    "requirements": "Required Qualifications:\n3+ years of .NET development\n (C#, ASP.NET Web Forms, .NET Core).\nProficiency in \nOracle Database\n (schema design, query optimization, PL/SQL).\nExperience with \nmicroservices architecture\n (design, deployment, scaling) and \nAPI gateways\n (e.g., Ocelot).\nHands-on knowledge of \nClean Architecture\n and tools like \nMediatR\n for \nCQRS/mediator patterns\n.\nStrong understanding of \nRESTful APIs, SOA\n, and \nmodern frontend frameworks\n (Angular/React/Vue).\nFamiliarity with \nevent-driven systems\n, \nmessage brokers\n (RabbitMQ, Azure Service Bus), and \ncloud-native development\n.\nExperience with \nEntity Framework Core, Dapper\n, or other \nORM tools\n.\nProficiency in \nGit, Azure DevOps\n, and \nAgile methodologies\n.\nPreferred Skills:\nCertification\n in .NET, SQL Server, or Oracle DB.\nExperience with \nDomain-Driven Design (DDD)\n and \nTest-Driven Development (TDD)\n.\nKnowledge of \nAPI security\n (OAuth2, JWT) and \nmonitoring tools\n (Prometheus, Grafana).\nFamiliarity with \ngRPC or GraphQL\n for high-performance communication.\nExposure to \nCI/CD pipelines\n (Bitbucket Pipelines, Jenkins) and \ninfrastructure-as-code\n (Terraform).\n:\nBachelor’s degree\n in \nComputer Science, Engineering\n, or a related field (or equivalent experience)."
  },
  {
    "title": "Project Manager",
    "posted_date": "Posted25 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/k5J6Nv9uSEsY-Project-Manager-Royal-Cyber-Riyadh-Saudi-Arabia",
    "experience": "8 to 20 years",
    "education": "Not Specified",
    "salary": "18000 to 22000 SAR Per Month",
    "skills": "PMP, Project, Project Management, Agile, Project Manager, Stakeholders",
    "description": "Job Title: Project Manager - IT\nJob Summary:\nWe are seeking an experienced Project Manager with a strong technology background and expertise in managing IT projects in the BFSI (Banking, Financial Services, and Insurance) sector. The ideal candidate will have a proven track record of delivering complex IT projects on time, within budget, and to the required quality standards.\nKey Responsibilities:\n- Manage IT projects from initiation to delivery, ensuring timely, within-budget, and high-quality outcomes\n- Lead cross-functional teams, including IT, business stakeholders, and vendors\n- Develop and manage project plans, resource allocation, and budgets\n- Coordinate with stakeholders to gather requirements, define project scope, and ensure expectations are met\n- Identify, assess, and mitigate project risks, issues, and dependencies\n- Ensure compliance with organizational policies, procedures, and industry regulations (e.g., GDPR, PCI-DSS)\n- Manage vendor relationships, contracts, and performance\n- Conduct project status updates, progress reports, and retrospectives",
    "requirements": "Technical Requirements:\n- 8+ years of experience in IT project management, with BFSI sector -advantage\n- Strong technology background, including experience with BFSI systems, such as core banking, payments, and risk management\n- Experience with IT project management methodologies (e.g., Agile, Waterfall, Hybrid)\n- Strong understanding of IT service management frameworks (e.g., ITIL)\n- Experience with project management tools (e.g., MS Project, Asana, Trello)\n- Strong analytical, problem-solving, and communication skills\n Experience managing IT projects in the BFSI sector, including banking, financial services, and insurance\n- Knowledge of BFSI regulations, such as GDPR, PCI-DSS, and AML\n- Experience working with BFSI systems, such as core banking, payments, and risk management\nNice to Have:\n- Certification in project management (e.g., PMP, PRINCE2)\n- Experience with cloud computing platforms (e.g., AWS, Azure)\n- Knowledge of DevOps practices and tools (e.g., Jenkins, Docker)\n- Experience with cybersecurity frameworks and regulations (e.g., ISO 27001, PCI-DSS)\n- Bachelor's degree in Computer Science, Information Technology, or related field"
  },
  {
    "title": "Senior Laravel Developer – TALL Stack (Laravel • Livewire • Alpine JS • Tailwind CSS)",
    "posted_date": "Posted2 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/7kLRBLzhW5Sv-Senior-Laravel-Developer-–-TALL-Stack-Laravel-•-Livewire-•-Alpine-JS-•-Tailwind-CSS-Boca-Pro-Cairo-Egypt",
    "experience": "5 to 8 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "CSS, Computer Science, PHP, Software, SQL, TailwindCSS, AlpineJS, Livewire",
    "description": "About the role\nWe’re looking for a senior developer who thrives on building polished, reliable software using the TALL stack. You’ll lead projects, mentor teammates, and help craft experiences that look great and work even better.\nWhat will you’ll do\n• Architect and develop full-stack features with Laravel, Livewire, Tailwind, and Alpine\n• Work closely with design and product to deliver smooth, responsive UIs\n• Optimize performance across the stack—from SQL queries to frontend interactions\n• Guide junior developers through code reviews, pair programming, and mentorship\n• Write tests, document your work, and support long-term maintainability\n• Integrate third-party APIs, payment systems, and modern DevOps tools",
    "requirements": "What we’re looking for\n• 5+ years of experience with Laravel in production environments\n• Deep understanding of Livewire and Tailwind CSS\n• Experience building interactive UIs with Alpine JS\n• Strong SQL skills and familiarity with performance tuning\n• Comfortable writing unit and feature tests (PHPUnit or Pest)\n• Strong communication and decision-making skills\n• A sharp eye for detail—not just in code, but in UX, edge cases, and project requirements\nBonus if you have\n• Experience with Laravel Horizon, Octane, or event-driven architecture\n• Familiarity with Docker, AWS, Forge, or Vapor\n• Exposure to Vue, React, or Inertia\nHow we work\n• Remote-first with flexible schedules\n• Autonomy, clear expectations, and a strong feedback culture\n• Budget for learning, tools, and professional growth\nTo apply\nSubmit:\nA link to a TALL stack project you’re proud of\nA brief story about a technical challenge you solved\nYour GitHub or portfolio\nWe build software with care. If you value craftsmanship, clarity, and continuous improvement—we’d love to meet you."
  },
  {
    "title": "Senior Frontend Developer- Angular",
    "posted_date": "Posted27 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/vq4CC7d2XfuV-Senior-Frontend-Developer--Angular-Egabi-FSI-Cairo-Egypt",
    "experience": "4 to 7 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Computer Science, Information Technology (IT), javaScript, CSS, CSS3, Software Development, Angular2+, Angular, Sass, UI, Development, OOP, REST, APIs, SEO, front-end, HTML5",
    "description": "Demonstrated experience with JavaScript, HTML5, CSS3, and related technologies \nWorking knowledge and understanding of the following: RESTful web services, Javascript, jQuery, AJAX, JSON, HTML5, CSS3, Git, NPM \nExperience with Javascript MVC frameworks as Angular preferred. \nAbility to write complex programs, analyze code changes and make suggestions to improve code complexity for maintainability and scalability. \nAbility to reason logically and creatively, identify problems, draw valid conclusions from the data available, and develop effective solutions while applying creative thinking in the design and development of high-performing web applications \nKnowledge and demonstrated experience with cross-browser and cross-platform issues (IE, Firefox, Safari, etc.) \nGoal-oriented and self-motivated. \nCandidate must have the ability to work independently or within a team environment. \nStrong oral and written communications skills with the ability to create software design and engineering documents. \nThe ability to multi-task and deliver high-quality work under tight deadlines is essential. \nThe ability to work in a fast-paced environment is crucial. \nThe ability to learn, excel and deliver at a quick pace is required.",
    "requirements": "Requirements:\n4+ years of experience in the front-end development field.\nBachelor’s degree in Computer Science, Engineering, or a related subject.\nFinTech / Financial sector experience is preferable.\nTechnical Skills:\nExperienced Frontend Developer with knowledge in web framework-based development and internet technologies\nStrong knowledge of OOP, Design Patterns, Data Structure, Algorithms\nThe ideal candidate should have hands-on experience in the following: public-facing web application development using JavaScript and open source technologies, tools, and APIs Ex.: Typescript, HTML5, CSS3, SASS, Bootstrap, Angular, JavaScript, Git, Maven, DevOps, Jenkins, SonarQube. Additional web technologies experience is a plus.\nKnowledge of Git, Jira\nStrong knowledge of concepts and technology such as Responsive Design and mobile website development is a plus\nUnderstanding of package management tools (NPM)\nUnderstanding of UI rendering optimization, caching, and bundling.\nUnderstanding of performance optimization, security, and SEO\nExperience in designing and writing modular and reusable components.\nUnderstanding PWA is a plus\nFamiliarity with APIs, REST, and JSON\nFamiliarity with test-driven development is a plus\nWhat we are offering:\nCompetitive monthly salary.\nGreat Place to work located in Sheraton Heliopolis, Cairo.\nAwesome Team, we have the best team that is supportive, collaborative, professional and fun."
  },
  {
    "title": "Backend Developer",
    "posted_date": "Posted3 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/Ocl4a7ca6nEo-Backend-Developer-Monglish-Academy-Alexandria-Egypt",
    "experience": "2 to 5 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "back-end, Computer Science, Information Technology (IT), Engineering, Software",
    "description": "Design and build server-side applications and APIs\nIntegrate databases and data storage solutions\nEnsure security, scalability, and performance\nCollaborate with front-end and DevOps teams\nWrite clean, well-documented, and tested code",
    "requirements": "Bachelor’s degree in Computer Science, Software Engineering, or related\n2+ years of experience in back-end development\nProficiency in back-end languages (Node.js, Python, PHP, Java)\nExperience with databases (MySQL, MongoDB, PostgreSQL) and API standards"
  },
  {
    "title": "Back-end .NET Core Developer",
    "posted_date": "Posted4 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/3Yux0KDzJDIS-Back-end-NET-Core-Developer-Spark-Systems-Giza-Egypt",
    "experience": "More than 3 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": ".Net, .net core, ASP, ASP.Net, Information Technology (IT), Software Development, Computer Science, Software Engineering, CI/CD, Agile, API, AWS, backend, MVC, SQL",
    "description": "We are seeking a .Net Backend Developer to join our team at Spark Systems in Sheikh Zayed City Branch. In this role, you will be responsible for developing and maintaining our backend systems and services. Your primary focus will be on designing and implementing scalable, reliable, and secure software solutions to meet our business needs.\nWe offer more than just a job—we provide a supportive work environment, continuous development opportunities, and a clear path for career growth. At Spark Systems, you'll be part of a collaborative, experienced team that values innovation and strives for excellence.\nResponsibilities:\n- Design, develop, and maintain backend systems and services using .Net technologies.\n- Write clean, efficient, and maintainable code using best practices.\n- Collaborate with cross-functional teams, such as frontend developers, product managers, and QA engineers, to deliver high-quality software solutions.\n- Work with the DevOps team to ensure the scalability, availability, and security of our systems.\n- Implement automated tests and ensure the quality of the codebase.\n- Participate in code reviews and provide constructive feedback to other developers.\n- Stay up-to-date with emerging trends and technologies in software development and share knowledge with the team.\n- Assist in the planning and estimation of development tasks.\n- Provide technical guidance and support to other teams, such as customer support or sales, as needed.\nWhile the position follows standard working hours, there may be occasional requirements to be available outside these hours during critical project phases, such as approaching deadlines or product deliveries. We value work-life balance and strive to ensure such instances remain the exception, not the norm",
    "requirements": "- Bachelor's degree in Computer Science or a related field.\n- 3-5 years of experience as a .Net Backend Developer.\n- Strong experience with .Net Framework, C#, ASP.Net MVC, ASP.NET Core, and SQL Server.\n- Knowledge of RESTful web services and API development.\n- Familiarity with cloud computing platforms, such as Azure or AWS.\n- Experience with agile development methodologies, such as Scrum or Kanban.\n- Excellent problem-solving skills and ability to work independently and in a team environment.\n- Strong communication skills and knowledge to collaborate with cross-functional teams.\n- Ability to adapt to new technologies and learn quickly.\n- Attention to detail and strong work ethic."
  },
  {
    "title": "Instructors (Min 5 Years Exp.)",
    "posted_date": "Posted5 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/bSjZkXtHRnsF-Instructors-Min-5-Years-Exp-CLS-Learning-Solutions-Cairo-Egypt",
    "experience": "5 to 20 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Training, Teaching, Computer Engineering, Computer Science, Development, Education, Instructor, Science, Software, Software Development, Trainer",
    "description": "Ai, Software Development, Data Analysis, Graphics, Marketing Instructors \n(Min 5 Years Exp.) \nNeeded Urgently.\n \n(Available to work Full day training from 9 am to 5 pm in Cairo & Giza).\nEligibility Requirement: Candidates must have graduated on or before 2021. Applications from individuals who graduated after 2021 will not be considered.\n \nThe Required Fields:\n \n1- AI, Data Science, Machine Learning, Data Engineering, Big Data Instructors\n2- Web and Mobile Apps Development, NodeJS, React, Android, Flutter, UI-UX Instructors\n3- DevOps Instructors\n4- Data Analysis Power BI , Tableau, SQL Instructors\n5- Graphic and Motion, Photoshop, Illustrator, InDesign, Premiere, After effect Instructors\n6- Digital Marketing Instructors",
    "requirements": "Experience\n of \nmore than 5 years as a trainer in the Related Field \nBachelor’s degree\n in Computer Engineering or Computer Science for the Software Development Tracks \nFull Day Schedule from 9 AP to 5 PM \n( Must be available for Morning Schedule)\nCairo and Giza, Egypt."
  },
  {
    "title": "Mid - Senior Backend Developer (Node.js)",
    "posted_date": "Posted5 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/6PFVSQFM8zmR-Mid---Senior-Backend-Developer-Nodejs-TXG-Cairo-Egypt",
    "experience": "More than 3 years",
    "education": "Not Specified",
    "salary": "Confidential, Benefits and bonuses",
    "skills": "Git, TypeScript, API, PostgreSQL, Github, CI/CD, Node.js, Fastify, REST",
    "description": "As a Backend Developer at TXG, you’ll play a central role in building and maintaining the core logic and integrations behind our fintech platform. Your work will include:\nDesigning and maintaining \nrobust APIs\n to power both frontend interfaces and internal systems\nDeveloping backend features for \nuser-facing dashboards\n and our \ninternal back office\nManaging and optimizing \ndatabases and data models\n, ensuring efficiency and reliability\nIntegrating with \nthird-party services\n (e.g., payment providers, identity verification tools)\nEnsuring the \nsmooth operation and performance\n of our platform\nCollaborating closely with frontend, DevOps, and product teams to deliver secure, scalable features\nParticipating in \ncode reviews\n, testing, and continuous improvements of backend architecture\n \nWhat You’ll Get\nWe believe great work happens when people feel supported, valued, and respected — and we've designed our benefits around that principle:\nFlexible working hours\nMonthly home internet reimbursement\nPerformance recognition through perks and gifts\nAccess to online learning platforms\nOccasional food delivery credits via local apps\n \nWhy Join Us?\nAt \nTXG\n, we value people above all. We offer flexible working hours, remote options, and a strong respect for work-life balance - especially when it comes to family and religious commitments. You'll find an environment with real opportunities to grow, develop your skills, and advance your career. We foster a respectful, supportive team culture where achievements are recognized.",
    "requirements": "3+ years of \nbackend development\n experience with strong proficiency in \nNode.js\n and \nTypeScript\nDemonstrated experience with \nFastify\n (preferred) or \nExpress\n (with a willingness to transition to Fastify)\nSolid experience with \nRelational Databases\n, especially \nPostgreSQL\n, and ORMs like \nTypeORM\nHands-on experience with \nunit and end-to-end testing\n, preferably using \nJest\n or similar tools\nProven ability to work within \nmicroservice architectures\n, including:\nHandling \nsynchronous REST API calls\n between services\nManaging \nasynchronous communication\n via message brokers\nDesigning logic to support \nreplica services running in parallel\nCommitment to writing \nclean, maintainable, and well-documented code\nFamiliarity with \nGitHub\n and \nGitHub Actions\n for CI/CD and task automation\nStrong \nproblem-solving skills\n, attention to detail, and a collaborative mindset"
  },
  {
    "title": "Senior Backend Developer (Node.js)",
    "posted_date": "Posted6 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/Pgd275e5xhWb-Senior-Backend-Developer-Nodejs-TXG-Cairo-Egypt",
    "experience": "More than 3 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential, Benefits and bonuses",
    "skills": "API, backend, CI/CD, Github, PostgreSQL, REST, Fastify, Node.js, Typescript, Git, Computer Science, Development, Information Technology (IT), Software Development",
    "description": "Job Description\nAs a Backend Developer at TXG, you’ll play a central role in building and maintaining the core logic and integrations behind our fintech platform. Your work will include:\nDesigning and maintaining \nrobust APIs\n to power both frontend interfaces and internal systems\nDeveloping backend features for \nuser-facing dashboards\n and our \ninternal back office\nManaging and optimizing \ndatabases and data models\n, ensuring efficiency and reliability\nIntegrating with \nthird-party services\n (e.g., payment providers, identity verification tools)\nEnsuring the \nsmooth operation and performance\n of our platform\nCollaborating closely with frontend, DevOps, and product teams to deliver secure, scalable features\nParticipating in \ncode reviews\n, testing, and continuous improvements of backend architecture\n \nWhat You’ll Get\nWe believe great work happens when people feel supported, valued, and respected — and we've designed our benefits around that principle:\nFlexible working hours\nMonthly home internet reimbursement\nPerformance recognition through perks and gifts\nAccess to online learning platforms\nOccasional food delivery credits via local apps",
    "requirements": "Job Requirements\n3+ years of \nbackend development\n experience with strong proficiency in \nNode.js\n and \nTypeScript\nDemonstrated experience with \nFastify\n (preferred) or \nExpress\n (with a willingness to transition to Fastify)\nSolid experience with \nRelational Databases\n, especially \nPostgreSQL\n, and ORMs like \nTypeORM\nHands-on experience with \nunit and end-to-end testing\n, preferably using \nJest\n or similar tools\nProven ability to work within \nmicroservice architectures\n, including:\nHandling \nsynchronous REST API calls\n between services\nManaging \nasynchronous communication\n via message brokers\nDesigning logic to support \nreplica services running in parallel\nCommitment to writing \nclean, maintainable, and well-documented code\nFamiliarity with \nGitHub\n and \nGitHub Actions\n for CI/CD and task automation\nStrong \nproblem-solving skills\n, attention to detail, and a collaborative mindset"
  },
  {
    "title": "Senior Full Stack Developer",
    "posted_date": "Posted6 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/VyrqdO5xeyRk-Senior-Full-Stack-Developer-Ultimate-Solutions-Egypt-Giza-Egypt",
    "experience": "5 to 7 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Angular, API, Computer Science, Design, CSS3, Development, Docker, Git, HTML5, Information Technology (IT), JavaScript, Software Development",
    "description": "Ultimate Solutions is seeking a highly skilled Senior Full-Stack Developer to join our growing team. The successful candidate will be responsible for building end-to-end scalable web applications using .NET Core for backend and Angular for frontend development.\nThis is a full-time, on-site.\nResponsibilities:\n* Design, develop, and maintain backend services using .NET Core and RESTful APIs.\n* Develop responsive and dynamic frontend applications using Angular.\n* Integrate with relational databases such as PostgreSQL, optimize performance and ensure data consistency.\n* Collaborate with cross-functional teams including designers, DevOps, and QA to deliver robust solutions.\n* Participate in code reviews and ensure adherence to best practices and coding standards.\n* Assist in testing, debugging, and troubleshooting applications across the stack.",
    "requirements": "5+ years of hands-on experience in Full-Stack Development.\n* Proficiency in C#, .NET Core, Angular, TypeScript, HTML5, CSS3.\n* Strong experience with Entity Framework Core, LINQ, and PostgreSQL.\n* Solid understanding of RESTful API design, versioning, and integration.\n* Familiarity with Git, CI/CD pipelines, and containerization tools (e.g., Docker).\n* Excellent problem-solving and collaboration skills.\n* Ability to work independently and as part of a team."
  },
  {
    "title": "Backend Engineer",
    "posted_date": "Posted12 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/2jFOzvfpTK3u-Backend-Engineer-Devency-Cairo-Egypt",
    "experience": "5 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Software Development, Engineering, Typescript, Node.js, NoSQL, SQL, Software Engineering, backend, Information Technology (IT), MongoDB, MySQL, Agile",
    "description": "Devency is a premier software development and technology consulting firm based in Egypt. We specialize in delivering high-quality, scalable solutions tailored to our clients' needs. Our expertise spans custom software development, cloud solutions, and IT consulting, enabling businesses to thrive in the digital age. We pride ourselves on innovation, collaboration, and technical excellence.\n \nWe are looking for a \nBackend Engineer\n to join our team. This is a \nremote role\n, offering the opportunity to build scalable and high-performance backend systems using \nNode.js and TypeScript\n.\nAs a \nBackend Engineer\n, you will be responsible for \ndeveloping, optimizing, and maintaining backend services\n that power web and mobile applications. You will work extensively with \nGoogle Cloud Platform (GCP)\n to deploy, manage, and scale services, while ensuring data integrity and performance using \nboth SQL and NoSQL databases\n. Your role will also involve \ncollaborating with front-end engineers, DevOps teams, and other stakeholders\n to deliver seamless and efficient solutions.",
    "requirements": "Experience:\n 3+ years of experience developing backend applications using \nNode.js and TypeScript\n.\nCloud Expertise:\n Strong experience working with \nGoogle Cloud Platform (GCP)\n services such as Cloud Functions, Pub/Sub, and Firestore.\nDatabase Management:\n Comfortable working with \nboth SQL (e.g., PostgreSQL, MySQL) and NoSQL (e.g., MongoDB, Firestore) databases\n.\nScalability & Optimization:\n Understanding of \nAPI design, performance tuning, and best practices\n for scalable backend systems.\nProblem-Solving:\n Ability to troubleshoot and debug backend services efficiently.\nCollaboration:\n Experience working in agile teams and integrating with front-end applications.\nCommunication:\n Strong written and verbal communication skills in English."
  },
  {
    "title": "Full Stack Developer Needed",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/t37Ar65pfXjH-Full-Stack-Developer-Needed-Hestia-Dental-Cairo-Egypt",
    "experience": "Not Specified",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Software Development, Computer Science, AWS, Full Stack, CSS, JavaScript, React, SQL",
    "description": "We are seeking a highly skilled and motivated Full Stack Developer with strong expertise in JavaScript, Node.js, and React. You will be responsible for designing, developing, and maintaining scalable web applications that deliver exceptional user experiences.\nKey Responsibilities:\nDevelop and maintain front-end and back-end components of web applications.\nCollaborate with cross-functional teams to define, design, and implement new features.\nOptimize applications for maximum speed and scalability.\nWrite clean, maintainable, and efficient code.\nTroubleshoot and debug issues, ensuring a smooth user experience.\nStay up to date with emerging trends and technologies in software development.\nRequirements:\nProven experience as a Full Stack Developer.\nProficiency in JavaScript, Node.js, and React.js.\nStrong understanding of CSS, HTML5, and modern web development practices.\nExperience with RESTful APIs and third-party integrations.\nKnowledge of databases (SQL and NoSQL) and server-side logic.\nFamiliarity with version control tools such as Git.\nExcellent problem-solving skills and attention to detail.\nStrong communication and teamwork abilities.\nPreferred Qualifications:\nExperience with TypeScript, Next.js, or other frameworks.\nFamiliarity with cloud platforms (AWS, Azure, Google Cloud).\nUnderstanding of DevOps practices and CI/CD pipelines.",
    "requirements": "Requirements:\nProven experience as a Full Stack Developer.\nProficiency in JavaScript, Node.js, and React.js.\nStrong understanding of CSS, HTML5, and modern web development practices.\nExperience with RESTful APIs and third-party integrations.\nKnowledge of databases (SQL and NoSQL) and server-side logic.\nFamiliarity with version control tools such as Git.\nExcellent problem-solving skills and attention to detail.\nStrong communication and teamwork abilities.\nPreferred Qualifications:\nExperience with TypeScript, Next.js, or other frameworks.\nFamiliarity with cloud platforms (AWS, Azure, Google Cloud).\nUnderstanding of DevOps practices and CI/CD pipelines."
  },
  {
    "title": "Full Stack Developer",
    "posted_date": "Posted29 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/ifHc97bpQY9F-Full-Stack-Developer-Dwell-Egypt-Cairo-Egypt",
    "experience": "More than 3 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Real Estate, Computer Science, Information Technology (IT), Software, Java",
    "description": "Position Overview:\nWe are seeking a talented Full Stack Developer to join our technology and product development team. You will be instrumental in developing, implementing, and enhancing our CRM platform, AI-powered analytics tools, and other innovative technology solutions that drive our business success.\nResponsibilities:\nDevelop, maintain, and optimize Dwell’s CRM system, web applications, and technology platforms.\nCollaborate closely with our Vice President of Technology, product teams, and other stakeholders to understand business needs and translate them into technical solutions.\nIntegrate AI tools, analytics systems, and ERP platforms to streamline business operations.\nEnsure responsiveness, performance, and scalability of applications.\nContinuously enhance our tech stack and suggest improvements to ensure cutting-edge solutions.\nParticipate in code reviews, testing, debugging, and deployment activities.",
    "requirements": "Bachelor's degree in Computer Science, Software Engineering, or related fields.\n3+ years of proven experience as a Full Stack Developer.\nExpertise in front-end technologies such as React.js, Angular, or Vue.js.\nStrong proficiency in back-end technologies, including Node.js, Python, Java, or Ruby on Rails.\nHands-on experience with databases (SQL, MongoDB, PostgreSQL, etc.).\nFamiliarity with cloud platforms (AWS, Azure, Google Cloud).\nUnderstanding of CRM platforms, AI-driven solutions, and ERP integrations.\nStrong problem-solving skills and ability to work independently as well as collaboratively.\nPreferred Skills:\nExperience with real estate technology solutions.\nFamiliarity with DevOps practices and CI/CD pipelines.\nKnowledge of machine learning and data analytics integration."
  },
  {
    "title": "Executive Secretary - Management control",
    "posted_date": "Posted30 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/d2qydcYxND2T-Executive-Secretary---Management-control-Cairo-Egypt",
    "experience": "5 to 10 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Administration, Office management, Project Management, Communication skills, Operations, Secretary, Management, Projects",
    "description": "We are seeking a highly adaptable, motivated, and detail-oriented professional to serve as both a personal assistant and project manager to the CTO of a pharmaceutical company while also supporting a growing tech startup. This hybrid role combines executive-level assistance and project management responsibilities, designed to reduce the CTO’s workload and help manage strategic initiatives, daily operations, and project execution.\nIn this role, you will assist in organizing and executing various projects, from software development phases to team coordination and stakeholder management. You will also act as a key liaison between the CTO and internal/external teams and help structure and prioritize their creative ideas into actionable plans.\nThis is an ideal position for a young, energetic professional with a strong interest in tech, startups, and operations, who is eager to learn, grow, and eventually take on larger responsibilities.\nKey Responsibilities\n \n1. Executive Assistance & Operational Support\nAct as a right-hand assistant to the CTO, handling communication, task prioritization, and follow-ups.\nOrganize and synthesize the CTO’s creative ideas, translating them into structured, actionable plans.\nHandle scheduling, email filtering, and stakeholder coordination, ensuring smooth executive operations.\nTrack high-priority tasks and projects, ensuring they progress efficiently without micromanagement.\nSet up, moderate, and document key meetings, ensuring discussions are structured and action-oriented.\nPrepare reports, presentations, and documentation to keep all stakeholders aligned.\n \n2. Project Management Responsibilities\nManage and coordinate strategic projects, including product development and operational initiatives, across both the pharmaceutical company and the startup.\nWork closely with technical and non-technical teams, understanding development phases, deadlines, and deliverables.\nIdentify and mitigate risks, roadblocks, and inefficiencies before they impact progress.\nEnsure that teams are aligned, deadlines are met, and resources are allocated efficiently.\nProvide project documentation, status reports, and summaries for key stakeholders.\n \n3. Communication & Leadership\nServe as a primary liaison between the CTO and internal/external stakeholders.\nEnsure clear, professional communication across departments and with external partners.\nConfidently manage high-pressure situations and adapt quickly to shifting priorities.\nWhatsApp : zero one two seven two two four seven seven seven one.",
    "requirements": "Must-Have Skills &Experience \nFluent in English (both written and spoken) at a near-native or native level.\n \nExperience  in project management, operations, executive assistance, or related roles (preferably in startups, tech, or dynamic environments).\n \nStrong \norganizational skills\n—able to prioritize, structure, and manage multiple tasks and projects simultaneously.\n \nExperience preparing \nprofessional reports, presentations, and project documentation\n.\n \nStrong \nexecutive-level communication skills\n, both written and verbal.\n \nExperience with \nproject management tools\n (Jira, Asana, Notion, Monday.com, Trello, ClickUp, etc.).\n \nConfident and assertive personality—able to handle a highly creative executive without being overwhelmed.\n \nTechnical Background & Software Development Familiarity (Preferred, Not Required)\nWhile coding skills are not required, you should be comfortable enough with software development concepts to communicate effectively with technical teams and the CTO. This includes:\nUnderstanding major software concepts\n (e.g., APIs, databases, cloud infrastructure, front-end vs. back-end).\n \nFamiliarity with software development workflows\n, including Agile/Scrum, version control (Git), CI/CD, and DevOps practices.\n \nAbility to reference and discuss code or technical implementations\n at a high level without needing in-depth explanations.\n \nComfortable translating technical discussions into actionable items\n for non-technical stakeholders.\nPreferred (Nice-to-Have)\nExperience working closely with C-level executives or founders.\n \nUnderstanding of Agile, Scrum, or other project management methodologies.\n \nExperience handling operations, logistics, or strategic execution at a startup.\n \nEagerness to learn and grow into a more senior role over time."
  },
  {
    "title": "Full-Stack Developer (Front-End & Back-End)",
    "posted_date": "Posted30 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/sK2oTPBvLlg6-Full-Stack-Developer-Front-End-Back-End-MIBA-LLC-Cairo-Egypt",
    "experience": "4 to 5 years",
    "education": "Bachelor's Degree",
    "salary": "20000 to 30250 EGP Per Month",
    "skills": "c++, CSS, HTML, MongoDB, Python, Node.js, JavaScript, React, AngularJS, MySQL, PostgreSQL, Rust, Angular, Computer Science, Engineering, Git, Information Technology (IT), Software Development, Software Engineering",
    "description": "Job Description:\nWe are seeking a talented \nFull-Stack Developer\n to join our team and contribute to the development of a cutting-edge software platform. This is a \nremote position\n, offering the flexibility to work from anywhere while collaborating with a dynamic and innovative team.\nResponsibilities:\nDesign, develop, and maintain both the front-end and back-end components of our platform.\nCreate intuitive, user-friendly interfaces and robust back-end architectures.\nCollaborate with the team to implement new features and improve existing ones.\nEnsure code quality through testing, debugging, and adherence to best practices.\nIntegrate third-party APIs and services into the platform.\nOptimize system performance and scalability.\nParticipate in code reviews and provide constructive feedback.\nStay updated with the latest trends and technologies in web development.\n \n \nWhat We Offer:\nRemote work\n flexibility—work from anywhere while collaborating with a supportive team.\nOpportunity to work on innovative software solutions in a dynamic field.\nCompetitive compensation based on experience and expertise.",
    "requirements": "Requirements:\nProven experience as a Full-Stack Developer with strong proficiency in \nfront-end technologies\n (e.g., HTML, CSS, JavaScript, React, Angular, or Vue.js) and \nback-end technologies\n (e.g., C++, Python, CMake, Rust, Node.js, or similar).\nExperience with relational and/or non-relational databases (e.g., MySQL, PostgreSQL, MongoDB).\nFamiliarity with version control systems like Git.\nStrong problem-solving skills and attention to detail.\nAbility to work collaboratively in a remote team environment and communicate effectively.\nPreferred Qualifications:\nBachelor’s degree in Computer Science, Software Engineering, or a related field.\nExperience with cloud services (e.g., AWS, Azure, or Google Cloud).\nKnowledge of DevOps practices, CI/CD pipelines, and containerization (e.g., Docker, Kubernetes)."
  },
  {
    "title": "Senior .Net Developer",
    "posted_date": "Posted17 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/9crFgABAsKNz-Senior-Net-Developer-Akvelon-Bellevue-United-States",
    "experience": "4 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Azure, .Net, English, Communication skills, Computer Science, Development, Information Technology (IT), Mssql, Programming, Software, Software Development, Software Engineering, Troubleshooting",
    "description": "We are looking for a motivated \nMiddle/Senior C# (Remote) for future positions.\n \nOur client is a multinational technology company renowned for its cutting-edge software, hardware, and services.\n \nKey Responsibilities:\n- Write and test C# code;\n- Collaborate with the team to solve coding challenges and complete project tasks;\n- Work with SQL databases to create and optimize queries;\n- Explore DevOps practices and tools to improve the development workflow.",
    "requirements": "Requirements:\n- 4 years of experience in commercial software development;\n- Problem-solving skills and troubleshooting skills;\n- Proficient in C# programming language and .Net Framework;\n- Knowledge of Cloud Computing principles and practices (Azure);\n- Excellent written and verbal communication skills in English;\n- Experience with MSSQL;\n \nNice to have:\n- Experience with Azure Pipelines;\n- Experience with CosmosDB;\n- Experience with Kusto;\n \nWorking Conditions:\n- Full CET overlap;\n- B2B contract with paid vacation, sick leave, and public holidays;\n- Supportive learning environment with mentorship from experienced developers;\n- We have offices in Egypt, Kazakhstan, Georgia and Armenia strategically located, technically well-equipped, and ready for your work."
  },
  {
    "title": "Junior Backend Developer .Net",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/rHEvBsyikAki-Junior-Backend-Developer-Net-Exco-Egypt-Cairo-Egypt",
    "experience": "1 to 2 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "ASP.Net, .Net, C#, Computer Science, Information Technology (IT), Engineering, Programming, Software Development, Software Engineering, Web Development",
    "description": "Job overview\nWe are seeking a talented and motivated \n.NET Developer\n to join our growing development team. In this role, you will design, develop, and maintain high-quality, scalable applications using the \n.NET platform\n (primarily \n.NET Core\n and \nC#\n). You will work closely with cross-functional teams to deliver innovative software solutions and contribute to the development of cutting-edge applications.\n \nKey Responsibilities\nApplication Development\n: Design, build, and maintain efficient, reusable, and reliable C# code for web, mobile, or desktop applications using the \n.NET framework\n.\nAPI Development\n: Build and consume \nRESTful APIs\n or \nWeb APIs\n using \nASP.NET Core\n.\nDatabase Integration\n: Develop and maintain database systems (SQL Server, MySQL, PostgreSQL, etc.), including designing schemas, writing queries, and optimizing performance.\nCollaboration\n: Work closely with business analysts, project managers, and front-end developers to define and implement application features. Participate in design and code reviews to ensure best practices and maintainability.\nDeployment & CI/CD\n: Contribute to continuous integration/continuous deployment (CI/CD) pipelines and help deploy applications to cloud environments (Azure, AWS, etc.).\nDocumentation\n: Produce technical documentation to ensure maintainability and scalability of software applications",
    "requirements": "Job Requirements\nQualification\nProficiency in C#\n: Solid experience with \nC#\n and object-oriented programming principles.\n.NET Framework/.NET Core\n: Strong experience with \n.NET Core\n and familiarity with the \n.NET Framework\n for building web, desktop, and cloud-based applications.\nWeb Development\n: Experience with \nASP.NET Core\n for web applications, \nMVC\n, and \nWeb API\n development.\nDatabase Experience\n: Experience working with relational databases (e.g., \nSQL Server\n, \nPostgreSQL\n, \nMySQL\n) and proficiency in writing SQL queries.\nVersion Control\n: Familiarity with version control systems such as \nGit\n and experience in managing code repositories.\nCloud Experience\n (optional): Experience with \nAzure\n or other cloud platforms for hosting applications and services.\nProblem-Solving\n: Strong troubleshooting skills with the ability to debug and resolve complex technical issues.\nTeam Player\n: Ability to collaborate effectively with cross-functional teams and work in an Agile environment.\nBachelor’s degree in Computer Science, Software Engineering, or a related field (or equivalent work experience).\n1-2 years of experience as a .NET Developer or in a similar role.\nPreferred Skills\nExperience with \nMicroservices\n architecture.\nFamiliarity with \nDevOps\n practices and tools.\nFamiliarity with \nmessage queues\n (e.g., \nAzure Service Bus\n, \nRabbitMQ\n).\nKnowledge of \ncontainerization\n using \nDocker\n and orchestration tools like \nKubernetes\n."
  },
  {
    "title": "Embedded C Developer with Zephyr RTOS Experience",
    "posted_date": "Posted21 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/CSvqnvDlnTwA-Embedded-C-Developer-with-Zephyr-RTOS-Experience-LMesh-Schiedam-Netherlands",
    "experience": "4 to 10 years",
    "education": "Not Specified",
    "salary": "500 to 2000 EUR Per Month",
    "skills": "Embedded C, Zephyr RTOS, CMake, Unit Testing, Mqtt and Ble communications, IOT, LoRa, RF Communication",
    "description": "Embedded Software Engineer at LMesh\nLMesh is at the forefront of IoT innovations, delivering smart solutions across sectors including agriculture, automotive, infrastructure, and research organizations throughout Europe. We're expanding our talented team and seeking an experienced Embedded Software Engineer passionate about developing cutting-edge IoT technologies.\nKey Responsibilities:\nEmbedded Software Development:\n Design, implement, and maintain robust and efficient embedded software in C within a Zephyr RTOS environment.\nSensor Driver Development:\n Develop, optimize, and integrate low-level drivers for a variety of sensors and peripherals used in IoT applications.\nRF Communication Development:\n Implement and optimize IoT-focused communication protocols, such as Bluetooth and GSM, ensuring reliable RF connectivity.\nCMake Build System:\n Manage and configure projects using CMake to ensure scalability, maintainability, and streamlined build processes.\nCode Review & Quality Assurance:\n Conduct meticulous code reviews ensuring high-quality, efficient code aligned with industry best practices.\nUnit & Integration Testing:\n Create and execute thorough unit and integration tests, maintaining comprehensive test coverage for all embedded solutions.\nSystem Integration:\n Work closely with hardware engineers to ensure seamless integration of software and hardware components.\nTroubleshooting & Debugging:\n Effectively diagnose and resolve technical issues within embedded systems across various sensor interfaces and communication protocols.\nTechnical Documentation:\n Develop clear, detailed documentation for codebases, system designs, and operational procedures to facilitate knowledge sharing.\nRequired Qualifications:\nSolid experience in embedded software development using \nZephyr RTOS\n.\nStrong proficiency in \nEmbedded C\n programming.\nProven expertise with \nCMake build systems\n in embedded environments.\nDemonstrable experience in creating robust \nUnit and Integration Testing\n frameworks.\nHands-on experience implementing \nRF communication protocols\n (Bluetooth, GSM) in IoT contexts.\nProven track record of developing and integrating \nsensor drivers\n for embedded systems.\nExperience in conducting thorough \ncode reviews\n, emphasizing adherence to coding standards and best practices.\nPreferred Skills:\nFamiliarity with additional IoT communication protocols (LoRa, Wi-Fi, Zigbee).\nExpertise in low-power design techniques and energy-efficient optimization for embedded systems.\nExperience with Continuous Integration (CI) and DevOps methodologies tailored to embedded software.\nProficient debugging skills using tools such as GDB, JTAG, or similar platforms.\nSoft Skills:\nExceptional problem-solving abilities with an independent yet collaborative working style.\nStrong communication and documentation skills, with the capability to articulate technical details clearly to diverse audiences.\nAdaptability, proactive learning approach, and openness to embracing new technological advancements.\nEducation:\nBachelor's degree in Computer Science, Electrical Engineering, or a related field.\nRelevant certifications or specialized experience in embedded systems are advantageous.",
    "requirements": "Solid experience in embedded software development using \nZephyr RTOS\n.\nStrong proficiency in \nEmbedded C\n programming.\nProven expertise with \nCMake build systems\n in embedded environments.\nDemonstrable experience in creating robust \nUnit and Integration Testing\n frameworks.\nHands-on experience implementing \nRF communication protocols\n (Bluetooth, GSM) in IoT contexts.\nProven track record of developing and integrating \nsensor drivers\n for embedded systems.\nExperience in conducting thorough \ncode reviews\n, emphasizing adherence to coding standards and best practices."
  },
  {
    "title": "Full Stack Developer (Laravel, Node.js, Express, MySQL, React)",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/haXmIQSz9yKX-Full-Stack-Developer-Laravel-Nodejs-Express-MySQL-React-Cairo-Egypt",
    "experience": "5 to 10 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Engineering, Information Technology (IT), PHP, MySQL, Software Development, Laravel, JavaScript, Git, Computer Science, Software Engineering, Software, React",
    "description": "## **Key Responsibilities:**\n- Design and develop robust, scalable, and secure web applications.\n- Build and maintain RESTful APIs using Laravel (PHP) and Node.js with Express.\n- Develop and maintain front-end applications using React, ensuring seamless user experience.\n- Optimize database queries and design efficient data structures in MySQL.\n- Implement authentication, authorization, and security best practices across applications.\n- Ensure cross-browser and cross-platform compatibility for applications.\n- Write clean, maintainable, and well-documented code.\n- Perform code reviews, mentor junior developers, and enforce best development practices.\n- Troubleshoot, debug, and optimize existing applications for performance improvements.\n- Collaborate with DevOps to deploy, scale, and manage applications efficiently.\n- Stay up to date with the latest technologies and industry trends.",
    "requirements": "Key Responsibilities:\n- Design and develop robust, scalable, and secure web applications.\n- Build and maintain RESTful APIs using Laravel (PHP) and Node.js with Express.\n- Develop and maintain front-end applications using React, ensuring seamless user experience.\n- Optimize database queries and design efficient data structures in MySQL.\n- Implement authentication, authorization, and security best practices across applications.\n- Ensure cross-browser and cross-platform compatibility for applications.\n- Write clean, maintainable, and well-documented code.\n- Perform code reviews, mentor junior developers, and enforce best development practices.\n- Troubleshoot, debug, and optimize existing applications for performance improvements.\n- Collaborate with DevOps to deploy, scale, and manage applications efficiently.\n- Stay up to date with the latest technologies and industry trends.\n \nRequired Qualifications\n- Bachelor’s or Master’s degree in Computer Science, Software Engineering, or a related field.\n- 5+ years of experience** in full-stack development.\n- Strong expertise in Laravel (PHP)** for building and maintaining backend services.\n- Proficiency in Node.js and Express** for server-side development and API creation.\n- Advanced knowledge of React and its ecosystem (Redux, Hooks, Context API, etc.).\n- Deep understanding of MySQL, including database design, optimization, and indexing.\n- Hands-on experience with RESTful API design and development.\n- Familiarity with authentication mechanisms (OAuth, JWT, Passport, Sanctum, etc.).\n- Experience with cloud platforms (AWS, Google Cloud, or Azure) and deployment pipelines.\n- Proficiency in working with Docker and containerized applications.\n- Strong problem-solving and debugging skills.\n- Excellent written and verbal communication skills.\n \nPreferred Qualifications\n- Experience with GraphQL APIs and WebSockets.\n- Familiarity with CI/CD pipelines and version control systems (Git, GitHub/GitLab/Bitbucket).\n- Knowledge of microservices architecture and serverless computing.\n- Experience with message brokers like RabbitMQ or Kafka.\n- Knowledge of caching strategies using Redis or Memcached.\n- Understanding of testing frameworks (Jest, Mocha, PHPUnit, etc.).\n- Contributions to open-source projects or personal GitHub repositories showcasing relevant work."
  },
  {
    "title": "Senior Backend Developer PHP / Laravel",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/ZQWLxibKimOt-Senior-Backend-Developer-PHP-Laravel-Sulfah-Cairo-Egypt",
    "experience": "5 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Computer Engineering, Computer Science, Information Technology (IT), Software, Software Development, Linux, PHP, Jenkins",
    "description": "We are looking for a Senior Backend Developer to be part of a team responsible for the development of our products backend, you should be comfortable around both front-end and back-end coding languages, PHP development frameworks specially Laravel and third-party libraries. You should also be a team player with a strong problem-solving ability\nResponsibilities\nWrite PHP Backend Code using Laravel framework with best practices\nDesign client-side and server-side architecture\nDevelop and manage well-functioning databases and applications\nWrite effective APIs using best practices\nTest software to ensure responsiveness and efficiency\nTroubleshoot, debug and upgrade software\nCreate security and data protection settings\nBuild features and applications with a mobile responsive design\nRefactor Legacy code and apply modern software Architectures\nWrite technical documentation",
    "requirements": "Bachelor Degree in computer sciences/ computer engineering or equivalent.\n5-10 years of experience in software configuration management.\nStrong knowledge in SDLC Management. Experience with version control tools (DevOps, GIT, ...) from Management and administration point of view.\nGood knowledge in DevOps, CI/CD methodologies and tools (Jenkins, DevOps pipelines, Docker, Containers).\nKnowledge with the various application Servers, ex. Apache, NGINX.\nKnowledge in SharePoint administration. Knowledge in Scripting languages, ex. PowerShell, Bash.\nStrong knowledge in release management process and regulations.\nStrong skills in troubleshooting deployments and configuration issues.\nFamiliar with various operating systems (Windows, Linux and MacOS)."
  },
  {
    "title": "Software Developer \"Outsourced\"",
    "posted_date": "Posted26 daysago",
    "job_url": "https://wuzzuf.net/jobs/p/ck0EPBdEI3dm-Software-Developer-Outsourced-Efada-Technology-Giza-Egypt",
    "experience": "2 to 5 years",
    "education": "Not Specified",
    "salary": "15000 to 28000 EGP Per Month",
    "skills": "Computer Science, Information Technology (IT), Java, Design, Software Development, Spring, RabbitMQ, Software Engineering, RESTful APIs, Spring Boot, Python, SQL",
    "description": "Outsourcing job vacancy, contracted with EFADA technology, work site at the customer's side in smart village\nKey role:\nCreating and maintaining  the entire backend of the application.\nDesign and developing application using robust APIs \nManage and Optimize scalable distributed systems\nDevelop Automated tests to ensure business needs are met and allow regression testing \nProduce quality code to meet the Vodafone standards and follow all devops workflows \nSupport Operations team by investigations when meeting any production issue",
    "requirements": "Java Core\nPython\nJava Spring Boot\nRESTful APIs\nSql Database\nData Structure \nDesign Patterns\nAlgorithms \nProblem Solving\nOracle Database\nPerformance tuning\nRESTful APIs\nKafka / RabbitMQ"
  },
  {
    "title": "Senior Flutter Developer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/sjnE6vJKYQbL-Senior-Flutter-Developer-Dash-Code-Cairo-Egypt",
    "experience": "More than 3 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Flutter, Dart, Android, iOS, UI, UX, Information Technology (IT), Computer Science, Animations, Debugging, Firebase, Optimization, OOP, APIs, RESTful APIs, Software Development",
    "description": "We are looking for a \nSenior Flutter Developer\n to join our team and contribute to the development of high-performance mobile applications for both iOS and Android. The ideal candidate will be responsible for designing, developing, and maintaining Flutter applications while collaborating closely with design and development teams to ensure a seamless user experience.\n \nResponsibilities:\nDevelop and maintain high-performance, responsive Flutter applications for multiple devices.\nWrite clean, reusable, and efficient code following best practices.\nOptimize application performance and ensure stability by testing and debugging.\nWork closely with UI/UX designers to implement accurate designs.\nIntegrate applications with APIs and web services.\nUse version control systems (such as Git) to manage code effectively.\nProvide creative solutions to technical challenges and enhance user experience.\nStay up to date with the latest Flutter trends and cross-platform development techniques.",
    "requirements": "3+ years\n of hands-on experience in mobile app development.\nAt least \n3 years\n of experience working with Flutter and Dart.\nStrong understanding of Object-Oriented Programming (OOP) and asynchronous programming.\nExperience with \nState Management\n solutions such as Provider, Riverpod, Bloc, or GetX.\nProficiency in working with \nRESTful APIs\n and \nGraphQL\n.\nDeep understanding of the mobile app lifecycle for both iOS and Android.\nExperience integrating analytics and error-tracking tools like Firebase and Sentry.\nStrong problem-solving skills and ability to work collaboratively in a team.\nFamiliarity with DevOps concepts and CI/CD tools is a plus."
  },
  {
    "title": "Full Stack Developer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/5rqBgjyUAilb-Full-Stack-Developer-TryAladdin-Cairo-Egypt",
    "experience": "2 to 20 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "JavaScript, MySQL, CSS, Angular, Software Development, Full Stack, Git, HTML, Shopify",
    "description": "We are seeking a highly skilled and results-driven Full Stack Engineer to join our team. In this role, you will be responsible for the design, development, and implementation of both front-end and back-end web applications. You will collaborate with designers, other developers and product managers to ensure that all parts of our applications function smoothly. You should be proficient in multiple programming languages, frameworks, and technologies, enabling you to handle the entire development lifecycle.",
    "requirements": "Build and maintain both the front-end and back-end of web applications, ensuring scalability, security, and optimal performance.\nFollow best practices for coding, testing, and deployment, ensuring high-quality code and adherence to deadlines.\nWork closely with designers, front-end developers, and marketing team to design and implement user-centric applications.\nDesign and manage databases and ensure data integrity, scalability, and performance.\nWrite and execute unit tests, conduct integration tests, and troubleshoot issues across all layers of the application.\nDeploy applications to production environments and setting up continuous integration and continuous delivery (CI/CD) pipelines.\nUse analytics and logging to monitor application performance and implement performance optimization where needed.\nContinuously learn about new web technologies, frameworks, and tools to enhance the product and your skill set.\nSkills and Qualifications:\nProven Experience: Minimum of 3 years of experience as a Full Stack Engineer or a similar role.\nTechnical Expertise:\nStrong proficiency in front-end languages (HTML, CSS, JavaScript) and frameworks (React, Angular, Vue.js).\nProficient in back-end technologies (Node.js, Java, Python, Ruby, PHP, etc.).\nExperience with databases (MySQL, MongoDB, PostgreSQL, etc.).\nKnowledge of version control systems like Git.\nFamiliarity with cloud platforms (AWS, Azure, Google Cloud) and serverless architectures is a plus.\nFamiliar with DevOps practices and CI/CD tools (Jenkins, GitLab CI, CircleCI).\nExcellent analytical and troubleshooting skills to resolve complex application issues.\nStrong ability to work effectively in a team environment and communicate complex ideas clearly.\nExperience working in an Agile/Scrum development environment.\nEducation and Preferred Qualifications:\nBachelor's degree in Computer Science, Engineering, or related field, or equivalent work experience.\nExperience with modern front-end build tools and workflows (Webpack, Babel, etc.).\nKnowledge of security best practices and techniques for secure application development.\nKnowledge of SEO and Conversion Funnel Optimization is an asset \nWorking hours \n– Monday to Friday from 12 pm to 8:30 pm PST time (including 30 minutes of lunch break)"
  },
  {
    "title": "Senior Cloud administrator",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/0DdCbFyyitmh-Senior-Cloud-administrator-Seoudi-Supermarket-Giza-Egypt",
    "experience": "5 to 7 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Business Administration, Computer Science, Engineering, Information Technology (IT), Management, MCSA, MCSE, Software, Design, Cloud, Azure, AWS",
    "description": "The Sr. Cloud administrator’s role is to ensure the stability, integrity, and efficient operation of the in-house information systems that support core organizational functions. This is achieved by monitoring, maintaining, supporting, and optimizing all software and associated operating systems. The Sr. Cloud administrator will apply proven communication, analytical, and problem-solving skills to help identify, communicate, and resolve issues to maximize the benefit of IT systems investments. This individual will also mentor and guide the Systems Engineer staff.\nResponsibilities\nDesign, develop, and deploy modular cloud-based systems\nDevelop and maintain cloud solutions following best practices\nEnsure efficient functioning of data storage and process functions following company security policies and best practices in cloud security\nManaging Dell Azure, AWS and Google Cloud infrastructure \nAdministration and monitoring Backup solution.\nAdvanced knowledge of operating system fundamentals for Microsoft Windows and Linux, networking, and security\nExtensive experience with scripting and automation.\nIdentify, analyze, and resolve infrastructure vulnerabilities and application deployment issues\nAdministration troubleshooting and deployment of Windows Server 2008 R2, 2012, 2012 R2, 2016, 2019, and 2022 Active Directory environments.\nAdministrate AD Sites, Organizational Unit (OU), Users and Groups, and Group Policy management.\nAdministrate, implement, and configure and troubleshoot Active Directory, AD Connect, , Microsoft Azure features, AWS infrastructure and Google cloud infrastructure.\nManaging and troubleshooting in Microsoft 365: Security, Compliance, Teams, SharePoint, Exchange Online \nAdministrate Azure AD, Azure ATP, Conditional Access \nVirtualization technologies: VMware vSphere, vCenter and Hyper-V\nParticipate in the administration and maintenance of the remote monitoring and management system: update agents, and scripts, respond to alerts, monitor the dashboard, and periodic system review.\nDocument maintenance for all system infrastructure\nRemote monitoring and management of system alerts and notifications\nCommunication with clients as required: keeping them informed of incident progress, notifying them of impending changes or agreed outages.\nPerform system monitoring, verify the integrity and availability of all hardware, server resources, systems and key processes, review system and application logs, and verify completion of scheduled jobs such as backups.\nContinual maintenance of security, including backup and redundancy strategies\nConsistently provide 2nd level support\nCommunication as a liaison with vendors and other IT personnel to resolve issues\nAdministrate external Domains and DNS \nUnderstanding DevOps and CI/CD - Experience with DevOps methods and CI/CD pipelines",
    "requirements": "The Sr. Cloud administrator will have a bachelor’s degree and 5 to 7 years of Sr. Cloud administrator experience.\nHaving the certificates Microsoft MCSA, MCSE,AZ700 and Az800  is preferred\nHands on experience on Microsoft Azure,AWS and Microsoft 365\nProven experience in overseeing the design, development, and implementation of software systems, applications, and related products. \nProven experience with systems planning, security principles, and general software management best practices. \nExcellent understanding of the organization’s goals and objectives. \nAzure, AWS, and GCP certifications preferred\nTroubleshooting and analytical skills\nStrong communication and collaboration skills"
  },
  {
    "title": ".Net Core and Angular Developer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/dNVXUwBpUOJF-Net-Core-and-Angular-Developer-Cairo-Egypt",
    "experience": "5 to 15 years",
    "education": "Bachelor's Degree",
    "salary": "35000 to 80000 EGP Per Month, - Monthly & Annualy awarding.\n- Salary Insurance\n- USD salary for top seniors",
    "skills": "Agile, Computer Science, core, Angular, CSS, Github, Microservices, Information Technology (IT), JavaScript, Software Development",
    "description": "Job Description: Full-Stack .NET Core & Angular Developer\nWe are looking for a \nhighly skilled Full-Stack .NET Core & Angular Developer\n to join our team and work on an \nexisting project\n. The ideal candidate is experienced in building scalable, high-performance applications using \n.NET Core 8+ and Angular\n, follows clean architecture principles, and leverages \nAI-powered tools\n to enhance development speed and code quality.\nWhy Join Us?\nWork on a challenging and innovative project\n where your technical decisions shape the future.\nCutting-edge AI-powered tools\n to speed up development and improve code quality.\nAutonomy & ownership\n—your ideas matter, and you help drive technical excellence.\nContinuous learning\n—access to certifications, courses, and conferences.\nFlat hierarchy, flexible work environment, and competitive perks.\nWe value clean, maintainable, and scalable code. \nCode reviews, knowledge-sharing sessions, and best practices are part of our daily routine\n.\nWe encourage innovation—\nyour ideas will directly influence technical decisions and architectural improvements.\nYou’ll have access to modern DevOps pipelines, \ncloud platforms, and automation tools to optimize workflows.\nWe leverage AI-powered tools for development, \nautomated testing, and code quality analysis to speed up development without compromising quality.\nRequirements:\n✅ 5+ years of \n.NET Core, Entity Framework, MSSQL, CQRS, and Clean Architecture\n experience.\n✅ Strong \nAngular, TypeScript, JavaScript, HTML, CSS, and Razor\n skills.\n✅ Experience working with \ndynamic forms and workflow automation\n.\n✅ Familiarity with \nAI-assisted development, automation tools, and DevOps pipelines\n.\n✅ Worked on \nmedium to large-scale projects\n with a focus on performance and scalability.\n✅ Passion for \nclean, maintainable, and well-documented code\n.",
    "requirements": "Key Requirements:\nBackend:\n Excellent experience with \n.NET Core 8+, OOP, CQRS, Clean Architecture, EF Core, MSSQL, APIs\nFrontend:\n Strong expertise in \nAngular, TypeScript, JavaScript, HTML, CSS, Razor\nExperience with \ndynamic forms and workflow systems\nAbility to write \nclean, maintainable, and well-documented code\nFamiliarity with \nAI-powered development tools\n for productivity and code quality enhancement\nExperience working on \nmedium to large-scale projects\nEagerness to \nlearn new technologies and improve existing processes\n \nKey Responsibilities:\nArchitect, develop, and optimize \nscalable full-stack applications\n using \n.NET Core 8+ and Angular\n.\nImprove \ncode quality, testability, and performance\n using best practices and AI-powered code analysis tools.\nDesign and implement \ndynamic forms, workflow automation, and data-driven features\n.\nCollaborate with product managers and engineering teams to \ndefine technical strategies\n and system improvements.\n• Mentor and provide technical guidance to junior developers."
  },
  {
    "title": "Senior Backend Developer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/h6lWdf8URAyO-Senior-Backend-Developer -EZeats-Cairo-Egypt",
    "experience": "3 to 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "backend, Computer Science, Information Technology (IT), Software Development, Engineering, Development, AWS, Node.js, Software Engineering, Docker, Jenkins, JavaScript, Typescript",
    "description": "We are looking for a skilled Backend Developer to join our team. This role requires strong expertise in building robust, scalable, and secure backend services using Kafka, Elasticsearch, PostgreSQL, TypeScript, and the NestJS framework. You will play a key role in designing, developing, and maintaining APIs and distributed systems that process large volumes of data efficiently.\nResponsibilities:\nDesign, develop, and maintain microservices architecture using NestJS.\nImplement event-driven systems with Apache Kafka for real-time data processing.\nBuild search and analytics capabilities using Elasticsearch.\nDevelop and optimize SQL queries and data models in PostgreSQL.\nWrite clean, modular, and testable code in TypeScript.\nCreate and manage RESTful and GraphQL APIs for seamless integration.\nOptimize system performance for scalability and reliability.\nIntegrate and manage cloud infrastructure, particularly with AWS, GCP, or Azure.\nCollaborate with front-end developers, DevOps engineers, and product managers to deliver high-quality products.",
    "requirements": "Must-Have Skills:\nStrong proficiency in TypeScript and Node.js.\nExperience with NestJS or similar frameworks (e.g., Express, Fastify).\nSolid knowledge of Apache Kafka for event streaming.\nExpertise in PostgreSQL database design and optimization.\nHands-on experience with Elasticsearch for search and analytics.\nUnderstanding of microservices and distributed system architecture.\nFamiliarity with containerization (Docker) and orchestration tools like Kubernetes.\nExperience with CI/CD pipelines and tools such as GitHub Actions, Jenkins, or GitLab CI.\nFamiliarity with monitoring and logging tools (e.g., Prometheus, Grafana, ELK stack).\n \nNice-to-Have Skills:\nExperience with Redis or other caching systems.\nKnowledge of RabbitMQ or ActiveMQ for message queuing.\nFamiliarity with authentication and authorization frameworks like OAuth2.0 or OpenID Connect.\nExposure to Serverless architecture (AWS Lambda, Google Cloud Functions).\nUnderstanding of data pipeline frameworks (e.g., Apache Flink, Apache Spark).\n \nQualifications:\nBachelor’s degree in Computer Science, Engineering, or a related field, or equivalent experience.\n3+ years of backend development experience.\nStrong problem-solving and debugging skills.\nExcellent communication and collaboration skills."
  },
  {
    "title": "Backend Developer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/2hjmti4cHPaf-Backend-Developer-WTDD-Giza-Egypt",
    "experience": "More than 2 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "APIs, Node.js, PostgreSQL, MongoDB, OAuth, RBAC, RESTful APIs, GraphQL, backend, Software Development, AWS, Computer Science, Docker, Information Technology (IT), MySQL, Python, REST, Software Engineering",
    "description": "We are seeking a skilled backend developer to architect and scale the core infrastructure of a complex enterprise management platform. The role involves building robust APIs, designing and optimizing database performance, and integrating third-party services to support real-time data processing, role-based access, and modular workflows.\n \nKey Responsibilities\nDesign and develop \nRESTful/GraphQL APIs\n to handle high-concurrency workflows, including role-based permissions, audit logs, and multi-level approval chains.\nImplement \nreal-time data synchronization\n for live tracking, updates, and dynamic dashboards.\nIntegrate third-party APIs (e.g., weather data, IoT sensors) and ensure seamless interoperability with internal systems.\nArchitect \nrelational and NoSQL databases\n to manage structured datasets and unstructured data\nBuild \nrole-based access control (RBAC)\n systems with granular permissions down to individual data entities.\nOptimize database queries, caching mechanisms, and serverless functions for scalability\nCollaborate with frontend teams to ensure API compatibility with modular, role-specific UIs.\nWrite automated tests (unit, integration, load).\nSecure data with encryption, OAuth2/JWT authentication.",
    "requirements": "Core Languages:\n Proficiency in \nNode.js (Express/NestJS)\n or \nPython (Django/Flask)\n. Preferably Node.js\nDatabases:\nRelational: \nPostgreSQL/MySQL\n (ORM: Sequelize, TypeORM).\nNoSQL: \nMongoDB\n, \nRedis\n (caching, session management).\nAPIs & Protocols:\n REST, GraphQL, WebSocket/Socket.io.\nCloud & DevOps (\nNice to have\n):\nCloud Platforms: \nAWS\n (EC2, Lambda, S3, RDS) or \nAzure\n.\nContainerization: \nDocker\n, \nKubernetes\n.\nCI/CD: \nGitHub Actions\n, \nJenkins\n.\nSecurity:\n JWT, OAuth2, rate limiting, etc..\nMonitoring & Logging:\n \nPrometheus/Grafana\n, \nELK Stack\n.\nArabic language support (UTF-8, \nright-to-left data handling\n)."
  },
  {
    "title": "Senior .NET Core Developer",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/2gYovaT9zao1-Senior-NET-Core-Developer-Nile-Bits-LLC-Giza-Egypt",
    "experience": "8 to 18 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Angular, ASP.Net, MVC, APIs, .Net",
    "description": "We are looking for an experienced \n.NET Developer\n to join our team on a \n6-month contract\n. You will work on developing, optimizing, and maintaining high-performance \n.NET applications\n, collaborating with a talented team on cutting-edge projects. This role requires hands-on expertise in \nC#, .NET Core, and cloud technologies\n, with the potential for contract extension based on performance.",
    "requirements": "Responsibilities\nDevelop and maintain \n.NET Core, C#, and ASP.NET\n applications.\nWork closely with business and technical teams to build \nscalable and secure solutions\n.\nDesign and implement \nRESTful APIs and Microservices\n.\nOptimize application performance and troubleshoot technical issues.\nWork with \nSQL Server, Postgres\n and \nNoSQL databases\n for data management.\nCollaborate in an \nAgile/Scrum\n environment and participate in \ncode reviews\n.\nImplement \nunit testing\n and contribute to \nCI/CD pipelines\n.\nEnsure best practices in \nsecurity, performance, and maintainability\n.\n \nQualifications\n8+ years of experience\n in .NET development (\nC#, .NET Core, ASP.NET, MVC\n).\nStrong experience with \nSQL Server\n or \nNoSQL databases\n.\nKnowledge of \nRESTful APIs, Microservices, and Modern architecture\nHands on experience with API Gateways, ESB.\nExperience with \ncontainerization (Docker, Kubernetes)\n.\nStrong understanding of \nauthentication protocols\n (OAuth, JWT, OpenID).\nExperience with Angular frontend frameworks\nExperience with \nBlazor, gRPC, or SignalR\n.\nKnowledge of \nTDD (Test-Driven Development)\n and unit testing frameworks.\nExperience working in \nbanking, fintech, or government projects\n is a plus.\nFamiliarity with \nDevOps, CI/CD pipelines, and Git version control\n.\nFamiliarity with \ncloud platforms (Azure or AWS)\n."
  },
  {
    "title": "Full Stack Developer",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/gCpG0KjPgzLX-Full-Stack-Developer-Enhanced-Genetics-AI-Medellin-Colombia",
    "experience": "4 to 7 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Full Stack Developer, Software Development, Bootstrap, CSS, Git, HTML, Information Technology (IT), JavaScript, Computer Science, ASP.Net, Angular, .Net, SQL",
    "description": "About the Role:\nWe are looking for \ntwo full-stack developers\n to join our team and help build a secure, high-performance web application for \nDoctor AI\n—a platform focused on sports health analytics. You will work with cutting-edge technologies in \nC#/.NET, Angular, and Azure\n to develop a scalable, mobile-friendly SaaS solution.\nWe prefer \nfull-stack developers\n, but if you specialize in \neither front-end or back-end development\n, we still encourage you to apply.\nResponsibilities:\nDevelop and maintain a modern web application using \nAngular (Front-end) and C#/.NET (Back-end)\n.\nImplement and integrate authentication using \nAzure AD B2C (Google, Facebook, and email logins).\nWork with \nStripe\n for HIPAA-compliant payment processing and fraud prevention.\nOptimize performance, security, and scalability within an \nAzure-based cloud environment\n.\nCollaborate with a remote team using \nGit\n and \nAgile methodologies\n.\nWrite clean, maintainable, and well-documented code.",
    "requirements": "Required Skills:\n✅ \nFront-End:\n Angular, TypeScript, HTML, CSS, Bootstrap or Tailwind\n✅ \nBack-End:\n C#, .NET Core, ASP.NET API development\n✅ \nDatabase:\n SQL Server (experience writing queries and stored procedures)\n✅ \nCloud & DevOps:\n Azure Services (App Services, Functions, Storage)\n✅ \nAuthentication:\n OAuth, JWT, Microsoft Azure AD B2C\n✅ \nVersion Control:\n Git (GitHub or Azure DevOps)\nNice to Have:\nExperience with \nStripe\n or other payment gateways\nFamiliarity with \nHIPAA compliance\n (a plus but not required)\nPrior experience in \nAI-based applications or healthcare tech\nMobile-first development experience\nWho Should Apply?\nDevelopers with \n1-4 years of experience\n looking for a \nstable, long-term remote job\n.\nCandidates who can \ncommunicate in English\n (at least intermediate level).\nThose passionate about building scalable, secure applications in a \nfast-moving startup environment\n.\nCompensation & Benefits:\n???? \nRemote Work\n – Flexible hours, work from anywhere in Egypt\n???? \nGrowth Opportunities\n – Learn AI, cloud computing, and healthcare tech\n???? \nSupportive Team\n – Work directly with experienced IT professionals"
  },
  {
    "title": "Head of Software Development",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/ukpHg0vBf5pM-Head-of-Software-Development-Cairo-Egypt",
    "experience": "More than 10 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Computer Science, Engineering, Information Technology (IT), Java, MySQL, Programming, React, Software, Git, Software Development, Software Engineering, SQL",
    "description": "Job Summary:\nWe are looking for a highly skilled and experienced Head of Software Development to lead our\nsoftware engineering team. This role requires deep expertise in Java, Spring Boot, and React,\nalong with strong leadership, strategic planning, and technical decision-making abilities. The\nideal candidate will oversee the design, development, and deployment of high-quality software\nsolutions, ensuring scalability, performance, and security while driving innovation and best\npractices.\nKey Responsibilities:\n1. Leadership & Strategy\n Define and implement the software development strategy aligned with the company’s\nbusiness goals.\n Lead, mentor, and manage a team of software engineers, fostering a culture of\ncollaboration and technical excellence.\n Collaborate with cross-functional teams, including product managers, UX/UI designers,\nand DevOps engineers, to deliver high-quality software solutions.\n Stay updated on emerging technologies and industry trends to drive innovation within the\norganization.\n2. Software Development & Architecture\n Architect and oversee the development of scalable, high-performance, and secure\napplications using Java, Spring Boot, and React.\n Ensure adherence to best practices in software design, microservices architecture, and\ncloud-native development.\n Lead technical design discussions, code reviews, and architectural decision-making.\n Optimize application performance, scalability, and reliability.\n3. Project & Process Management\n Define and enforce development processes, coding standards, and agile methodologies\n(Scrum/Kanban).\n Ensure timely delivery of software projects while maintaining high quality and security\nstandards.\n Monitor development progress, resolve technical roadblocks, and ensure effective\nresource allocation.\n Implement CI/CD pipelines and DevOps best practices for seamless deployment and\nautomation.\n4. Security & Compliance\n Enforce secure coding practices and ensure applications comply with data protection\nregulations.\n Work closely with cybersecurity teams to implement security best practices, including\nauthentication, authorization, and encryption.\n Conduct regular security assessments and vulnerability testing.\n5. Stakeholder Communication & Reporting\n Act as a bridge between technical teams and business stakeholders, translating business\nrequirements into technical solutions.\n Provide regular updates on project progress, risks, and mitigation plans to senior\nleadership.\n Define key performance indicators (KPIs) to measure the success of development\ninitiatives.",
    "requirements": "Required Skills & Qualifications:\nTechnical Skills:\n Programming Languages: Strong expertise in Java (Java 8+), Spring Boot, and front-\nend development with React.js.\n Microservices & APIs: Experience designing and implementing RESTful APIs,\nGraphQL, and event-driven architectures.\n Cloud & DevOps: Experience with cloud platforms like AWS, Azure, or Google\nCloud, along with Docker, Kubernetes, and CI/CD pipelines.\n Database Management: Proficiency in SQL (PostgreSQL, MySQL) and NoSQL\n(MongoDB, Redis) databases.\n Security & Authentication: Experience with OAuth2, JWT, SSO, OpenID Connect,\nand security best practices.\n Version Control & CI/CD: Hands-on experience with Git, GitHub/GitLab, Jenkins,\nor GitHub Actions.\nLeadership & Soft Skills:\n Proven ability to lead and manage high-performing software development teams.\n Strong problem-solving and analytical skills.\n Excellent communication and stakeholder management abilities.\n    Ability to drive change, mentor junior developers, and foster a culture of learning and\ninnovation.\nPreferred Qualifications:\n Experience with React Native for mobile app development is a plus.\n Bachelor’s degree in computer science, Software Engineering, or related field."
  },
  {
    "title": "Solution Architect",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/20XufW2EDhFq-Solution-Architect-Softec-Technologies-Cairo-Egypt",
    "experience": "10 to 20 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Computer Engineering, Computer Science, Information Technology (IT), Software Development, Architecture, Software Engineering, Software, Engineering, Cloud, Azure, AWS, Agile",
    "description": "1. Legacy System Modernization and Documentation\nAudit and Document\n: Conduct detailed reviews of existing, undocumented legacy systems, documenting their architecture, functionality, and limitations.\nComprehensive Technical Documentation\n: Maintain thorough records and diagrams to be shared across multiple teams.\nIdentify Optimization Opportunities\n: Pinpoint performance bottlenecks and propose enhancements for reliability and scalability.\n2. Architectural Design and Strategy\nHigh-Level Architecture\n: Develop plans for modernizing legacy systems and architecting new solutions that align with business objectives and follow industry best practices.\nSAFe-Aligned Vision and Roadmap\n: Leverage SAFe principles to define and communicate an architectural vision, creating an \narchitectural runway\n that supports current and future program increments.\nNon-Functional Requirements (NFRs)\n: Establish and enforce critical system attributes such as performance, security, and compliance.\nTechnical Roadmaps\n: Chart actionable steps and timelines for transitioning from legacy to modern architectures while ensuring cost-efficiency.\n3. Collaboration and Technical Visualization\nCross-Functional Engagement\n: Work closely with Software Managers, Technical Leads, and Product Owners to align architectural designs with product and business needs.\nVisual Aids and Documentation\n: Produce architectural diagrams, technical workflows, and prototypes to facilitate effective decision-making and stakeholder buy-in.\nCoordinate Across Teams (ARTs)\n: In a SAFe context, ensure alignment between multiple Agile Release Trains (ARTs), synchronizing technical efforts and dependencies.\n4. Technical Leadership and Evaluation\nEnforce Architecture Standards\n: Define and govern technical guidelines, best practices, and coding standards in accordance with SAFe and enterprise directives.\nSupport Agile Teams\n: Offer ongoing mentorship and just-in-time architectural guidance, helping teams address design or implementation challenges.\nRisk Mitigation and Technical Debt\n: Proactively identify technical risks in modernization efforts and manage technical debt to keep solutions maintainable over the long term.\nTools and Technologies\n: Evaluate and recommend emerging frameworks, platforms, and methodologies that align with project objectives.\n5. Organizational Responsibilities\nAlign with Business and Product Strategy\n: Partner with Product Management to ensure architectural decisions drive both technical and business value.\nFacilitate Continuous Exploration\n: Participate in discovery and feasibility assessments to validate technical approaches and encourage innovation.\nIncremental Development\n: Enable iterative and incremental delivery of features through an \narchitectural runway\n, balancing intentional and emergent architecture.\nEnterprise Compliance\n: Work with Enterprise Architects to confirm alignment with broader architectural guidelines and regulatory requirements.",
    "requirements": "Qualifications\nRequired\nBachelor’s degree in Computer Science, Software Engineering, or a related field.\nProven hands-on experience in software/system architecture or a similar role.\nDemonstrated ability to document legacy systems and design scalable, modern architectures.\nProficiency with architectural modeling tools (e.g., Visio, Lucidchart).\nStrong knowledge of cloud platforms (AWS, Azure) and contemporary software development practices.\nExcellent communication skills to effectively liaise with both technical and non-technical stakeholders.\nPreferred\nMaster’s degree or recognized certifications in system architecture or related domains.\nExperience in microservices architecture and distributed systems.\nFamiliarity with DevOps principles, CI/CD pipelines, and Agile development methodologies.\nPrevious experience working in or with organizations in the Middle East region."
  },
  {
    "title": "Technical Project Manager",
    "posted_date": "Posted1 monthago",
    "job_url": "https://wuzzuf.net/jobs/p/OSPXa82VIAjH-Technical-Project-Manager-Khales-Giza-Egypt",
    "experience": "4 to 6 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Communication skills, Computer Science, Engineering, PMP, Project, Project Management, Planning, English",
    "description": "Job Purpose:\nManage cross functional technical projects across the company\nManage and maintain a healthy corporate relationship within Khales & the Holding on strategic planning, budget and projects reporting levels.\nDeliver company technical projects and services agenda either personally or through subordinate Teams.\nJob Responsibilities & Accountabilities:\n• Carry out and implement the five-project management phases; Initiation, Planning, Execution, Controlling, and Closing.\n• Adopt project management methodology/techniques to manage the nine knowledge areas of project management.\n• Maintaining and monitoring project plans, project schedules, budgets, and expenditures.\n• Facilitate the definition of project scope, goals, and deliverables.\n• Oversee the integration of various systems and applications, ensuring seamless interoperability and alignment with business objectives.\n• Lead and manage projects using DEVOPS methodologies to improve collaboration between development and operations teams, ensuring timely delivery of high-quality software.\n• Manage necessary certifications, including PCI compliance and penetration testing, ensuring adherence to industry standards and regulations.\n• Utilize Jira for project tracking, issue management, and sprint planning. Create and maintain project documentation to ensure transparency and stakeholder engagement.\n• Collaborate with stakeholders at all levels, ensuring their needs are understood and met throughout the project lifecycle.\n• Develop detailed project plans using Microsoft Project, including timelines, milestones, and resource allocation.\n• Lead cross-functional teams, foster a collaborative environment and ensure team members are aligned with project goals.\n• Identify potential project risks and develop mitigation strategies to minimize impact on project timelines and deliverables.\n• Define project tasks and resources requirements.\n• Ensure proper reporting on all levels / aspects related to department scope\n• Organizing, attending, and participating in stakeholder meetings.\n• Facilitate meetings where appropriate and distribute minutes to all project team members.\n• Documenting and following up on important actions and decisions from meetings.\n• Preparing necessary presentation materials for meetings or weekly Project status\n• Ensuring project deadlines are met.\n• Determining project changes (CRs)\n• Ensuring projects adhere to frameworks and all documentation is maintained appropriately for each project.\n• Ensure stakeholder views are managed towards the best solution.\n• Escalate whenever needed to move the project forward,Escalate whenever needed to move the project forward.",
    "requirements": "Qualifications:\nEducation:\nBachelor’s degree in computer science, Information Technology, Engineering, or a related field.\nPMP Knowledge is preferred \nScrum.\nExperience:\n6-8 years of experience in a related field.\nProven experience as a Technical Project Manager, preferably within the fintech, telecom, banking, or software development sectors.\nDigital Products & Lifecycle management experience is required\nKnowledge & Abilities:\nProficiency in project management tools (e.g., Jira, Microsoft Project).\nExcellent communication and interpersonal skills\nStrong organizational and multitasking abilities.\nKnowledge of digital technology, emerging media and the Internet\nExcellent project management skills Experience with fintech tools, procedures, and regulation\nKnowledge of credit cards, Wallets or another financial services a plus\nExperience in one or more of the following areas: online/mobile banking, new product/service onboarding, payments, online security and authentication\nStrong problem-solving, planning/organizational and presentation skills\nAbility to develop relationships with internal and external stakeholders and work with all levels\nResults-oriented with strong verbal and written communication skills."
  },
  {
    "title": "Sr Software Engineer",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/Y3kJRShHKNHL-Sr-Software-Engineer-Erada-Cairo-Egypt",
    "experience": "3 to 5 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Computer Science, Engineering, Software Engineering, Software Development, Software, Programming, Information Technology (IT)",
    "description": "Job Description\nKey Responsibilities:\n-Design, develop, and maintain backend services and APIs using Node.js, ensuring high performance, reliability, and scalability.\n-Collaborate with product managers, designers, and frontend developers to translate business requirements into technical solutions.\n-Lead the architecture and design discussions to build robust and scalable systems.\n-Optimize application performance, monitor system health, and resolve production issues.\n-Mentor junior developers, conduct code reviews, and ensure adherence to coding standards and best practices.\n-Stay up-to-date with the latest trends and advancements in Node.js and backend development technologies.\n-Implement security and data protection measures in line with industry standards.\n-Contribute to the entire software development lifecycle, from concept and design to deployment",
    "requirements": "Job Requirements\nRequired Qualifications:\n-Bachelor’s or Master’s degree in Computer Science, Software Engineering, or a related field.\n-5+ years of professional experience in backend development, with at least 3 years focused on Node.js.\n-Proficient in building RESTful APIs, microservices, and serverless architectures.\n-Strong understanding of asynchronous programming, event-driven architectures, and non-blocking I/O.\n-Experience with database systems, including both SQL (e.g., PostgreSQL, MySQL) and NoSQL (e.g., MongoDB).\n-Familiarity with cloud platforms like AWS, Azure, or Google Cloud, and containerization tools such as Docker.\n-Knowledge of CI/CD pipelines, testing frameworks, and version control systems (e.g., Git).\n-Excellent problem-solving skills, attention to detail, and ability to work in a fast-paced environment.\n-Strong communication skills with the ability to explain complex technical concepts to non-technical stakeholders.\nPreferred Qualifications:\n-Previous experience working in the fintech sector, with an understanding of industry-specific challenges and -compliance requirements.\n-Experience with TypeScript in Node.js development.\n-Familiarity with front-end frameworks like React or Angular for full-stack development.\n-Knowledge of GraphQL, WebSocket, or real-time communication protocols.\n-Background in DevOps practices and infrastructure-as-code tools such as Terraform."
  },
  {
    "title": "Senior Dot Net Developer",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/3ttaEYrfd2mM-Senior-Dot-Net-Developer-Union-Coop-Giza-Egypt",
    "experience": "More than 4 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": ".Net, ASP.Net, Software, Software Development, SQL, MVC",
    "description": "We are seeking a skilled Senior Backend .NET Developer with a minimum of 4 years of experience to join our dynamic team. The ideal candidate will have strong expertise in .NET Framework, .NET Core, ASP.NET Core, MVC, Entity Framework, SQL Server, and RESTful APIs. The successful candidate will be responsible for designing and implementing scalable and efficient back-end software solutions and collaborating with cross-functional teams to deliver high-quality projects.\n \nResponsibilities:\nDesign, develop, and maintain robust back-end software applications using .NET Framework, .NET Core, ASP.NET Core, and MVC.\nCollaborate with cross-functional teams to identify, design, and implement solutions that meet customer requirements.\nDevelop and maintain database structures using SQL Server and Entity Framework.\nCreate and manage RESTful APIs to enable seamless communication with front-end systems.\nEnsure that all back-end solutions are scalable, secure, and optimized for performance.\nTroubleshoot and debug back-end software issues as they arise.\nStay updated with emerging trends and technologies in backend software development.",
    "requirements": "Must-Have:\nExpertise in .NET Framework, .NET Core, ASP.NET Core, MVC, and Entity Framework.\nProficiency in SQL Server, including database design and optimization.\nStrong knowledge of .NET C# and experience with Web Services (SOAP & REST) and APIs.\nFamiliarity with Azure DevOps.\nSolid understanding of Agile Methodology & SDLC.\nStrong grasp of Design Patterns and Clean Architecture.\nUnit Testing experience.\nExcellent English communication skills (both verbal and written).\nGood to Have:\nExperience with Windows Forms.\nKnowledge of DevExpress Library or Telerik (for potential minimal UI components).\nFamiliarity with Jira and Code Versioning tools.\nQualifications:\nA minimum of 4 years of experience in backend-focused .NET development.\nBachelor's degree in Computer Science, Engineering, or a related field is preferred.\nStrong problem-solving skills and the ability to troubleshoot and debug back-end software issues.\n \nBenefits:\nCompetitive salary is based on AED conversion, which depends on the monthly AED rate.\n30 days annual leaves balance.\nMedical insurance.\nWorking days are 4.5 per week, starting Monday to Thursday and a half day on Friday."
  },
  {
    "title": "Scrum Master",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/OgE6JeDiKTIE-Scrum-Master-Nahdet-Misr-Publishing-Group-Giza-Egypt",
    "experience": "3 to 5 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Agile, Project, Master",
    "description": "1. \nFacilitating Scrum Events\nSprint Planning:\n Facilitate the planning of the upcoming sprint by ensuring the team understands the sprint goal, backlog items, and tasks.\nDaily Stand-ups (Daily Scrum):\n Ensure these meetings are time-boxed and focused, helping the team discuss progress, blockers, and plans.\nSprint Review:\n Facilitate the review of completed work with stakeholders, ensuring the team showcases their deliverables and gathers feedback.\nSprint Retrospective:\n Facilitate a reflection on the sprint process to identify areas for improvement and encourage team self-reflection.\n2. \nTeam Coaching and Support\nFoster a self-organizing team:\n Guide the team in making decisions and solving problems independently while offering support when necessary.\nRemove impediments:\n Identify and help remove blockers that prevent the team from meeting their sprint goals or delivering value.\nPromote collaboration:\n Encourage open communication, knowledge sharing, and collaboration within the team and with stakeholders.\n3. \nScrum Process Implementation & Adherence\nEnsure Scrum practices are followed:\n Act as a guardian of Scrum principles and practices, ensuring the team adheres to the framework.\nAdapt Scrum to fit the team's needs:\n While adhering to Scrum principles, adapt practices to suit the team's unique circumstances or challenges.\n4. \nStakeholder and Product Owner Support\nSupport the Product Owner:\n Help the Product Owner manage the product backlog, ensuring it is well-defined, prioritized, and ready for Sprint Planning.\nFacilitate stakeholder communication:\n Ensure transparency between the development team and stakeholders, promoting a shared understanding of goals, progress, and issues.\n5. \nPromoting Continuous Improvement\nFacilitate Retrospectives:\n Continuously improve the team’s processes by leading retrospectives, encouraging the team to reflect and learn from their experiences.\nTrack and improve team performance:\n Use Agile metrics (like velocity, burn-down charts, etc.) to assess team performance and identify areas for improvement.\n6. \nConflict Resolution and Team Dynamics\nMediation and conflict resolution:\n Act as a mediator in conflicts between team members or stakeholders, helping resolve issues and improving team dynamics.\nBuild team morale and motivation:\n Help build a culture of trust, respect, and continuous learning within the team.",
    "requirements": "Agile/Scrum Experience:\n Typically 3-5 years of experience working in an Agile or Scrum environment, including at least 1-2 years as a Scrum Master. Experience working with cross-functional teams is highly beneficial.\nProject/Team Management Experience:\n Experience in managing or leading teams, even if in a non-Scrum context, can be valuable for understanding dynamics, planning, and execution.\nExperience with Scrum Tools:\n Proficiency in tools like Jira, Trello, or Azure DevOps, which are commonly used to manage Scrum backlogs, sprints, and reporting"
  },
  {
    "title": "Software Quality Assurance (QA) Tester",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/xACXvxOPF5UQ-Software-Quality-Assurance-QA-Tester-Advanced-Solutions-Cairo-Egypt",
    "experience": "4 to 6 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential",
    "skills": "Software Tester, Software Testing, Computer Science, Information Technology (IT), Quality Control, Programming, Testing, Tester, Automation, Communication skills, quality, Quality Assurance, Software, test automation",
    "description": "Job Overview:\n We are seeking a dedicated and detail-oriented Software Quality Assurance (QA) Tester to join our team. In this role, you will be responsible for ensuring the functionality, usability, and overall quality of our software products by designing, executing, and reporting on various testing processes. You will collaborate closely with the development team to identify and resolve issues, ensuring our products meet the highest standards of performance and reliability. Experience with Azure DevOps and test automation tools will be a strong advantage.\nKey Responsibilities:\nReview software requirements and specifications to create comprehensive and effective test scenarios that cover all aspects of the product.\nExecute tests to evaluate software usability, functionality, and performance, ensuring that all requirements are met.\nAnalyze test results, identify database impacts, and report errors, bugs, and any usability issues.\nPrepare and maintain detailed reports on testing activities, providing clear feedback to the development and design teams for improvements.\nDevelop, execute, and maintain test cases that validate functionality, data integrity, security, and overall product usability.\nTrack, document, and prioritize defects, ensuring all issues are addressed and resolved in a timely manner.\nCollaborate with developers and other stakeholders to continuously improve software quality and optimize the testing process.\nContinuously learn and adapt to new testing tools and technologies, contributing to the evolution of the team’s testing strategies.",
    "requirements": "Job Requirements:\nA Bachelor’s degree in Computer Science, Information Technology, or a related technical field.\nIn-depth knowledge of software testing methodologies, test design, and techniques.\nExperience working with various testing tools and understanding compatibility with multiple software environments.\nWorking knowledge of programming and an ability to understand code in order to support testing efforts.\nStrong critical thinking and problem-solving abilities with a focus on thorough analysis and attention to detail.\nExcellent communication skills to clearly document issues and effectively interact with cross-functional teams.\nStrong organizational skills and an ability to manage multiple tasks simultaneously, with a keen focus on quality.\nProficiency with Azure DevOps is essential for managing the testing lifecycle and tracking defects.\nExperience with test automation tools is highly desirable and a significant advantage."
  },
  {
    "title": "Senior Full Stack Developer",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/5o5sCYdXqPnD-Senior-Full-Stack-Developer-iucon-Egypt-Giza-Egypt",
    "experience": "2 to 4 years",
    "education": "Bachelor's Degree",
    "salary": "Confidential, Salary according to the exchange rate",
    "skills": "ASP.Net, .Net, English, Information Technology (IT), Oracle, JavaScript, SQL, Software Development, Computer Science",
    "description": "Work with development teams and product managers to ideate software solutions\nWork with data scientists and analysts to improve softwareWe use a wide range of different technologies\nand run some systems still build on  top of an MS SQL Server, \nASP.NET WebForms technology stack\n.\nYou will monitor, maintain and adjust parts of the web frontend as well as automatically running import tasks implemented in \nC# and T-SQL.\nAt the same time, we built up a completely new product line.\nYou will be part of the team who is creating the system using modern web technologies such as .\nNET Core  MVC REST services, elastic, RabbitMQ and components like DevExtreme\nWrite technical documentation",
    "requirements": "English Language is an Excellent only.\nITI is a must.\nDegree in Computer Science, Statistics, or relevant field.\nYou have successfully completed an information technology degree.\n You have a very good knowledge of \nDatabases, T-SQL, .NET Core and ASP.NET Framework. \nYou have experience with\n JavaScript and modern libraries and concepts like Angular2+, Typescript, RxJs. You are familiar with OOP and SOLID principles and have knowledge in design patterns and data structures.\nIf you have been working with \nOracle, elastic or GraphQL before, it will be a big bonus.\nYou love to research and investigate, bring \n“Sherlock Homes\n”-like abilities and attitude. You do not give up until you finally find a solution – or at least an explanation.\nExperience with version control systems (e.g. DevOps, GIT) is an advantage, but can also be gained while working with us.\nExcellent communication and teamwork skills.\nGreat attention to detail.\nOrganizational skills.\nAn analytical mind.\nSalary according to the exchange rate."
  },
  {
    "title": "Senior Mobile Developer ( Experienced in both IOS & Flutter )",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/xjyuNT0yDojH-Senior-Mobile-Developer-Experienced-in-both-IOS-Flutter-Lumin-Giza-Egypt",
    "experience": "3 to 5 years",
    "education": "Not Specified",
    "salary": "Confidential, - Semi Annual Bonus \n- Medical Insurance \n- Social Insurance",
    "skills": "Android, Agile, Swift, iOS, Information Technology (IT), Software Development, Flutter, Dart Programming, Scrum",
    "description": "About the Role\nWe are looking for a \nSenior Mobile App Developer\n specializing in \niOS (Swift) and Flutter (Dart)\n to develop and optimize high-quality mobile applications. The ideal candidate should have strong technical expertise in \nnative iOS and Flutter development\n, a deep understanding of best coding practices, and a passion for delivering seamless user experiences.\nAs a \nSenior Mobile App Developer\n, you will collaborate with designers, backend developers, and product managers to build scalable, high-performance mobile applications while ensuring code quality, maintainability, and efficiency.\n \nKey Responsibilities\nDevelopment & Technical Execution\nDevelop, optimize, and maintain \niOS applications using Swift\n and \ncross-platform applications using Flutter (Dart)\n.\nFollow \nSOLID principles\n and modern architectural patterns such as \nMVVM\n to ensure maintainable and scalable codebases.\nIntegrate mobile applications with \nRESTful APIs, GraphQL, and WebSockets\n for seamless data communication.\nImplement state management solutions in Flutter (Provider, Bloc, Redux, Riverpod, etc.).\nEnsure smooth and efficient \nCI/CD pipelines\n for mobile applications.\nIdentify and resolve performance bottlenecks, memory leaks, and UI/UX inconsistencies.\nCode Quality & Best Practices\nWrite clean, maintainable, and testable code, adhering to industry best practices.\nConduct \ncode reviews\n and provide constructive feedback to peers.\nImplement and maintain \nunit tests, UI tests, and automated testing frameworks\n to ensure application reliability.\nFollow \nApp Store and Google Play guidelines\n to ensure smooth deployment and updates.\nCollaboration & Communication\nWork closely with \nUI/UX designers\n to build visually appealing and responsive mobile applications.\nCollaborate with \nbackend developers\n to ensure seamless API integrations.\nAssist \njunior developers\n by providing mentorship, guidance, and best practice recommendations.\nParticipate in \nsprint planning, retrospectives, and daily standups\n within an Agile team environment.\nInnovation & Continuous Learning\nStay updated with the latest \niOS and Flutter\n advancements and contribute to the adoption of new technologies.\nResearch and implement \nmobile security best practices\n, including OAuth, JWT, and encryption techniques.\nExplore and optimize \nFirebase, Google Play Services, and Apple ecosystem features\n for enhanced app capabilities.",
    "requirements": "3+ years\n of experience in \nmobile app development\n, focusing on \niOS (Swift) and Flutter (Dart)\n.\nStrong knowledge of \nSwiftUI, UIKit, and Flutter frameworks\n.\nExperience with \nstate management libraries\n (Provider, Bloc, Redux, Riverpod).\nSolid understanding of \nAgile methodologies\n (Scrum/Kanban) and \nDevOps tools\n.\nHands-on experience with \nRESTful APIs, GraphQL, and WebSockets\n.\nExperience publishing apps to the \nApp Store\n and managing the release process.\nProficiency in \nunit testing, UI testing, and test automation\n for mobile apps.\nStrong debugging, problem-solving, and performance optimization skills.\nExperience with \nFirebase, Google Play Services, and Apple ecosystem\n.\nFamiliarity with \nmobile security best practices\n and \nsecure authentication mechanisms\n.\n \nPreferred Qualifications\nExperience with \nnative Android (Kotlin) development\n is a big plus.\nKnowledge of \nCI/CD for mobile apps\n (Fastlane, GitHub Actions, Bitrise, or Codemagic).\nExperience working in \nmulti-platform teams\n with backend and frontend collaboration."
  },
  {
    "title": "Web&App Developer",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/6ATQR2Kb9OoU-WebApp-Developer-SSI-Alexandria-Egypt",
    "experience": "3 to 5 years",
    "education": "Bachelor's Degree",
    "salary": "1000 to 20000 EGP Per Month",
    "skills": "App developer, app, Computer Science, developer, Information Technology (IT), Software Development, Web Development, Web",
    "description": "What You’ll Do:\nDesign, develop, and maintain responsive websites and mobile applications. \n Collaborate with cross-functional teams to bring creative concepts to life.  \nOptimize web and app performance for speed, scalability, and user engagement.  \nTroubleshoot and debug issues to ensure smooth functionality.  \nStay updated on the latest industry trends and technologies to keep us ahead of the curve.  \nWhat We’re Looking For:\nProficiency in front-end and back-end development (HTML, CSS, JavaScript, React, Node.js, etc.).  \n \nExperience with mobile app development (iOS, Android, or cross-platform frameworks like Flutter/React Native).  \nStrong understanding of UI/UX principles and responsive design.  \n \nFamiliarity with databases, APIs, and cloud services.  \n \nProblem-solving mindset and a passion for clean, efficient code.  \nBonus: Experience with DevOps, AI integration, or e-commerce platforms.",
    "requirements": "Proven working experience in web programming\nTop-notch programming skills and in-depth knowledge of modern HTML/CSS\nFamiliarity with at least one of the following programming languages: PHP, ASP.NET, Javascript or Ruby on Rails\nA solid understanding of how web applications work including security, session management, and best development practices\nAdequate knowledge of relational database systems, Object Oriented Programming and web application development\nHands-on experience with network diagnostics, network analytics tools\nBasic knowledge of Search Engine Optimization process\nAggressive problem diagnosis and creative problem solving skills\nStrong organizational skills to juggle multiple tasks within the constraints of  timelines and budgets with business acumen\nAbility to work and thrive in a fast-paced environment, learn rapidly and master diverse web technologies and techniques.\nBS in computer science or a related field"
  },
  {
    "title": "Software Testing",
    "posted_date": "Posted2 monthsago",
    "job_url": "https://wuzzuf.net/jobs/p/e6MzVWfeVuod-Software-Testing-Cubic-Information-Systems-Cairo-Egypt",
    "experience": "2 to 4 years",
    "education": "Not Specified",
    "salary": "Confidential",
    "skills": "Information Technology (IT), Software, Software Testing, Agile, Automation, Software Development, Testing, Selenium, SQL",
    "description": "Design, develop, and execute \nmanual and automated test cases\n for web, mobile, and API applications.\nDevelop and maintain \ntest automation frameworks\n using \nany automation tool\n (e.g., Selenium, Cypress, Playwright, Robot Framework, etc.).\nConduct \nAPI testing\n using \nPostman, REST Assured, or any other API testing tools\n to validate functionality, performance, and security.\nCollaborate with developers, business analysts, and product managers to ensure \nclear test requirements and acceptance criteria\n.\nIdentify, document, and report \nbugs, defects, and inconsistencies\n using defect tracking tools (e.g., Jira, Bugzilla, or similar).\nPerform \nregression, functional, integration, and performance testing\n as part of the SDLC.\nImplement and execute \nCI/CD pipelines\n for test automation in collaboration with DevOps teams.\nAnalyze test results, troubleshoot issues, and provide detailed reports on software quality and stability.\nStay up to date with the latest \ntesting methodologies, tools, and best practices\n to continuously improve the QA process.",
    "requirements": "Bachelor’s degree in Computer Science, Information Technology, or a related field.\n2+ years\n of experience in software testing (manual & automation).\nProven experience in \ntest automation frameworks\n (Selenium, Cypress, Robot Framework, Playwright, or others).\nHands-on experience with \nAPI testing using Postman, REST Assured, or similar tools\n.\nStrong understanding of \nSDLC, STLC, and Agile methodologies\n (Scrum/Kanban).\nExperience with \nbug tracking and test management tools\n (Jira, TestRail, etc.).\nBasic knowledge of databases and SQL for data validation.\nExperience with scripting languages such as \nPython, Java, JavaScript, or any relevant language\n for automation.\nFamiliarity with \nCI/CD tools\n (Jenkins, GitHub Actions, GitLab CI/CD) for integrating automated tests.\nExcellent \nanalytical, problem-solving, and communication skills\n.\nPreferred Qualifications (Nice to Have):\nExperience with \nperformance testing tools\n (JMeter, Gatling, etc.).\nExposure to \nsecurity testing\n practices.\nFamiliarity with \nmobile application testing\n using tools like Appium.\nExperience in working with \ncloud platforms\n such as AWS, Azure, or Google Cloud."
  }
]